{
    "10072": {
        "category": "funny-redneck-jokes",
        "id": "10072",
        "punchline": "My girlfriend and I broke up... she said we could still be cousins though."
    },
    "10992": {
        "category": "funny-redneck-jokes",
        "id": "10992",
        "punchline": "The joke below is lame."
    },
    "11189": {
        "category": "funny-redneck-jokes",
        "id": "11189",
        "punchline": "Two rednecks were walking along when they saw a dog licking his balls. One said I wish I could do that! The other said, you dumbass he would bite you!"
    },
    "11977": {
        "category": "funny-redneck-jokes",
        "id": "11977",
        "punchline": "If your buddy says that he ran over a coon with this truck on the way over and you think good that's one less black person in the world, you might be a redneck."
    },
    "11992": {
        "category": "funny-redneck-jokes",
        "id": "11992",
        "punchline": "you might be a redneck if you ever used a toilet seat as a picture frame"
    },
    "13581": {
        "category": "funny-redneck-jokes",
        "id": "13581",
        "punchline": "I don't know about you guys, but girls that wear pink camo piss me off. What you huntin' child? Flamingos?"
    },
    "13696": {
        "category": "funny-redneck-jokes",
        "id": "13696",
        "punchline": "You might be a redneck if you've been married 3 times and you still have the same in laws"
    },
    "14207": {
        "category": "funny-redneck-jokes",
        "id": "14207",
        "punchline": "Why are redneck murder cases the hardest to solve?Because all the DNA matches and there are no dental records."
    },
    "14697": {
        "category": "funny-redneck-jokes",
        "id": "14697",
        "punchline": "You know you are a redneck if your address and your license plate number are the same"
    },
    "1483": {
        "category": "funny-redneck-jokes",
        "id": "1483",
        "punchline": "you know you are a redneck when u got a girl's number at a family reunion"
    },
    "15065": {
        "category": "funny-redneck-jokes",
        "id": "15065",
        "punchline": "You know you are a Redneck if you use all red lights at Christmas so you can leave them up until Valentines day"
    },
    "1511": {
        "category": "funny-redneck-jokes",
        "id": "1511",
        "punchline": "You might be a redneck if 5th grade was the best 6 years of your life.\n"
    },
    "15205": {
        "category": "funny-redneck-jokes",
        "id": "15205",
        "punchline": "got damnnn dem dare ding f*ckin over dare unda dat sum b*tch"
    },
    "1545": {
        "category": "funny-redneck-jokes",
        "id": "1545",
        "punchline": "What do you call 32 hillbillies standing in line?\nA full set of teeth!"
    },
    "15572": {
        "category": "funny-redneck-jokes",
        "id": "15572",
        "punchline": "So a woman walks into a bar with her goose and gets a drink, moments later after being there a drunk man walks up and asks her : \"Where did you get that Pig\" and She says : \"I'll have you know this is a goose\" and the drunk man says :\" I know, I was talking to the goose!\""
    },
    "15643": {
        "category": "funny-redneck-jokes",
        "id": "15643",
        "punchline": "YOU MITE BE A REDNECK IF YOU LIKE TO WERE BELT BUKLES BUT DO NOT WERE PANTS"
    },
    "1599": {
        "category": "funny-redneck-jokes",
        "id": "1599",
        "punchline": "You might be a redneck if:\nYou've ever been accused of lying through your tooth."
    },
    "16697": {
        "category": "funny-redneck-jokes",
        "id": "16697",
        "punchline": "Two rednecks were sitting in a bar discussing their favorite sex positions. One of them says, \"I think rodeo would have to my favorite\". The other one says, \"I've never heard of that one, what is it?\" So the first guy says, \"You sit on your wife's back with your hands on her boobs and say, 'these ...Read Morefeel just like your sister's' and then you have to try and stay on for 8 seconds\". Read Less"
    },
    "16957": {
        "category": "funny-redneck-jokes",
        "id": "16957",
        "punchline": "You might be a redneck if you use old Skoal cans for Christmas decorations"
    },
    "1711": {
        "category": "funny-redneck-jokes",
        "id": "1711",
        "punchline": "You might be a redneck if you bring lawn chairs to your cousin's wedding."
    },
    "17277": {
        "category": "funny-redneck-jokes",
        "id": "17277",
        "punchline": "you know your a redneck when you fall and the first thing you save is your beer."
    },
    "17491": {
        "category": "funny-redneck-jokes",
        "id": "17491",
        "punchline": "What's a rednecks last words!!Hold my beer aand watch this boys!!"
    },
    "18127": {
        "category": "funny-redneck-jokes",
        "id": "18127",
        "punchline": "If you go to a demolition derby.. and you BOTH liked it. You might be a redneck"
    },
    "1864": {
        "category": "funny-redneck-jokes",
        "id": "1864",
        "punchline": "*Girl is crying*Dad: Why ya' crying?Girl: My boyfriend dumped me!Dad (Grabs shotgun): I'll be back...*A while later, dad comes back*Girl: What the hell! Why did you kill him!Dad: I didn't!Girl: Where did you go, then?Dad: To get you ice cream of course.Girl: Why the hell did you bring the shot gun!?...Read MoreDad: So I could get it for free! Read Less"
    },
    "18669": {
        "category": "funny-redneck-jokes",
        "id": "18669",
        "punchline": "you might be a redneck if you go to a family reunion looking for a wife."
    },
    "19115": {
        "category": "funny-redneck-jokes",
        "id": "19115",
        "punchline": "Redneck pickup line.\"your pussy tastes almost as good as my beer\""
    },
    "201": {
        "category": "funny-redneck-jokes",
        "id": "201",
        "punchline": "If you mow your lawn and find a car...You might be a redneck."
    },
    "2039": {
        "category": "funny-redneck-jokes",
        "id": "2039",
        "punchline": "If loading the dishwasher means getting your wife drunk, you might be a redneck"
    },
    "20701": {
        "category": "funny-redneck-jokes",
        "id": "20701",
        "punchline": "What's the cheapest meat? Deer balls their under a buck"
    },
    "20713": {
        "category": "funny-redneck-jokes",
        "id": "20713",
        "punchline": "You might be a redneck if your mobile home has more miles than your car."
    },
    "20736": {
        "category": "funny-redneck-jokes",
        "id": "20736",
        "punchline": "Who needs a pickup line when ya have a pick-up truck."
    },
    "208": {
        "category": "funny-redneck-jokes",
        "id": "208",
        "punchline": "You just might be a redneck if nothing under your Christmas tree is paid for."
    },
    "209": {
        "category": "funny-redneck-jokes",
        "id": "209",
        "punchline": "If your wife's boss paid for her boob job, you might be a redneck."
    },
    "20950": {
        "category": "funny-redneck-jokes",
        "id": "20950",
        "punchline": "An old timer was sitting in his rocking chair on his front portch when a kid comes walking by with something in his hands.The old timer asks the kid, \"Hey son. Whatcha got there?\"The kid replies, \"I got me some chicken wire. I'm gonna catch me some chickens.\"The old timer responds, \"Oh son, you can'...Read Moret catch no chickens with chicken wire.\"A short time later the old timer sees the kid come back with a bunch of flapping chickens all caught up in the chicken wire.\"Well, I'll be...'\" says the old timer scratching his head.The next day the kid comes walking past the old timer. This time he has something round and gray in his hands.The old timer shouts out to the kid, \"Hey kid, whatcha got in your hands this time?\"The kid responds, \"I got me some duct tape. I'm gonna catch me some ducks.\"The old timer laughs, \"Son, you can't catch no ducks using duct tape.\"A short time later the kid comes back with a bunch of ducks caught-up and quacking in the duct tape.\"The old man cannot believe his eyes.The next day the kid comes walking past the old timer, again with something in hs hands.The old timer shouts out to the kid, \"Hey kid, whatcha got in your hands today?\"The kid shouts back to the old timer, \"I got me some pussy willow.\"The old timer shouts out, \"Hold on son...while I get my hat!\" Read Less"
    },
    "210": {
        "category": "funny-redneck-jokes",
        "id": "210",
        "punchline": "You might be a redneck if you think a turtleneck is a key ingredient in soup."
    },
    "21011": {
        "category": "funny-redneck-jokes",
        "id": "21011",
        "punchline": "Q: How do you circumcise a redneck?A: Kick his sister in the jaw."
    },
    "211": {
        "category": "funny-redneck-jokes",
        "id": "211",
        "punchline": "You might be a redneck if your boat has not left the driveway in 15 years."
    },
    "21387": {
        "category": "funny-redneck-jokes",
        "id": "21387",
        "punchline": "what did the redneck say to the stripper........ \"call dad, he worries sis\""
    },
    "22471": {
        "category": "funny-redneck-jokes",
        "id": "22471",
        "punchline": "A redneck had become a major buyer of a furniture company in Alabama. The company sent him to buy some new lines of furniture in France, they gave him three days to buy the furniture. The redneck went over there on the first day and closed the deal with a furniture manufacturer, so he had two days ...Read Moreleft. He decided to go to a bistro and have some wine, he sat down had a glass and he sees a very good looking woman across the room and motions her so come over there, and the woman started to speak to him in french so put his hand up to hush her up, and he drew a picture of a wine glass and she nods her head and he orders her a glass of wine and they continue to talk this way, he then draws some food and she nods her head so they go to restaurant and he orders two plates of pasta and they continue to talk through drawing. When the redneck hears some music playing he draws a picture of two stick figures dancing, and she nods her head and they start dancing. So when they stop dancing the woman draws a picture of a four post bed, and till this day that redneck does not know how she knew he was in the furniture business. Read Less"
    },
    "22988": {
        "category": "funny-redneck-jokes",
        "id": "22988",
        "punchline": "If you dad walks you to school because you're both in the same class. You might be a redneck"
    },
    "244": {
        "category": "funny-redneck-jokes",
        "id": "244",
        "punchline": "You might be a redneck if The Salvation Army declines your mattress."
    },
    "245": {
        "category": "funny-redneck-jokes",
        "id": "245",
        "punchline": "You might be a redneck if, Santa Claus refuses to let your kids sit in his lap."
    },
    "246": {
        "category": "funny-redneck-jokes",
        "id": "246",
        "punchline": "You might be a redneck if, your toilet paper has page numbers on it."
    },
    "24676": {
        "category": "funny-redneck-jokes",
        "id": "24676",
        "punchline": "Redneck told wife- when are you going to Britain for your training , dear ?Wife - next week darling. What gift should I bring for you from Britain? Redneck - Bring cute sexy british blonde for me.15 days later wife returns from Britain. Redneck - where is cute sexy british girl, you promised me ?...Read MoreWife - wait for 9 month darling. Read Less"
    },
    "247": {
        "category": "funny-redneck-jokes",
        "id": "247",
        "punchline": "You might be a redneck if, your dad walks you to school because you are both in the same grade."
    },
    "25081": {
        "category": "funny-redneck-jokes",
        "id": "25081",
        "punchline": "Redneck Teases his ex-wife's new husband: So, dude how was the second-hand stuff?New husband: Not bad. After the first inche, she was brand new."
    },
    "25083": {
        "category": "funny-redneck-jokes",
        "id": "25083",
        "punchline": "Latest product in the market: George Bush condoms - ideal for f*ckers who dont know when to pull out"
    },
    "25145": {
        "category": "funny-redneck-jokes",
        "id": "25145",
        "punchline": "What does a hurricane, tornado, and redneck divorce have in common? -Someone's losing a damn trailer"
    },
    "25164": {
        "category": "funny-redneck-jokes",
        "id": "25164",
        "punchline": "Redneck puts in his resignation infront of his american bossBoss: Why are you leaving? Redneck: I have vaginal problems.Boss : But you're a man!Redneck: That I am, Sir. But you are a VAGINA!Happy Boss Day.....!!!!!"
    },
    "25327": {
        "category": "funny-redneck-jokes",
        "id": "25327",
        "punchline": "A Redneck scientist is on project about cockroach and its behavior. He puts cockroach on table n shouts RUN. it starts running. He picks it again and cuts out front 2 legs n shouts RUN . Cockroach again runs this time slower.He then chop out his 2 middle legs and shouts RUN. Cockroach scrambles it ...Read Morevery slowly.He then chops remaining 2 legs and shouts RUN. Poor creature don't move at all.He summarises in end - Cockroach becames deaf if you chopout his legs .....!!!!! Read Less"
    },
    "25376": {
        "category": "funny-redneck-jokes",
        "id": "25376",
        "punchline": "Girl: How do you do?Redneck: Same old Method... Legs on the shoulder and then extreme jerks and shakes.....!!!!!"
    },
    "25683": {
        "category": "funny-redneck-jokes",
        "id": "25683",
        "punchline": "Anant to his redneck friend, \"Take care bro. Keep your curtains close while fucking your wife. Yesterday afternoon, all street people enjoyed watching while you were screwing!\"\nRedneck to Anant, \"Shut up. Yesterday, I was out of town.\""
    },
    "25899": {
        "category": "funny-redneck-jokes",
        "id": "25899",
        "punchline": "Redneck asked his friend Anant \" I want to divorce my wife and marry her sister. She must be hot in bed. What do you think ?Anant - Don't make mistake. Both are same while fuuking. There is no difference\""
    },
    "26241": {
        "category": "funny-redneck-jokes",
        "id": "26241",
        "punchline": "Two doctors Anna and redneck are having sex, Redneck says to her, \"You must be a surgeon, you washed your hands before and after.\" Anna replies, \"Well you must be an anesthetist, because I didn't feel anything!\""
    },
    "26398": {
        "category": "funny-redneck-jokes",
        "id": "26398",
        "punchline": "Anant to Redneck ‘you are an extremely good example of oral contraception.'Redneck : how ?Whenever you asked a girl to go to bed , she says “No”."
    },
    "2660": {
        "category": "funny-redneck-jokes",
        "id": "2660",
        "punchline": "Redneck: Help! My buddy fell out of the deer stand I think; I think he might be dead.911: Sir, please calm down; can you make sure he's not alive?Redneck: Yea, just a sec. *gunshot* Ok, he's dead, now what?"
    },
    "27181": {
        "category": "funny-redneck-jokes",
        "id": "27181",
        "punchline": "Redneck was in a bar looking very dejected. His friend, Anant, walked over and asked, \"What's wrong?\"\"It's my mother-in-law,\" Redneck replied, while shaking his head sadly. \"I have a real problem with her.\"\"Cheer up,\" Anant said. \"Everyone has problems with their mother-in-law.\"\"Yeah, sure,\" ...Read MoreRedneck answered. \"But not everybody gets theirs pregnant!\" Read Less"
    },
    "27182": {
        "category": "funny-redneck-jokes",
        "id": "27182",
        "punchline": "Anant is walking on campus one day when Redneck rides up on a shiny new motorcycle.\"Where did you get such a rockin' bike?\" asked AnantRedneck \"Well, I was walking along yesterday minding my own business when a beautiful woman rode up on this bike. She threw the bike to the ground, took off all her ...Read Moreclothes and said 'Take what you want.'\" \"And Her clothes probably wouldn't have fit.\" Read Less"
    },
    "27352": {
        "category": "funny-redneck-jokes",
        "id": "27352",
        "punchline": "Redneck goes into a doctors Anant and says \"Doctor, doctor you've gotta help me. I just can't stop having sex!\"\"Well how often do you have it?\" the doctor anant asks.\"Well, twice a day I have sex with my wife, TWICE a day\", he answers back.\"That's not so much\", says dr anant.\"Yes, but thats not ...Read Moreall. Twice a day I have sex with my secretary, TWICE a day,\" replies the man.\"Well that is probably a bit excessive,\" says the doctor.\"Yes, but thats not all. Twice a day I have sex with my neighbour pakistani lady, TWICE a day,\" says the redneck\"Well, that's definitely to much\", says the dr Anant. \"You've got to learn to take yourself in hand.\"\"I do\", says the redneck. \"Twice a day !!! Read Less"
    },
    "27575": {
        "category": "funny-redneck-jokes",
        "id": "27575",
        "punchline": "What do rednecks say after sex?\nThanks mom"
    },
    "27587": {
        "category": "funny-redneck-jokes",
        "id": "27587",
        "punchline": "Redneck: Hurry-up, hurry-up, give me a drink. Fight is about to start.Bartender Anant gives him a drink.Redneck again says: Hurry-up, hurry-up, give me drink. Fight is about to start.Anant again gives him a drink.Redneck again asks for a drink as the fight is about to star.Anant: When on earth the ...Read Morefight will start?Redneck: When you will ask for money !!! Read Less"
    },
    "27588": {
        "category": "funny-redneck-jokes",
        "id": "27588",
        "punchline": "Redneck was busy in removing a 2 wheels from his car,Anant asks: Y r u removing a wheel from ur car ?Redneck: Can't u read 'Parking for two wheelers only'"
    },
    "27742": {
        "category": "funny-redneck-jokes",
        "id": "27742",
        "punchline": "Redneck went to the doctor Anant's office to ask for a triple dose of Viagra.The doctor told him that he couldn't allow him a triple dose.\"Why not?' asked Redneck\"Because it's not safe,' replied the doctor Anant\"But I need it really bad,' said Redneck\"Well, why do you need it so badly?' asked the ...Read Moredoctor AnantRedneck answered, \"My girlfriend is coming into town on Friday; my ex-wife will be here on Saturday; and my wife is coming home on Sunday. Can't you see? I must have a triple dose.\"On Monday, Redneck dragged himself in to the doctor's office, his right arm in a sling.The doctor asked, \"What happened to you?\"Redneck said, \"No one showed up.\" Read Less"
    },
    "290": {
        "category": "funny-redneck-jokes",
        "id": "290",
        "punchline": "You might be a redneck if you've ever used a toilet seat as a picture frame."
    },
    "29034": {
        "category": "funny-redneck-jokes",
        "id": "29034",
        "punchline": "what do you call a 13 year old girl from Kentucky that can run faster than her brothers?A virgin"
    },
    "29145": {
        "category": "funny-redneck-jokes",
        "id": "29145",
        "punchline": "One day a happy redneck man runs home to his father saying \"Father! Father! I've found the perfect girl, but she's a virgin\". The father being very upset replies to his son saying \"if she's not good enough for her family, she aint good enough for ours\"."
    },
    "30434": {
        "category": "funny-redneck-jokes",
        "id": "30434",
        "punchline": "A law yer and a redneck are on a plane and the lawyer, who needed cash, decided to trick the redneck. He said \"Hey let's play a game. I'll ask a question and if you can't answer it you give me five bucks. Then you ask me a question and if I can't answer it I owe you fifty bucks.\" The redneck agrees,...Read More and lawyer asks \" Who was the first president?\" The redneck is stumped and hands over five bucks. Then the redneck asks \"What goes up a hill with three legs and comes down with four?\" The lawyer has no idea and hands over fifty bucks. He asks \"What was the answer?\" And the redneck hands over five bucks. Read Less"
    },
    "31364": {
        "category": "funny-redneck-jokes",
        "id": "31364",
        "punchline": "What did a red neck say when he lost his virginity?Thanks, mom."
    },
    "3176": {
        "category": "funny-redneck-jokes",
        "id": "3176",
        "punchline": "You might be a redneck if you let your sixteen year old daughter smoke at the dinner table......in front of her kids."
    },
    "32454": {
        "category": "funny-redneck-jokes",
        "id": "32454",
        "punchline": "Why do rednecks like having sex doggie style?That way they can both watch wrestling."
    },
    "33711": {
        "category": "funny-redneck-jokes",
        "id": "33711",
        "punchline": "why did the redneck cross the road he couldn't get his dick out of the chicken"
    },
    "35": {
        "category": "funny-redneck-jokes",
        "id": "35",
        "punchline": "You think Possum is \"The Other White Meat\""
    },
    "37050": {
        "category": "funny-redneck-jokes",
        "id": "37050",
        "punchline": "You don't need a college degree to be a FARMER!"
    },
    "3771": {
        "category": "funny-redneck-jokes",
        "id": "3771",
        "punchline": "You might be a redneck if you see a sign that says no crack and it reminds you to pull your pants up."
    },
    "3807": {
        "category": "funny-redneck-jokes",
        "id": "3807",
        "punchline": "You might be a redneck if your daughter's sweet sixteen is sponsored by Budweiser."
    },
    "38530": {
        "category": "funny-redneck-jokes",
        "id": "38530",
        "punchline": "Q:What do cops hate the most about hillbilly murder cases?A: No dental records and ALLLLL the DNA matches!!"
    },
    "4042": {
        "category": "funny-redneck-jokes",
        "id": "4042",
        "punchline": "A teacher has a class full of rednecks. She asks someone to use the word 'Timbuktu' in a story.A scrawny kid in the back raises his hand and recites proudly:Tim and me, a hikin' we went,Till we found three whores in a pitch-up tent.They were three and we were two;So I buck one and Tim buck two!"
    },
    "41959": {
        "category": "funny-redneck-jokes",
        "id": "41959",
        "punchline": "The great thing about a redneck divorce is that you can still be cousins afterwards."
    },
    "420": {
        "category": "funny-redneck-jokes",
        "id": "420",
        "punchline": "You might be a redneck if, you've ever raked leaves in your kitchen."
    },
    "4204": {
        "category": "funny-redneck-jokes",
        "id": "4204",
        "punchline": "How do rednecks get circumcised? \n\nKicking the sister in the jaw"
    },
    "42423": {
        "category": "funny-redneck-jokes",
        "id": "42423",
        "punchline": "I heard this one from an old sailorA girl walks into her trailer and says, \"Pa! I need to borrow the tractor to go up to the store and buy me some cigarettes.\"Her Pa says, \"Alright, but you gonna have to work for it.\"\"What do I have to do,\" asked the girl. \"You gonna have to blow me if you want ...Read Morethat tractor.\"\"Alright Pa,\" says the girl.The girl starts sucking her Pa's dick. A second later she say, \"Ew Pa, your dick taste like shit!\"Her Pa replies, \"Sorry, your brother borrowed the tractor this morning.\" Read Less"
    },
    "42522": {
        "category": "funny-redneck-jokes",
        "id": "42522",
        "punchline": "You know a redneck is about to do something dumb when they say, \"Watch this.\""
    },
    "42820": {
        "category": "funny-redneck-jokes",
        "id": "42820",
        "punchline": "What do Rednecks say after sex? Thanks Mum."
    },
    "4356": {
        "category": "funny-redneck-jokes",
        "id": "4356",
        "punchline": "What did the redneck say before he died?\"Watch this! Hold my beer.\""
    },
    "45203": {
        "category": "funny-redneck-jokes",
        "id": "45203",
        "punchline": "How do you make a rednecks dick hurt. Kick his sister's jaw"
    },
    "4781": {
        "category": "funny-redneck-jokes",
        "id": "4781",
        "punchline": "you might be a redneck if you think\nduct tape is spelled duck tape"
    },
    "494": {
        "category": "funny-redneck-jokes",
        "id": "494",
        "punchline": "If you have more guns than teeth, you might be a redneck."
    },
    "495": {
        "category": "funny-redneck-jokes",
        "id": "495",
        "punchline": "If you use the end of your fishing pole to unlock the inside of your car, you might be a redneck."
    },
    "5015": {
        "category": "funny-redneck-jokes",
        "id": "5015",
        "punchline": "You might be a redneck if you have ever fallen asleep in a waffle house"
    },
    "5416": {
        "category": "funny-redneck-jokes",
        "id": "5416",
        "punchline": "What do you tell a girl with a black eye?  \nNothing you already told her once"
    },
    "5836": {
        "category": "funny-redneck-jokes",
        "id": "5836",
        "punchline": "You might be a redneck if you think that anal sex is just an affordable form of birth control."
    },
    "6050": {
        "category": "funny-redneck-jokes",
        "id": "6050",
        "punchline": "You might be a redneck if you can move your house with your truck."
    },
    "6158": {
        "category": "funny-redneck-jokes",
        "id": "6158",
        "punchline": "How do you get away from a redneck. Take a hard right"
    },
    "6258": {
        "category": "funny-redneck-jokes",
        "id": "6258",
        "punchline": "Do you know why Orange is the official color of the University of Tennessee? \n\nSo they can hunt on Saturday,  go to the game Sunday,  and pick up trash along the roads on Monday."
    },
    "6333": {
        "category": "funny-redneck-jokes",
        "id": "6333",
        "punchline": "How do you get a redneck to the dinner table?\nHEY THEY GOT BEER HERE!!"
    },
    "6359": {
        "category": "funny-redneck-jokes",
        "id": "6359",
        "punchline": "If a married couple in Virginia get divorced, are they still cousins?"
    },
    "6469": {
        "category": "funny-redneck-jokes",
        "id": "6469",
        "punchline": "Being married is great, especially when your wife looks like your favorite country star. To make it even better, my friends wife looks like his favorite country star too. But one day the got into a cat fight at the mall and some one yells \"Damn, Toby Keith is kicking Willie nelsons ass\"."
    },
    "6761": {
        "category": "funny-redneck-jokes",
        "id": "6761",
        "punchline": "What is a rednecks best friend last words? I can do that "
    },
    "7007": {
        "category": "funny-redneck-jokes",
        "id": "7007",
        "punchline": "You know you're a redneck if you're Christmas lights are inside of empty shot gun shells"
    },
    "9059": {
        "category": "funny-redneck-jokes",
        "id": "9059",
        "punchline": "You might be a redneck if you set up a lawn chair next to a highway and cheer"
    },
    "9470": {
        "category": "funny-redneck-jokes",
        "id": "9470",
        "punchline": "MAN: I'm so sorry the marriage didn't work out.WOMAN: It's okay, we can still be cousins."
    }
}