{
    "1": {
        "category": "funny-blonde-jokes",
        "id": "2833",
        "punchline": "What did the blonde say when she found out that she was pregnant?\nI hope it's not mine."
    },
    "2": {
        "category": "funny-blonde-jokes",
        "id": "11170",
        "punchline": "This blonde decides one day that she is sick and tired of all these blonde jokes and how all blondes are perceived as stupid, so she decides to show her husband that blondes really are smart. While her husband is off at work, she decides that she is going to paint a couple of rooms in the house. ...Read MoreThe next day, right after her husband leaves for work, she getsdown to the task at hand. Her husband arrives home at 5:30 and smells the distinctive smell of paint. He walks into the living room and finds his wife lying on the floor in a pool of sweat. He notices that she is wearing a ski jacket and a fur coat at the same time. He goes over and asks her if she is OK. She replies yes. He asks what she is doing. She replies that she wanted to prove to him that not all blonde women are dumb and she wanted to do it bypainting the house. He then asks her why she has a ski jacket over her fur coat. She replies that she was reading the directions on the paint can and they said.... FOR BEST RESULTS, PUT ON TWO COATS. Read Less"
    },
    "3": {
        "category": "funny-blonde-jokes",
        "id": "1823",
        "punchline": "Death: It's your time. give me your hand\nBlonde: No! i know that if i dont touch you then I'll never die!\nDeath: Holy shit! You figured out the key to living forever! You're soooo smart! High five!\nBlonde: *high fives* \nDeath: Typical blonde... Dumbass..."
    },
    "4": {
        "category": "funny-blonde-jokes",
        "id": "2966",
        "punchline": "There are three moms. A Brunette, a Redhead, and a Blonde. \n\nThey were all talking one day and the brunette says \"Oh my gosh y'all I went through my daughter's purse the other day to get some gum, and I found an ounce of weed. I cannot believe she smokes weed.\" \n\nThey comfort her, and the redhead ...Read Moresays \"Yeah, well I found a fake I. D. In my daughter's purse. I cannot believe she has one\". So they all comfort her.\n\nThen the blonde says \"That's nothing. I found a condom in my daughter's purse. I just cannot believe she has a penis\" Read Less"
    },
    "5": {
        "category": "funny-blonde-jokes",
        "id": "5111",
        "punchline": "This is a true story of a poor dizzy blond flying in a two-seater airplane with just the pilot.\n\nHe has a heart attack and dies. She, frantic,calls out a May Day.\n\n\"May Day! May Day! Help Me! Help Me! My pilot had a heart attack and is dead and I don't know how to fly. Help Me! Please Help Me!\"\n\n...Read MoreShe hears a voice over the radio saying: \n\n\"This is Air Traffic Control and I have you loud and clear. I will talk you through this and get you back on the ground. I've had a lot of experience with this kind of problem. Now, just take a deep breath. Everything will be fine! Now give me your height and position!\"\n\nShe says, \"I'm 5'4 and i'm in the front seat.\"\n\n(pause)\n\n\"O.K.\" says the voice in the radio.......\n\"Repeat after me: Our father who art in heaven........\" Read Less"
    },
    "6": {
        "category": "funny-blonde-jokes",
        "id": "7858",
        "punchline": "there are 3 girls on a island. they are blond, brunette and a black haired.after 3 weeks of starvation god comes down and says \"Go home alredy. i will give you 1 wish each. use it wisley.the brunette says \"i want to go home!\" and poof she goes home.the black says \"i want to go home!\" and poof she ...Read Moregoes home.the the blonde says \"i want my friends back!\" Read Less"
    },
    "7": {
        "category": "funny-blonde-jokes",
        "id": "23061",
        "punchline": "A blonde really got tired of all blonde jokes and decided to hang herself in the bathroom. As she locked the door, she yelled at her husband, \"I'm hanging myself because I'm tired of jokes about us blondes being stupid!\" Her husband broke into the bathroom and saw his wife with a rope tied on her ...Read Moretoe. The husband said, \"I thought you were hanging yourself.\" She said, \"Yes, I am!\" The husband replied, \"Usually when people hang themselves, they tie the rope around their neck, so why is yours tied on your toe?\" She said, \"I tried that, but I couldn't breathe.\" Read Less"
    },
    "8": {
        "category": "funny-blonde-jokes",
        "id": "18087",
        "punchline": "A blind man walks into a bar, makes his way to a bar stool and orders a drink. After sitting there for a while, he yells to the bartender. \"Hey, You wanna hear a blonde joke?\"The bar immediately falls absolutely quiet. In a very deep, husky voice, the woman next to him says, \"Before you tell that ...Read Morejoke, sir, I think it is only fair that you should know five things.Number One. The bartender is a blonde girl with a baseball bat.Number Two. The bouncer is a blonde girl.Number Three. I'm a six-foot-tall, 175 lb. Blonde woman with a black belt in karate.Number Four. The woman sitting next to me is blonde and a professional weightlifter.Number Five. The lady to your right is blonde and a professional wrestler.She concludes by smugly asking, \"Now think about it seriously, mister.Do you still wanna tell that joke?\"The blind man thinks for a second, shakes his head and mutters, \"Nah, not if I'm gonna have to explain it five f*cking times.\" Read Less"
    },
    "9": {
        "category": "funny-blonde-jokes",
        "id": "2899",
        "punchline": "What do you do when a blonde throws a grenade at you?\nPull the pin and throw it back"
    },
    "10": {
        "category": "funny-blonde-jokes",
        "id": "5544",
        "punchline": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see"
    },
    "11": {
        "category": "funny-blonde-jokes",
        "id": "17318",
        "punchline": "Brunette: I'll be the first brunette to walk on Mars!Ginger: I'll be the first ginger to walk on Venus!Blonde: I'll be the first blonde to walk on the sun!Ginger: You'll burn up if you try.Blonde: Don't worry, I'll go at night"
    },
    "12": {
        "category": "funny-blonde-jokes",
        "id": "9577",
        "punchline": "A blonde and red head are walking in the woods when then red head has a heart attack and falls to the ground. Shocked, the blonde takes out her phone and calls the police and she shouts, \"I think my friend is dead what do I do?\". The policeman on the phone says, \"Calm down and listen to me. First ...Read Moremake sure that he really is dead.\" There is a silence. Then a loud gunshot. The blonde gets back on the phone and says, \"Okay, now what?\" Read Less"
    },
    "13": {
        "category": "funny-blonde-jokes",
        "id": "33421",
        "punchline": "a Blonde a brunet and a redhead are about to be executed the brunet goes up first the executioner yells ready aim and the brunet yells earthquake the brunet escapes then its the redheads turn the executioner yells ready aim the redhead yells tornado she escapes too then the blonds goes up she knows ...Read Morewhat the other 2 did the executioner yells ready aim and the blonde yells fire...... think about it and kickass if you get it Read Less"
    },
    "14": {
        "category": "funny-blonde-jokes",
        "id": "27322",
        "punchline": "Anna said to her mother, \"My hands are freezing cold.\"The mother replied, \"Put them between your legs. Your body heat will warm them up.\"Anna did and her hands warmed up.The next day, the Anna was riding with her boyfriend who said, \"My hands are freezing cold.\"Anna replied, \"Put them between my ...Read Morelegs. The warmth of my body will warm them up.\"He did and it warmed his hands.The next day the boyfriend was again driving with Anna and said, \"My penis is frozen solid.\"The following day, Anna was driving in the buggy with her mother, and she says to her mother, \"Have you ever heard of a penis?\"Slightly concerned the mother said, \"Why, yes. Why do you ask?\"Anna replies, \"They make one heck of a mess when they defrost, don't they?\" Read Less"
    },
    "15": {
        "category": "funny-blonde-jokes",
        "id": "10593",
        "punchline": "a blonde walks into a shop and asks how much is that t.v in the back.shopkeeper replies sorry i dont serve blondes.the blonde went away and died her hair brown and went back the very next day and asked again.the shop keeper says sorry i dont serve blondes.the blonde went away and died her hair blue ...Read Moreand went back the next day and asked one last time.the shop keeper replies sorry i dont serve blondes.the blonde asks how can you tell that im blonde?the shop keeper replies thats not a T.V thats a microwave. Read Less"
    },
    "16": {
        "category": "funny-blonde-jokes",
        "id": "2908",
        "punchline": "There's a blonde. She enters a laughing contest. There's 10 levels to the contest. She gets to the 9th level and bursts into laughter. The host asks her \"Why did you laugh, you could have won.\" The blonde reply's, \"I finally got the first joke.\""
    },
    "17": {
        "category": "funny-blonde-jokes",
        "id": "3895",
        "punchline": "A blonde, a brunette, and a redhead were atop a 5 story building when a genie appeared and told them to run to the edge, jump off, and name anything they want to become. the brunette ran, jumped off, and said butterfly, the redhead ran jumped and said eagle, the blonde ran tripped over the edge and said \"ah shit!\""
    },
    "18": {
        "category": "funny-blonde-jokes",
        "id": "20083",
        "punchline": "Friend: What is \"Suite Life Of Zack And Cody\"?Me: The only TV show with a smart blonde and dumb Asian."
    },
    "19": {
        "category": "funny-blonde-jokes",
        "id": "27180",
        "punchline": "A pakistani girl tells her Mom that she has missed her period for two months. Very worried, the mother goes to the drugstore and buys a pregnancy kit.The test result shows that the girl is pregnant.Shouting, cursing, crying, the mother says, Who was the pig that did this to you? I want to know!...Read MoreThe girl picks up the phone and makes a call.Half an hour later a Ferrari stops in front of their house, Anant steps out of the car and enters the house.He sits in the living room with the father, the mother and the girl, and tells them, Good morning, your daughter has informed me of the problem. However, I can't marry her because of my personal family situation, but I'll take charge.If a girl is born, I will bequeath her two retail stores, a townhouse, a beach villa and a $2,000,000 bank account.If a boy is born, my legacy will be a couple of factories and a $5,000,000 bank account. If it is twins, a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?At this point, the father who had remained silent, places a hand firmly on the Anant's shoulder and tells him:Then you try again ! Read Less"
    },
    "20": {
        "category": "funny-blonde-jokes",
        "id": "14104",
        "punchline": "There once was a magic mirror which would kill you if you lied to it. One day a brunette was doing her makeup and said to herself \"I think I'm the smartest woman ever!\" She immediately dropped dead. The next day a redhead was doing her hair and said to herself \"I think I'm the prettiest woman alive!...Read More\" She immediately dropped dead. Finally, the following day, a blond was flossing her teeth. She stopped and said to herself \"I think,\" and dropped dead. Read Less"
    },
    "21": {
        "category": "funny-blonde-jokes",
        "id": "19450",
        "punchline": "two blondes fall in a hole, and one of them says,\" it's dark in here isn't it?\" and the other one says,\" i don't know, i can't see.\""
    },
    "22": {
        "category": "funny-blonde-jokes",
        "id": "19269",
        "punchline": "16 Blondes are standing outside the bar. Why didn't they go in?The sign said 18+"
    },
    "23": {
        "category": "funny-blonde-jokes",
        "id": "1694",
        "punchline": "Blonde: Officer theres like a thousand dead people here!\nCop: Okay, calm down. Where are you?\nBlonde: The cemetery!\nCop: *facepalm*"
    },
    "24": {
        "category": "funny-blonde-jokes",
        "id": "1824",
        "punchline": "So a blonde walks into a Bar at a hotel that has it on the top story and sits Down. A man in a Trench coat Leans over to her and says,\"You should get this beer\" *Holds up bottle* \"It allows you to do amazing things!\"\n\nAt this the man stands up, jumps out the window and Flies around twice before ...Read Morecoming back into the Building. The blonde then orders the Same beer. She drinks it. And then Jumps out the window. And falls to her death. \n\nThe Owner of the Bar then turns to the man in the coat and says, \"You know you're a real Prick when you're drunk, Superman.\" Read Less"
    },
    "25": {
        "category": "funny-blonde-jokes",
        "id": "7230",
        "punchline": "Blonde Customer at McDonald's: how many chicken nuggets come in a 6 piece? \nBlonde Cashier : I don't know let me check."
    },
    "26": {
        "category": "funny-blonde-jokes",
        "id": "25087",
        "punchline": "A Blonde's nursery rhyme:One two lets screw,Three four I'm a whore,Five six suck the dick,Seven eight ejaculate,Nine ten f*ck me again."
    },
    "27": {
        "category": "funny-blonde-jokes",
        "id": "21963",
        "punchline": "There was a blonde who wanted a promotion at work, but her employer denied her the oppurtunity because she was blonde, so she dyed her hair a light brown colour, thinking it would do the trick, she would try it at work but first she was going to try it on the general public. So one day, she was in ...Read Morethe countryside, and she pulled up by a farm, there was a farmer tending to some sheep, when she asked, \"if I can count how many sheep are in your field, could I have one.\" \"That is a deal, young lady,\" he replied. So she counted them up and finally counted them all.\"126\"\"Well young lady, a deal is a deal, take your pick\"She was walking back to the car when the farmer called. \"Young lady, if I guess what colour your hair really is, can I have my dog back??\" Read Less"
    },
    "28": {
        "category": "funny-blonde-jokes",
        "id": "2130",
        "punchline": "One day while a blonde was out driving her car, she ran into a truck. The truck driver made her pull over into a parking lot and get out of the car. He took a piece of chalk and drew a circle on the pavement. He told her to stand in the middle and not leave the circle. Furious, he went over to her ...Read Morecar and slashed the tires. The blonde started laughing. This made the man angrier so he smashed her windshield. This time the blonde laughed even harder. Livid, the man broke all her windows and keyed her car. The blonde is now laughing hysterically, so the truck driver asks her what’s so funny. The blonde giggled and replied, “When you weren’t looking, I stepped out of the circle three times! Read Less"
    },
    "29": {
        "category": "funny-blonde-jokes",
        "id": "5978",
        "punchline": "Blonde: \"What does IDK stand for?\"\nBrunette: \"I don’t know.\"\nBlonde: \"OMG, nobody does!\""
    },
    "30": {
        "category": "funny-blonde-jokes",
        "id": "26694",
        "punchline": "Anna and blonde are walking home from a night at the bar and have to pee, so they stop at a cemetery. With nothing to wipe with Anna uses her panties and the blonde uses a nearby wreath.The next day anna's boyfriend calls his friend, \"They are never going out again! Anna came home without panties!\"...Read MoreThe other replies, \"You think that's bad? My girlfriend came with a card in her crack that said, 'From all of us at the fire station, we will never forget you!'\" Read Less"
    },
    "31": {
        "category": "funny-blonde-jokes",
        "id": "14869",
        "punchline": "What do you do if a blonde throws a grenade at you? Pick it up, pull the pin and throw it back"
    },
    "32": {
        "category": "funny-blonde-jokes",
        "id": "2622",
        "punchline": "Im changing my name to 'Benefits' on Facebook.\nNext time someone adds me, It will say 'you are now friends with Benefits'"
    },
    "33": {
        "category": "funny-blonde-jokes",
        "id": "14989",
        "punchline": "How do you confuse a blonde? Put her in a circular room and tell her to sit in the corner."
    },
    "34": {
        "category": "funny-blonde-jokes",
        "id": "9933",
        "punchline": "How do you keep a Blonde busy? Give the Blonde a piece of paper that has the words 'Turn Over' on both sides!"
    },
    "35": {
        "category": "funny-blonde-jokes",
        "id": "32311",
        "punchline": "a blonde walked into a department store and said \"i would like to buy this tv\". the manager said \"sorry we don't sell to blondes\". the blonde was so mad, she went home and died her hair black. she went back to the department store and said \"i would like to buy this tv please\", the manager said \"...Read Moresorry we don't sell to blondes\". the blonde was furious. she went home and died her hair red but waited a couple of days to return. after a couple of days she returned to the department store and said \"i would like to buy this tv please\". the manager replied with \"we don't sell to blondes\". the blonde said how do you know I'm a blonde. the manager said \"because that's a microwave\" Read Less"
    },
    "36": {
        "category": "funny-blonde-jokes",
        "id": "10151",
        "punchline": "\"I'm so good at cooking, even the fire alarm is cheering me on.\" - Blonde"
    },
    "37": {
        "category": "funny-blonde-jokes",
        "id": "18280",
        "punchline": "a redhead, brunette, and a blonde escape from prison they run to a farm where they hide in a barn in sacks so the cops look for them they go to the barn and the cop kicks the sack with the redhead in and the redhead makes a cat noise so the cop says oh just a cat and then he kicks the second one ...Read Moreand the brunette makes a dog noise. the cop says just a dog and then he kicks the one with the blonde in and she says potatoes Read Less"
    },
    "38": {
        "category": "funny-blonde-jokes",
        "id": "7595",
        "punchline": "A blonde police officer stops a blonde driver,Officer: Can i see your drivers license?Driver: yeah i think i have one of those, what does it look like?Officer: It's rectangle is shape and has your face on it.Driver: Oh, okay, *pulls out mirror*, here you go.Officer: *looks at reflection*, I'm sorry ...Read Morema'am, i didn't know you were an officer of the law, you may carry on. Read Less"
    },
    "39": {
        "category": "funny-blonde-jokes",
        "id": "15450",
        "punchline": "What is the difference between a blonde and a mosquito?The mosquito stops sucking after you slap it."
    },
    "40": {
        "category": "funny-blonde-jokes",
        "id": "33003",
        "punchline": "A guy took his BLONDE girlfriend to her very first football game. They had great seats behind their teams bench! After the game, he asked how her first experience was. \"Oh I really liked it,\" she replied, especially the tight pants and all the big muscles, but I just couldn't understand why they ...Read Morewere killing each other over 25 cents!?!?\" Dumbfounded, her date asked, ''What do you mean by that?'' ''Well, they flipped a coin, one team got it and then for the rest of the game, all they kept screaming was, \"GET THE QUARTERBACK!\" I'm like, \"Hellooo it's only 25 cents!\" Read Less"
    },
    "41": {
        "category": "funny-blonde-jokes",
        "id": "19450",
        "punchline": "two blondes fall in a hole, and one of them says,\" it's dark in here isn't it?\" and the other one says,\" i don't know, i can't see.\""
    },
    "42": {
        "category": "funny-blonde-jokes",
        "id": "19269",
        "punchline": "16 Blondes are standing outside the bar. Why didn't they go in?The sign said 18+"
    },
    "43": {
        "category": "funny-blonde-jokes",
        "id": "1694",
        "punchline": "Blonde: Officer theres like a thousand dead people here!\nCop: Okay, calm down. Where are you?\nBlonde: The cemetery!\nCop: *facepalm*"
    },
    "44": {
        "category": "funny-blonde-jokes",
        "id": "1824",
        "punchline": "So a blonde walks into a Bar at a hotel that has it on the top story and sits Down. A man in a Trench coat Leans over to her and says,\"You should get this beer\" *Holds up bottle* \"It allows you to do amazing things!\"\n\nAt this the man stands up, jumps out the window and Flies around twice before ...Read Morecoming back into the Building. The blonde then orders the Same beer. She drinks it. And then Jumps out the window. And falls to her death. \n\nThe Owner of the Bar then turns to the man in the coat and says, \"You know you're a real Prick when you're drunk, Superman.\" Read Less"
    },
    "45": {
        "category": "funny-blonde-jokes",
        "id": "7230",
        "punchline": "Blonde Customer at McDonald's: how many chicken nuggets come in a 6 piece? \nBlonde Cashier : I don't know let me check."
    },
    "46": {
        "category": "funny-blonde-jokes",
        "id": "25087",
        "punchline": "A Blonde's nursery rhyme:One two lets screw,Three four I'm a whore,Five six suck the dick,Seven eight ejaculate,Nine ten f*ck me again."
    },
    "47": {
        "category": "funny-blonde-jokes",
        "id": "21963",
        "punchline": "There was a blonde who wanted a promotion at work, but her employer denied her the oppurtunity because she was blonde, so she dyed her hair a light brown colour, thinking it would do the trick, she would try it at work but first she was going to try it on the general public. So one day, she was in ...Read Morethe countryside, and she pulled up by a farm, there was a farmer tending to some sheep, when she asked, \"if I can count how many sheep are in your field, could I have one.\" \"That is a deal, young lady,\" he replied. So she counted them up and finally counted them all.\"126\"\"Well young lady, a deal is a deal, take your pick\"She was walking back to the car when the farmer called. \"Young lady, if I guess what colour your hair really is, can I have my dog back??\" Read Less"
    },
    "48": {
        "category": "funny-blonde-jokes",
        "id": "2130",
        "punchline": "One day while a blonde was out driving her car, she ran into a truck. The truck driver made her pull over into a parking lot and get out of the car. He took a piece of chalk and drew a circle on the pavement. He told her to stand in the middle and not leave the circle. Furious, he went over to her ...Read Morecar and slashed the tires. The blonde started laughing. This made the man angrier so he smashed her windshield. This time the blonde laughed even harder. Livid, the man broke all her windows and keyed her car. The blonde is now laughing hysterically, so the truck driver asks her what’s so funny. The blonde giggled and replied, “When you weren’t looking, I stepped out of the circle three times! Read Less"
    },
    "49": {
        "category": "funny-blonde-jokes",
        "id": "5978",
        "punchline": "Blonde: \"What does IDK stand for?\"\nBrunette: \"I don’t know.\"\nBlonde: \"OMG, nobody does!\""
    },
    "50": {
        "category": "funny-blonde-jokes",
        "id": "26694",
        "punchline": "Anna and blonde are walking home from a night at the bar and have to pee, so they stop at a cemetery. With nothing to wipe with Anna uses her panties and the blonde uses a nearby wreath.The next day anna's boyfriend calls his friend, \"They are never going out again! Anna came home without panties!\"...Read MoreThe other replies, \"You think that's bad? My girlfriend came with a card in her crack that said, 'From all of us at the fire station, we will never forget you!'\" Read Less"
    },
    "51": {
        "category": "funny-blonde-jokes",
        "id": "14869",
        "punchline": "What do you do if a blonde throws a grenade at you? Pick it up, pull the pin and throw it back"
    },
    "52": {
        "category": "funny-blonde-jokes",
        "id": "2622",
        "punchline": "Im changing my name to 'Benefits' on Facebook.\nNext time someone adds me, It will say 'you are now friends with Benefits'"
    },
    "53": {
        "category": "funny-blonde-jokes",
        "id": "14989",
        "punchline": "How do you confuse a blonde? Put her in a circular room and tell her to sit in the corner."
    },
    "54": {
        "category": "funny-blonde-jokes",
        "id": "9933",
        "punchline": "How do you keep a Blonde busy? Give the Blonde a piece of paper that has the words 'Turn Over' on both sides!"
    },
    "55": {
        "category": "funny-blonde-jokes",
        "id": "32311",
        "punchline": "a blonde walked into a department store and said \"i would like to buy this tv\". the manager said \"sorry we don't sell to blondes\". the blonde was so mad, she went home and died her hair black. she went back to the department store and said \"i would like to buy this tv please\", the manager said \"...Read Moresorry we don't sell to blondes\". the blonde was furious. she went home and died her hair red but waited a couple of days to return. after a couple of days she returned to the department store and said \"i would like to buy this tv please\". the manager replied with \"we don't sell to blondes\". the blonde said how do you know I'm a blonde. the manager said \"because that's a microwave\" Read Less"
    },
    "56": {
        "category": "funny-blonde-jokes",
        "id": "10151",
        "punchline": "\"I'm so good at cooking, even the fire alarm is cheering me on.\" - Blonde"
    },
    "57": {
        "category": "funny-blonde-jokes",
        "id": "18280",
        "punchline": "a redhead, brunette, and a blonde escape from prison they run to a farm where they hide in a barn in sacks so the cops look for them they go to the barn and the cop kicks the sack with the redhead in and the redhead makes a cat noise so the cop says oh just a cat and then he kicks the second one ...Read Moreand the brunette makes a dog noise. the cop says just a dog and then he kicks the one with the blonde in and she says potatoes Read Less"
    },
    "58": {
        "category": "funny-blonde-jokes",
        "id": "7595",
        "punchline": "A blonde police officer stops a blonde driver,Officer: Can i see your drivers license?Driver: yeah i think i have one of those, what does it look like?Officer: It's rectangle is shape and has your face on it.Driver: Oh, okay, *pulls out mirror*, here you go.Officer: *looks at reflection*, I'm sorry ...Read Morema'am, i didn't know you were an officer of the law, you may carry on. Read Less"
    },
    "59": {
        "category": "funny-blonde-jokes",
        "id": "15450",
        "punchline": "What is the difference between a blonde and a mosquito?The mosquito stops sucking after you slap it."
    },
    "60": {
        "category": "funny-blonde-jokes",
        "id": "33003",
        "punchline": "A guy took his BLONDE girlfriend to her very first football game. They had great seats behind their teams bench! After the game, he asked how her first experience was. \"Oh I really liked it,\" she replied, especially the tight pants and all the big muscles, but I just couldn't understand why they ...Read Morewere killing each other over 25 cents!?!?\" Dumbfounded, her date asked, ''What do you mean by that?'' ''Well, they flipped a coin, one team got it and then for the rest of the game, all they kept screaming was, \"GET THE QUARTERBACK!\" I'm like, \"Hellooo it's only 25 cents!\" Read Less"
    },
    "61": {
        "category": "funny-blonde-jokes",
        "id": "2203",
        "punchline": "A blonde sits down in a bar next to a redhead. Both of them are having a good time when the news comes on the TV. The woman reporter shouts out 'This just in! A man Is at the edge of a cliff attempting to jump' The redhead leans over to the blonde and whispers, 'I bet you $50 that the man's gonna ...Read Morejump.' The blonde responds 'You're on.' \n\nSo, both of the women stare at the news waiting to find out what happens next. Finally, the man jumps. The blonde turns to the redhead and hands her the $50. The redhead, feeling guilty, says 'I can't take that money. I saw the news earlier this morning. I knew he was going to jump off the cliff.' The blonde says, 'Well, I saw too. But I never wouls have thought that he'd do it again.' Read Less"
    },
    "62": {
        "category": "funny-blonde-jokes",
        "id": "1557",
        "punchline": "How do you drown a submarine full of blondes? \nKnock on the door."
    },
    "63": {
        "category": "funny-blonde-jokes",
        "id": "1615",
        "punchline": "Blonde 1: Don't tell anyone but Bees scare me.\nBlonde 2: Dont worry, the whole alphabet scares me"
    },
    "64": {
        "category": "funny-blonde-jokes",
        "id": "19356",
        "punchline": " How do you know a Blonde has been using the computer?There is cheese in front of the mouse. "
    },
    "65": {
        "category": "funny-blonde-jokes",
        "id": "25828",
        "punchline": "A blonde had some goldfish and she did not know how to feed them. So she called her boyfriend Anant, and he showed her how to feed them. Once they were done feeding them, the blonde said, ''Now, what do I give them to drink?'"
    },
    "66": {
        "category": "funny-blonde-jokes",
        "id": "26181",
        "punchline": "Anant came home with tears in his eyes.\"What's wrong with you?\" Blonde wife asked Anant. \"Remember when your father caught us having sex when you were sixteen?\", he replied. \"And remember he said I had two choices; I could either marry you, or spend the next twenty years in prison.\" Baffled, Blonde ...Read Morewife said, \"Yes, I remember, so what?\" \"I would have been released today. Read Less"
    },
    "67": {
        "category": "funny-blonde-jokes",
        "id": "25525",
        "punchline": "Q: What's the difference between a blonde and a brick? \nA: When you lay a brick it doesn't follow you around for two weeks."
    },
    "68": {
        "category": "funny-blonde-jokes",
        "id": "14903",
        "punchline": "How do you keep a blonde busy for 7 hours?Give her m&ms and tell her to put them in alphabetical order"
    },
    "69": {
        "category": "funny-blonde-jokes",
        "id": "11171",
        "punchline": "A brunette goes to the doctor, and says, \"Doctor I'm hurting all over my body.\" \"That's odd\", replied the doctor, \"Show me what you mean\" So the girl takes her finger and pokes her elbow, and screams in pain. She touches her knee and cries in agony and so on. The doctor says, \"You're not a natural ...Read Morebrunette are you?\" \"No I'm a blonde\", she replies. \"I thought so.... your finger is broken.\", replies the doctor. Read Less"
    },
    "70": {
        "category": "funny-blonde-jokes",
        "id": "26476",
        "punchline": "Anant: I can't marry you. My family members don't agree.Blonde: Who's there in you family, who is opposing ?Anant: My wife and 2 kids."
    },
    "71": {
        "category": "funny-blonde-jokes",
        "id": "4866",
        "punchline": "What's a difference between a blond and a mosquito? once you smack a mosquito it stops sucking"
    },
    "72": {
        "category": "funny-blonde-jokes",
        "id": "6121",
        "punchline": "A woman and a man are involved in a car accident; it's a bad one. Both of their cars are totally demolished but amazingly neither of them are hurt. After they crawl out of their cars, the woman says, \"So you're a man, that's interesting. I'm a woman. Wow, just look at our cars! There's nothing left,...Read More but fortunately we are unhurt. This must be a sign from God that we should meet and be friends and live together in peace for the rest of our days.\" Flattered, the man replied, \"Oh yes, I agree with you completely!\" \"This must be a sign from God!\" The woman continued, \"And look at this, here's another miracle. My car is completely demolished but this bottle of wine didn't break. Surely God wants us to drink this wine and celebrate our good fortune.\" Then she hands the bottle to the man, The man nods his head in agreement, opens it and drinks half the bottle and then hands it back to the woman. The woman takes the bottle, immediately puts the cap back on, and hands it back to the man. The man asks, \"Aren't you having any?\" The woman replies, \"No. I think I'll just wait for the police...\" Read Less"
    },
    "73": {
        "category": "funny-blonde-jokes",
        "id": "37324",
        "punchline": "A blonde, a brunette, and a redhead are all running from the cops. They run to an old barn and hide in potato sacks. The cop chasing them walks into the barn looking for them. He kicks the first sack, with the redhead inside, and the redhead says \"Arf arf!\" The cop thinks it's a dog, so walks to ...Read Morethe next one. He kicks the second bag, with the brunette, and she says \"Meow, meow.\" The cop thinks it's a cat, and moves on. He kicks the third bag, with the blonde, and the blonde yells \"Potato, potato!\" Read Less"
    },
    "74": {
        "category": "funny-blonde-jokes",
        "id": "1513",
        "punchline": "A blonde, brunette, and a redhead are stranded in the desert. A genie appears and gives each of them one wish. The redhead says \" I wish I could fly\" and flys away. The brunette says \"I wish I was home\" and teleports home. The blonde steps up, sighs, and says \" I wish my friends were back.\n"
    },
    "75": {
        "category": "funny-blonde-jokes",
        "id": "24320",
        "punchline": "This blonde decides one day that she is sick and tired of all these blonde jokes and how all blondes are perceived as stupid, so she decides to show her husband that blondes really are smart. While her husband is off at work, she decides that she is going to paint a couple of rooms in the house. ...Read MoreThe next day, right after her husband leaves for work, she getsdown to the task at hand. Her husband arrives home at 5:30 and smells the distinctive smell of paint. He walks into the living room and finds his wife lying on the floor in a pool of sweat. He notices that she is wearing a ski jacket and a fur coat at the same time. He goes over and asks her if she is OK. She replies yes. He asks what she is doing. She replies that she wanted to prove to him that not all blonde women are dumb and she wanted to do it bypainting the house. He then asks her why she has a ski jacket over her fur coat. She replies that she was reading the directions on the paint can and they said.... FOR BEST RESULTS, PUT ON TWO COATShihihi Read Less"
    },
    "76": {
        "category": "funny-blonde-jokes",
        "id": "25076",
        "punchline": "2 blonde were on their way home after work, in a taxi.1st: I smell sperm!2nd: Sorry, I burped!"
    },
    "77": {
        "category": "funny-blonde-jokes",
        "id": "9487",
        "punchline": "A robber comes into the store & steals a TV. A blonde runs after him and says, \"Wait, you forgot the remote!\" "
    },
    "78": {
        "category": "funny-blonde-jokes",
        "id": "8584",
        "punchline": "Why did the blonde tip-toe past the medicine cabinet?'Cause she didn't want to wake the sleeping pills."
    },
    "79": {
        "category": "funny-blonde-jokes",
        "id": "22382",
        "punchline": "Q: Why can't a blonde dial 911?A: She can't find the eleven."
    },
    "80": {
        "category": "funny-blonde-jokes",
        "id": "1656",
        "punchline": "A blonde pick ups her dress from the dry cleaners, when she leaves the Cashier says, \"Come again!\"\nBonde said, \"Nah..It was ketchup this time.\""
    },
    "81": {
        "category": "funny-blonde-jokes",
        "id": "3654",
        "punchline": "A blonde gets on an airplane and sits down in the first class section of the plane. The stewardess rushes over to her and tells her she must move to coach because she doesn't have a first class ticket. The blonde replies, \"I'm blonde, I'm smart, I have a good job, and I'm staying in first class ...Read Moreuntil we reach South Jamaica.\"\n\nThe disgusted stewardess gets the head stewardess who asks the blonde to leave. The blonde yet again repeats \"I'm blonde, I'm smart, I have a good job and I'm staying in first class until we reach South Jamaica.\" The head stewardesses doesn't even know what to do at this point because they still have to get the rest of the passengers seated to take off; the blonde is causing a problem with boarding now, so the stewardess gets the copilot.\n\nThe copilot goes up to the blonde and whispers in her ear. She immediately gets up and goes to her seat in the coach section. The head stewardess asks the copilot in amazement what he said to get her to move to her correct seat. The copilot replies, \"I told her the front half of the airplane wasn't going to South Jamaica.\" Read Less"
    },
    "82": {
        "category": "funny-blonde-jokes",
        "id": "10239",
        "punchline": "A redhead tells her blonde stepsister, \"I slept with a Brazilian....\" The blonde replies, \"Oh my God! You slut! How many is a brazilian?\""
    },
    "83": {
        "category": "funny-blonde-jokes",
        "id": "25827",
        "punchline": "Blonde and Anant are walking around a zoo, when Anant says, ''Look at that lion with one eye!'' The other blonde covers one of her eyes and says, ''Where?'' "
    },
    "84": {
        "category": "funny-blonde-jokes",
        "id": "2202",
        "punchline": "A girl came skipping home from school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6,7, 8, 9, 10!\"\n\"Very good,\" said her mother.\n\"Is it because I'm blonde, Mommy?\"\n\"Yes, it's because you're ...Read Moreblonde,\" her mother replied. \n\nThe next day, the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A, B, C, D, E, F, G!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, pumpkin, it's because you're blonde.\" \n\nThe next day the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" And she lifted her tank top to reveal a pair of 36Cs. \"Very good,\" said her embarrassed mother. \"Is it because I'm blonde, mommy?\" \"No, it's because you're 25.\" Read Less"
    },
    "85": {
        "category": "funny-blonde-jokes",
        "id": "19443",
        "punchline": "What's the difference between a UFO and a smart blonde? There's been sightings of a UFO."
    },
    "86": {
        "category": "funny-blonde-jokes",
        "id": "38848",
        "punchline": "There are three girls. A redhead, a brunette and a blonde. They're at the gates of heaven and God was waiting. God said,\"there are one hundred steps and for each step there will be a joke if you laugh at it you go to hell.\"The redhead went first and got to joke eight before she busted up laughing ...Read Moreshe went to hell. The brunette went next and got to joke eighty-two before she busted up laughing so, she went to hell. The blonde got to joke one hundred and started laughing before God told the final joke and said,\"why are you laughing I haven't even told the joke yet?\" The blonde said,\" I just got joke 1.\" Read Less"
    },
    "87": {
        "category": "funny-blonde-jokes",
        "id": "9489",
        "punchline": "What did the blonde say when she saw the Cheerios box? \"Omg, donut seeds!\""
    },
    "88": {
        "category": "funny-blonde-jokes",
        "id": "6642",
        "punchline": "Why can't a blonde dial 911 .....She can't find the 11"
    },
    "89": {
        "category": "funny-blonde-jokes",
        "id": "31313",
        "punchline": "Blonde: I have a simple solution to all of this.Me: Simple solution?(sarcasticly) Do you remember when we got the keys locked in the car and it took 6 hours to get them out?Blonde: Yeah.Me: YOU WERE IN THE FUCKING CAR!!!!"
    },
    "90": {
        "category": "funny-blonde-jokes",
        "id": "3491",
        "punchline": "A bartender is sitting behind the bar on a typical day, when the door bursts open and in come four exuberant blondes. They come up to the bar, order five bottles of champagne and ten glasses, take their order over and sit down at a large table. The corks are popped, the glasses are filled and they ...Read Morebegin toasting and chanting, \"51 days, 51 days, 51 days!\"\n      Soon, three more blondes arrive, take up their drinks and the chanting grows... \"51 days, 51 days, 51 days!\" Two more blondes show up and soon their voices are joined in \"51 days, 51 days, 51 days!\"\n      Finally, the tenth blonde comes in with a picture under her arm. She walks over to the table, sets the picture in the middle and the table erupts. Up jump the others, they begin dancing around the table, exchanging high-fives, all the while chanting \"51 days, 51 days, 51 days!\"\n      The bartender can't contain his curiosity any longer, so he walks over to the table. There in the center is a beautifully framed child's puzzle of the Cookie Monster.\n      When the frenzy dies down a little bit, the bartender asks one of the blondes, \"What's all the chanting and celebration about?\" The blonde who brought in the picture pipes in, \"Everyone thinks that blondes are dumb and they make fun of us. So, we decided to set the record straight.\n      \"Ten of us got together, bought that puzzle and put it together....the side of the box said 2-4 years, but we put it together in 51 days!\" Read Less"
    },
    "91": {
        "category": "funny-blonde-jokes",
        "id": "39753",
        "punchline": "What do you call a smart blonde?A Golden Retriever "
    },
    "92": {
        "category": "funny-blonde-jokes",
        "id": "1398",
        "punchline": "A mom has three daughters.\nBrunette: Mom why did you name me Rose?\nMom: Because when you were born a rose landed on your head.\nGinger: Mom why is my name Petal? \nMom: Because when you were born a petal landed on your head. \nBlonde: My favorite color is potato! \nMom: Shut up Brick... "
    },
    "93": {
        "category": "funny-blonde-jokes",
        "id": "14227",
        "punchline": "Q: What do you call a skeleton in the closet with blonde hair? A: Last year's hide-and-go-seek winner. "
    },
    "94": {
        "category": "funny-blonde-jokes",
        "id": "2692",
        "punchline": "\"Out in the sea a ship sank. The only survivors were a brunette, a red head and a blonde. The only choice they had was to swim 100 metres back to shore. The brunette left first and swam 70 metres but she drowned. The red head left second and swam 80 metres but she drowned. The blonde was last and ...Read Moreshe swam 50 metres but she got tired and swam back.\" Read Less"
    },
    "95": {
        "category": "funny-blonde-jokes",
        "id": "26239",
        "punchline": "Two blondes are walking through a museum and got separated. When they ran into each other later the first blonde said to the second, \"Oh my! Did you see that statue of the naked man back there?\" The second replied, \"Yes! I was absolutely shocked! How can they display such a thing! My gosh the penis ...Read Moreon it was so large!\" Where upon the first accidentally blurted out, \"...Yeah, and cold, too!\"......ab!!!!! Read Less"
    },
    "96": {
        "category": "funny-blonde-jokes",
        "id": "34857",
        "punchline": "A plane is about to crash and on it there is a Blonde, Micheal Jackson, a school-boy and the pilot. There are only 3 parachutes. MJ takes one a screams i'm too famous to die, and jumps. then goes the blonde who says she's too pretty to die, and then the pilot says, \"its ok, you can live you life\" ...Read Moreto the school-boy, but then the kid says \"it's ok, the blonde took my school-bag\" Read Less"
    },
    "97": {
        "category": "funny-blonde-jokes",
        "id": "25204",
        "punchline": "Blonde calls her friend\"Come darling. I am alone. No one is at my home\"Boy : what happened dear. We had sex just now twice 30 minutes back.Blonde : Ohh , I called you again by mistake. "
    },
    "98": {
        "category": "funny-blonde-jokes",
        "id": "14296",
        "punchline": "A redhead says to her blonde stepsister, I slept with a Brazilian.The blonde replies,Oh my God!You slut! How many is a Brazilian?"
    },
    "99": {
        "category": "funny-blonde-jokes",
        "id": "8949",
        "punchline": "How do you kill a blonde? Put a scratch n'snif sticker at the bottom of a swimming pool."
    },
    "100": {
        "category": "funny-blonde-jokes",
        "id": "1987",
        "punchline": "Chuck Norris is so tough, he roundhouse kicked this into another section."
    },
    "101": {
        "category": "funny-blonde-jokes",
        "id": "3654",
        "punchline": "A blonde gets on an airplane and sits down in the first class section of the plane. The stewardess rushes over to her and tells her she must move to coach because she doesn't have a first class ticket. The blonde replies, \"I'm blonde, I'm smart, I have a good job, and I'm staying in first class ...Read Moreuntil we reach South Jamaica.\"\n\nThe disgusted stewardess gets the head stewardess who asks the blonde to leave. The blonde yet again repeats \"I'm blonde, I'm smart, I have a good job and I'm staying in first class until we reach South Jamaica.\" The head stewardesses doesn't even know what to do at this point because they still have to get the rest of the passengers seated to take off; the blonde is causing a problem with boarding now, so the stewardess gets the copilot.\n\nThe copilot goes up to the blonde and whispers in her ear. She immediately gets up and goes to her seat in the coach section. The head stewardess asks the copilot in amazement what he said to get her to move to her correct seat. The copilot replies, \"I told her the front half of the airplane wasn't going to South Jamaica.\" Read Less"
    },
    "102": {
        "category": "funny-blonde-jokes",
        "id": "10239",
        "punchline": "A redhead tells her blonde stepsister, \"I slept with a Brazilian....\" The blonde replies, \"Oh my God! You slut! How many is a brazilian?\""
    },
    "103": {
        "category": "funny-blonde-jokes",
        "id": "25827",
        "punchline": "Blonde and Anant are walking around a zoo, when Anant says, ''Look at that lion with one eye!'' The other blonde covers one of her eyes and says, ''Where?'' "
    },
    "104": {
        "category": "funny-blonde-jokes",
        "id": "2202",
        "punchline": "A girl came skipping home from school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6,7, 8, 9, 10!\"\n\"Very good,\" said her mother.\n\"Is it because I'm blonde, Mommy?\"\n\"Yes, it's because you're ...Read Moreblonde,\" her mother replied. \n\nThe next day, the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A, B, C, D, E, F, G!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, pumpkin, it's because you're blonde.\" \n\nThe next day the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" And she lifted her tank top to reveal a pair of 36Cs. \"Very good,\" said her embarrassed mother. \"Is it because I'm blonde, mommy?\" \"No, it's because you're 25.\" Read Less"
    },
    "105": {
        "category": "funny-blonde-jokes",
        "id": "19443",
        "punchline": "What's the difference between a UFO and a smart blonde? There's been sightings of a UFO."
    },
    "106": {
        "category": "funny-blonde-jokes",
        "id": "38848",
        "punchline": "There are three girls. A redhead, a brunette and a blonde. They're at the gates of heaven and God was waiting. God said,\"there are one hundred steps and for each step there will be a joke if you laugh at it you go to hell.\"The redhead went first and got to joke eight before she busted up laughing ...Read Moreshe went to hell. The brunette went next and got to joke eighty-two before she busted up laughing so, she went to hell. The blonde got to joke one hundred and started laughing before God told the final joke and said,\"why are you laughing I haven't even told the joke yet?\" The blonde said,\" I just got joke 1.\" Read Less"
    },
    "107": {
        "category": "funny-blonde-jokes",
        "id": "9489",
        "punchline": "What did the blonde say when she saw the Cheerios box? \"Omg, donut seeds!\""
    },
    "108": {
        "category": "funny-blonde-jokes",
        "id": "6642",
        "punchline": "Why can't a blonde dial 911 .....She can't find the 11"
    },
    "109": {
        "category": "funny-blonde-jokes",
        "id": "31313",
        "punchline": "Blonde: I have a simple solution to all of this.Me: Simple solution?(sarcasticly) Do you remember when we got the keys locked in the car and it took 6 hours to get them out?Blonde: Yeah.Me: YOU WERE IN THE FUCKING CAR!!!!"
    },
    "110": {
        "category": "funny-blonde-jokes",
        "id": "3491",
        "punchline": "A bartender is sitting behind the bar on a typical day, when the door bursts open and in come four exuberant blondes. They come up to the bar, order five bottles of champagne and ten glasses, take their order over and sit down at a large table. The corks are popped, the glasses are filled and they ...Read Morebegin toasting and chanting, \"51 days, 51 days, 51 days!\"\n      Soon, three more blondes arrive, take up their drinks and the chanting grows... \"51 days, 51 days, 51 days!\" Two more blondes show up and soon their voices are joined in \"51 days, 51 days, 51 days!\"\n      Finally, the tenth blonde comes in with a picture under her arm. She walks over to the table, sets the picture in the middle and the table erupts. Up jump the others, they begin dancing around the table, exchanging high-fives, all the while chanting \"51 days, 51 days, 51 days!\"\n      The bartender can't contain his curiosity any longer, so he walks over to the table. There in the center is a beautifully framed child's puzzle of the Cookie Monster.\n      When the frenzy dies down a little bit, the bartender asks one of the blondes, \"What's all the chanting and celebration about?\" The blonde who brought in the picture pipes in, \"Everyone thinks that blondes are dumb and they make fun of us. So, we decided to set the record straight.\n      \"Ten of us got together, bought that puzzle and put it together....the side of the box said 2-4 years, but we put it together in 51 days!\" Read Less"
    },
    "111": {
        "category": "funny-blonde-jokes",
        "id": "39753",
        "punchline": "What do you call a smart blonde?A Golden Retriever "
    },
    "112": {
        "category": "funny-blonde-jokes",
        "id": "1398",
        "punchline": "A mom has three daughters.\nBrunette: Mom why did you name me Rose?\nMom: Because when you were born a rose landed on your head.\nGinger: Mom why is my name Petal? \nMom: Because when you were born a petal landed on your head. \nBlonde: My favorite color is potato! \nMom: Shut up Brick... "
    },
    "113": {
        "category": "funny-blonde-jokes",
        "id": "14227",
        "punchline": "Q: What do you call a skeleton in the closet with blonde hair? A: Last year's hide-and-go-seek winner. "
    },
    "114": {
        "category": "funny-blonde-jokes",
        "id": "2692",
        "punchline": "\"Out in the sea a ship sank. The only survivors were a brunette, a red head and a blonde. The only choice they had was to swim 100 metres back to shore. The brunette left first and swam 70 metres but she drowned. The red head left second and swam 80 metres but she drowned. The blonde was last and ...Read Moreshe swam 50 metres but she got tired and swam back.\" Read Less"
    },
    "115": {
        "category": "funny-blonde-jokes",
        "id": "26239",
        "punchline": "Two blondes are walking through a museum and got separated. When they ran into each other later the first blonde said to the second, \"Oh my! Did you see that statue of the naked man back there?\" The second replied, \"Yes! I was absolutely shocked! How can they display such a thing! My gosh the penis ...Read Moreon it was so large!\" Where upon the first accidentally blurted out, \"...Yeah, and cold, too!\"......ab!!!!! Read Less"
    },
    "116": {
        "category": "funny-blonde-jokes",
        "id": "34857",
        "punchline": "A plane is about to crash and on it there is a Blonde, Micheal Jackson, a school-boy and the pilot. There are only 3 parachutes. MJ takes one a screams i'm too famous to die, and jumps. then goes the blonde who says she's too pretty to die, and then the pilot says, \"its ok, you can live you life\" ...Read Moreto the school-boy, but then the kid says \"it's ok, the blonde took my school-bag\" Read Less"
    },
    "117": {
        "category": "funny-blonde-jokes",
        "id": "25204",
        "punchline": "Blonde calls her friend\"Come darling. I am alone. No one is at my home\"Boy : what happened dear. We had sex just now twice 30 minutes back.Blonde : Ohh , I called you again by mistake. "
    },
    "118": {
        "category": "funny-blonde-jokes",
        "id": "14296",
        "punchline": "A redhead says to her blonde stepsister, I slept with a Brazilian.The blonde replies,Oh my God!You slut! How many is a Brazilian?"
    },
    "119": {
        "category": "funny-blonde-jokes",
        "id": "8949",
        "punchline": "How do you kill a blonde? Put a scratch n'snif sticker at the bottom of a swimming pool."
    },
    "120": {
        "category": "funny-blonde-jokes",
        "id": "1987",
        "punchline": "Chuck Norris is so tough, he roundhouse kicked this into another section."
    },
    "121": {
        "category": "funny-blonde-jokes",
        "id": "28262",
        "punchline": "Three women are about to be executed. Ones a brunet, ones a redhead, and ones a blond. The guard brings the brunet forward and the executioner asks if she has any last requests. She says no and the executioner shouts ''ready aim'' suddenly the brunet shout's ''Earthquake''. Everyone gets on the ...Read Moreground and the brunet escapes. Then the guard brings the redhead forward and the executioner ask if she has any last request. She says no and the executioner shouts '' ready aim'' suddenly the redhead yells '' tornado'' everyone is startled and looks around for a cover while she escapes. By now the blond has it fingered out. The guard brings her forward and the executioner ask if she has any last request. She says no and the executioner shouts ''ready aim'' and the blond yells ''FIRE.'' Read Less"
    },
    "122": {
        "category": "funny-blonde-jokes",
        "id": "7904",
        "punchline": "a guy is outside watching the day view until a blonde comes out of her house and checks her mail box she opens it and then she closes it. a few seconds later she comes out again and checks it again but angry and the she slams it shut .seconds later she comes out angryer than ever then the man walks ...Read Moreup to her and said whats wrong she answers my stupid computer keeps saying that i have mail. Read Less"
    },
    "123": {
        "category": "funny-blonde-jokes",
        "id": "11638",
        "punchline": "What do you do when a blonde throws a pin at you?Run like hell, she's got a grenade in her mouth."
    },
    "124": {
        "category": "funny-blonde-jokes",
        "id": "11662",
        "punchline": "One day a blonde stopped at a stop sign then a cop came down and said mam you have been sitting her for four hours what are you doing the blonde said waiting for the stop sign to say go."
    },
    "125": {
        "category": "funny-blonde-jokes",
        "id": "36919",
        "punchline": "A guy was driving in a car with a blonde. He told her to stick her head out the window and see if the blinker worked. She stuck her head out and said, \"Yes, No, Yes, No, Yes...\""
    },
    "126": {
        "category": "funny-blonde-jokes",
        "id": "5108",
        "punchline": "There was a blonde who tried to hang herself and a  diffrent blonde came in and saw her hanging from her stomach and said,\" your supposed to hang yourself from your neck. And she said,\"  i tried that but i couldnt breath."
    },
    "127": {
        "category": "funny-blonde-jokes",
        "id": "476",
        "punchline": "There was a blonde who found herself sitting next to a lawyer on a airplane. The lawyer just kept bugging the blonde wanting her to play a game of intelligence. Finally, the lawyer offered her 10-1 odds, & said everytime the blonde could not answer his questions she owed him $5, but everytime ...Read Morehe could not answer hers he'd give her $50. The lawyer figured he could not lose & the blonde reluctantly accepted. The lawyer first asked, \"What is the distance between the earth & the nearest star?\" Without saying a word,the blonde handed him $5. Then the blonde asked, \"What goes up a hill with 3 legs & comes down with 4 legs?\" Well, the lawyer looked puzzled. He took several hours, even looking up everything he could on his laptop & even placing air-to-ground phone calls trying to find the an answer. Finally, angry & frustrated, he gave up & paid the blonde $50. The blonde put the $50 in her purse without comment, but the lawyer insisted, \"So, what was the answer?\" Without saying a word, the blonde handed him $5. Read Less"
    },
    "128": {
        "category": "funny-blonde-jokes",
        "id": "32200",
        "punchline": "Blonde: hey i got a a compliment on my driving today.Friend:how???Blonde:when i got outside i had a piece of paper on my car that said \"parking fine\"Friend: Fucking blondes."
    },
    "129": {
        "category": "funny-blonde-jokes",
        "id": "10944",
        "punchline": "Why did the blonde return the puzzle?It was broken."
    },
    "130": {
        "category": "funny-blonde-jokes",
        "id": "25078",
        "punchline": "What do Blondes do immediately after sex?5% sleep straight away5% go to bathroom to wash5% read a book85% go look for their vibrators!!"
    },
    "131": {
        "category": "funny-blonde-jokes",
        "id": "34321",
        "punchline": "Blonde: \"What does IDK stand for?\"Brunette: \"I don’t know.\"Blonde: \"OMG, nobody does!\""
    },
    "132": {
        "category": "funny-blonde-jokes",
        "id": "26320",
        "punchline": "Redneck and Anna were in bed getting busy when the anna places the his hand onto her pussy. \"Put your finger in me...\" she asks him. So he does without hesitation, as she starts moaning. \"Put two fingers in...\", she says. So in goes another one. She's really starting to get worked up when she says,\"...Read MorePut your whole hand in!\". The guy's like, \"Ok!\". So he has his entire hand in, when she says moaning aloud \"Put both your hands inside of me!\". So the guy puts both of his hands in! \"Now clap your hands...\" commands the girl. \"I can't\", says the guy. The girl looks at him and says \"See, I told you I had a tight p*ssy!\". Read Less"
    },
    "133": {
        "category": "funny-blonde-jokes",
        "id": "26831",
        "punchline": "A blonde buys a puzzle and takes it home.After an hour she has none of it together, so she gets frustrated and calls her boyfriend AnantShe says \" I just bought this puzzle, but i can't find any of the edges and none of the pieces fit together\".He asks her what is the picture supposed to be.She ...Read Moresays \" a rooster\".He says \" I'll be over in a minute to help you\".When Anant gets there he says \"damn honey! put all those cornflakes back in the box! Read Less"
    },
    "134": {
        "category": "funny-blonde-jokes",
        "id": "25909",
        "punchline": "Anant got on a plane and sat next to a blonde, after sitting for awhile she sneezed, took out a tissue and whipped her box. Anant not knowing her said nothing and went about his business.After about 3 or 4 minutes she sneezed again and , the same thing, whipped her box! Finally,Anant got the nerve ...Read Moreand asked \" what was wrong?\" She said that ever time she sneezes she has an orgasm! Oh! Anant said, are you taking anything for it?Yes,she said ---- black pepper!!! Read Less"
    },
    "135": {
        "category": "funny-blonde-jokes",
        "id": "2204",
        "punchline": "A blonde is driving a helicopter and it crashes. When the police come and ask the blond what happened she says, \"I got cold so i turned off the big fan!\""
    },
    "136": {
        "category": "funny-blonde-jokes",
        "id": "27179",
        "punchline": "Anna 2 Mom: Mom I have started loving a Boy!Mom angry: What?? How old is he? What does he do?Anna: He is 3 months old. Happily kicking in my stomach."
    },
    "137": {
        "category": "funny-blonde-jokes",
        "id": "30085",
        "punchline": "A blonde was very cold, so she sat next to the candle.She was still cold, but she was so cold that she couldn't move!She screamed until her boyfriend came.Then her boyfriend lit the candle."
    },
    "138": {
        "category": "funny-blonde-jokes",
        "id": "38650",
        "punchline": "Blonde girl runs into the pub hysterically shouting \"help theres a black man chasing me\"A bunch of lads get together looking when the girl again shouts \"quick hes there creeping on the floor\" After looking dismayed one calmly informs her\"thats your shadow love\" "
    },
    "139": {
        "category": "funny-blonde-jokes",
        "id": "1559",
        "punchline": "Slut - \"I hate you bitch\"\nBlonde - \"Your such a slut, I bet your naked under those clothes.\""
    },
    "140": {
        "category": "funny-blonde-jokes",
        "id": "42614",
        "punchline": "There's a magical mirror in a a bar that eats those who lie to it.A blonde and a brunette and a red head walk into a bar and discover the mirror.The brunette looks at it and says \"wow I think I'm this dress looks good on me.\"So it eats her.The red head says \"I think I'm the prettiest girl in the ...Read Moreworld\"So it eats her.The blonde looks at the mirror and says \"I think -\". *It eats her* Read Less"
    },
    "141": {
        "category": "funny-blonde-jokes",
        "id": "28262",
        "punchline": "Three women are about to be executed. Ones a brunet, ones a redhead, and ones a blond. The guard brings the brunet forward and the executioner asks if she has any last requests. She says no and the executioner shouts ''ready aim'' suddenly the brunet shout's ''Earthquake''. Everyone gets on the ...Read Moreground and the brunet escapes. Then the guard brings the redhead forward and the executioner ask if she has any last request. She says no and the executioner shouts '' ready aim'' suddenly the redhead yells '' tornado'' everyone is startled and looks around for a cover while she escapes. By now the blond has it fingered out. The guard brings her forward and the executioner ask if she has any last request. She says no and the executioner shouts ''ready aim'' and the blond yells ''FIRE.'' Read Less"
    },
    "142": {
        "category": "funny-blonde-jokes",
        "id": "7904",
        "punchline": "a guy is outside watching the day view until a blonde comes out of her house and checks her mail box she opens it and then she closes it. a few seconds later she comes out again and checks it again but angry and the she slams it shut .seconds later she comes out angryer than ever then the man walks ...Read Moreup to her and said whats wrong she answers my stupid computer keeps saying that i have mail. Read Less"
    },
    "143": {
        "category": "funny-blonde-jokes",
        "id": "11638",
        "punchline": "What do you do when a blonde throws a pin at you?Run like hell, she's got a grenade in her mouth."
    },
    "144": {
        "category": "funny-blonde-jokes",
        "id": "11662",
        "punchline": "One day a blonde stopped at a stop sign then a cop came down and said mam you have been sitting her for four hours what are you doing the blonde said waiting for the stop sign to say go."
    },
    "145": {
        "category": "funny-blonde-jokes",
        "id": "36919",
        "punchline": "A guy was driving in a car with a blonde. He told her to stick her head out the window and see if the blinker worked. She stuck her head out and said, \"Yes, No, Yes, No, Yes...\""
    },
    "146": {
        "category": "funny-blonde-jokes",
        "id": "5108",
        "punchline": "There was a blonde who tried to hang herself and a  diffrent blonde came in and saw her hanging from her stomach and said,\" your supposed to hang yourself from your neck. And she said,\"  i tried that but i couldnt breath."
    },
    "147": {
        "category": "funny-blonde-jokes",
        "id": "476",
        "punchline": "There was a blonde who found herself sitting next to a lawyer on a airplane. The lawyer just kept bugging the blonde wanting her to play a game of intelligence. Finally, the lawyer offered her 10-1 odds, & said everytime the blonde could not answer his questions she owed him $5, but everytime ...Read Morehe could not answer hers he'd give her $50. The lawyer figured he could not lose & the blonde reluctantly accepted. The lawyer first asked, \"What is the distance between the earth & the nearest star?\" Without saying a word,the blonde handed him $5. Then the blonde asked, \"What goes up a hill with 3 legs & comes down with 4 legs?\" Well, the lawyer looked puzzled. He took several hours, even looking up everything he could on his laptop & even placing air-to-ground phone calls trying to find the an answer. Finally, angry & frustrated, he gave up & paid the blonde $50. The blonde put the $50 in her purse without comment, but the lawyer insisted, \"So, what was the answer?\" Without saying a word, the blonde handed him $5. Read Less"
    },
    "148": {
        "category": "funny-blonde-jokes",
        "id": "32200",
        "punchline": "Blonde: hey i got a a compliment on my driving today.Friend:how???Blonde:when i got outside i had a piece of paper on my car that said \"parking fine\"Friend: Fucking blondes."
    },
    "149": {
        "category": "funny-blonde-jokes",
        "id": "10944",
        "punchline": "Why did the blonde return the puzzle?It was broken."
    },
    "150": {
        "category": "funny-blonde-jokes",
        "id": "25078",
        "punchline": "What do Blondes do immediately after sex?5% sleep straight away5% go to bathroom to wash5% read a book85% go look for their vibrators!!"
    },
    "151": {
        "category": "funny-blonde-jokes",
        "id": "34321",
        "punchline": "Blonde: \"What does IDK stand for?\"Brunette: \"I don’t know.\"Blonde: \"OMG, nobody does!\""
    },
    "152": {
        "category": "funny-blonde-jokes",
        "id": "26320",
        "punchline": "Redneck and Anna were in bed getting busy when the anna places the his hand onto her pussy. \"Put your finger in me...\" she asks him. So he does without hesitation, as she starts moaning. \"Put two fingers in...\", she says. So in goes another one. She's really starting to get worked up when she says,\"...Read MorePut your whole hand in!\". The guy's like, \"Ok!\". So he has his entire hand in, when she says moaning aloud \"Put both your hands inside of me!\". So the guy puts both of his hands in! \"Now clap your hands...\" commands the girl. \"I can't\", says the guy. The girl looks at him and says \"See, I told you I had a tight p*ssy!\". Read Less"
    },
    "153": {
        "category": "funny-blonde-jokes",
        "id": "26831",
        "punchline": "A blonde buys a puzzle and takes it home.After an hour she has none of it together, so she gets frustrated and calls her boyfriend AnantShe says \" I just bought this puzzle, but i can't find any of the edges and none of the pieces fit together\".He asks her what is the picture supposed to be.She ...Read Moresays \" a rooster\".He says \" I'll be over in a minute to help you\".When Anant gets there he says \"damn honey! put all those cornflakes back in the box! Read Less"
    },
    "154": {
        "category": "funny-blonde-jokes",
        "id": "25909",
        "punchline": "Anant got on a plane and sat next to a blonde, after sitting for awhile she sneezed, took out a tissue and whipped her box. Anant not knowing her said nothing and went about his business.After about 3 or 4 minutes she sneezed again and , the same thing, whipped her box! Finally,Anant got the nerve ...Read Moreand asked \" what was wrong?\" She said that ever time she sneezes she has an orgasm! Oh! Anant said, are you taking anything for it?Yes,she said ---- black pepper!!! Read Less"
    },
    "155": {
        "category": "funny-blonde-jokes",
        "id": "2204",
        "punchline": "A blonde is driving a helicopter and it crashes. When the police come and ask the blond what happened she says, \"I got cold so i turned off the big fan!\""
    },
    "156": {
        "category": "funny-blonde-jokes",
        "id": "27179",
        "punchline": "Anna 2 Mom: Mom I have started loving a Boy!Mom angry: What?? How old is he? What does he do?Anna: He is 3 months old. Happily kicking in my stomach."
    },
    "157": {
        "category": "funny-blonde-jokes",
        "id": "30085",
        "punchline": "A blonde was very cold, so she sat next to the candle.She was still cold, but she was so cold that she couldn't move!She screamed until her boyfriend came.Then her boyfriend lit the candle."
    },
    "158": {
        "category": "funny-blonde-jokes",
        "id": "38650",
        "punchline": "Blonde girl runs into the pub hysterically shouting \"help theres a black man chasing me\"A bunch of lads get together looking when the girl again shouts \"quick hes there creeping on the floor\" After looking dismayed one calmly informs her\"thats your shadow love\" "
    },
    "159": {
        "category": "funny-blonde-jokes",
        "id": "1559",
        "punchline": "Slut - \"I hate you bitch\"\nBlonde - \"Your such a slut, I bet your naked under those clothes.\""
    },
    "160": {
        "category": "funny-blonde-jokes",
        "id": "42614",
        "punchline": "There's a magical mirror in a a bar that eats those who lie to it.A blonde and a brunette and a red head walk into a bar and discover the mirror.The brunette looks at it and says \"wow I think I'm this dress looks good on me.\"So it eats her.The red head says \"I think I'm the prettiest girl in the ...Read Moreworld\"So it eats her.The blonde looks at the mirror and says \"I think -\". *It eats her* Read Less"
    },
    "161": {
        "category": "funny-blonde-jokes",
        "id": "26056",
        "punchline": "Anant and blonde were having sex. In middle of heat, Anant blows in her ear.\nBlonde says \"Ooooh that's nice. Thanks for the refill!\""
    },
    "162": {
        "category": "funny-blonde-jokes",
        "id": "33993",
        "punchline": "A brunette was walking down some train tracks saying \"21, 21, 21...\" repeatedly. A blonde saw her and began to follow along. After a moment the blonde asked, \"whatchya doin?\" The brunette said \"counting\" and went back to chanting 21. The blonde asked if she could join the brunette and the brunette ...Read Moresaid \"sure, hop up onto the tracks.\"Both girls walked down the track saying 21 over and over. Eventually a train started coming down the tracks, horn blaring. When the rails started to rumble the brunette jumped down and walked away to a safe distance. A few seconds later the train hit the blonde, throwing her far out into the field dead.After the train passed the brunette hopped back onto the tracks and resumed walking. Now, however, she chanted \"22, 22, 22...\" Read Less"
    },
    "163": {
        "category": "funny-blonde-jokes",
        "id": "25533",
        "punchline": "A blonde walks into a doctors office with a gunshot wound in her hand. The doctor asks, \"How did this happen?\" She replies, \"Well, I was trying to commit suicide. I stuck the gun to my head and then...just before I pulled the trigger... I thought, this is going to be loud. So I covered my other ear ...Read Morebefore pulling the trigger\".....ab!!!!! Read Less"
    },
    "164": {
        "category": "funny-blonde-jokes",
        "id": "38350",
        "punchline": "there was a blonde walking down the park one day, she had headphones, if she took it off she dies. a man then bumps into her and knocks her headphones off. the man sees her die on the floor. he then picks up the headphones and listens to what she was listening too. what he heard was \"breathe in, breathe out\""
    },
    "165": {
        "category": "funny-blonde-jokes",
        "id": "1393",
        "punchline": "Someone tells a blonde, I like Eminem. \nThe blonde says, I like Skittles. \nThe person says, No the rapper. \nThe blonde replies, Who cares about the Wrapper?"
    },
    "166": {
        "category": "funny-blonde-jokes",
        "id": "26569",
        "punchline": "Anant goes into confessional, \"Forgive me Father, for I have sinned.\"The priest said, \"Confess your sins and be forgiven.\"Anant said, \"Last night my girlfriend made mad passionate love to me seven times.\"The priest thought long and hard and then said, \"Squeeze seven lemons into a glass and then ...Read Moredrink the juice.\"Anant asked, \"Will this cleanse me of my sins?\"The Priest said \"No, but it will wipe that smile off of your face.\" Read Less"
    },
    "167": {
        "category": "funny-blonde-jokes",
        "id": "43181",
        "punchline": "Blonde: I'm really cold.Me: Really?Blonde: Yes, but I heard I should stand in a corner when I'm cold.Me: And how does that work?Blonde: A corner is 90 degrees."
    },
    "168": {
        "category": "funny-blonde-jokes",
        "id": "1454",
        "punchline": "A blonde, wanting to earn some money, decided to hire herself out as a handyman-type and started canvassing a wealthy neighborhood. She went to the front door of the first house and asked the owner if he had any jobs for her to do.\n\"Well, you can paint my porch. How much will you charge?\"\nThe ...Read Moreblonde said \"How about 50 dollars?\"\nThe man agreed and told her that the paint and ladders that she might need were in the garage. The man's wife, inside the house, heard the conversation and said to her husband, \"Does she realize that the porch goes all the way around the house?\" The man replied, \"She should. She was standing on the porch.\" A short time later, the blonde came to the door to collect her money. \"You're finished already?\" he asked. \"Yes,\" the blonde answered, \"and I had paint left over, so I gave it two coats.\" Impressed, the man reached in his pocket for the $50. \"And by the way,\" the blonde added, \"that's not a Porch, it's a Ferrari.\" Read Less"
    },
    "169": {
        "category": "funny-blonde-jokes",
        "id": "31567",
        "punchline": "How to confuse a blonde: draw a circle on the ground and tell them to find the corner."
    },
    "170": {
        "category": "funny-blonde-jokes",
        "id": "19782",
        "punchline": "So three blond's get into a car accident they all die To get to heven they have to walk up a million stepsWithout laughing if they do laugh they go to hell there will be a joke on every step The first blonde Dies on the first step the second blonde goes half way up And dies the third blonde is on ...Read Moreher last step. BeforeThe guy tells the joke she starts laughing the guy asksWhat's wrong the blonde says I just got the first one Read Less"
    },
    "171": {
        "category": "funny-blonde-jokes",
        "id": "26477",
        "punchline": "A Blonde reached college late.Blonde: Good morning sir.Anant: Why are you so late?Blonde: Sir, a boy was following me in the way\"Anant: But why are you late.Girl: Sir, that boy was walking very slow."
    },
    "172": {
        "category": "funny-blonde-jokes",
        "id": "40266",
        "punchline": "80000 blondes meet up for a ' BLONDS ARE NOT DUMB ' Convention. There are many reporters here and there is one main announcer. So the announcer calls up one volunteer blonde to ask some simple questions to. One blonde reluctantly comes on stage. The announcer asks her \" What is 124 + 26 \". After ...Read Morethinking for about 15 minutes she gets very excited and answers \" 55 \". The announcer says that the answer is wrong and then the whole convention is depressed. Suddenly the whole convention erupts with the chant \" GIVE HER ANOTHER CHANCE\" .So the announcer thinks it cant be worse so he asks an easier question \" What is 16 + 4\"The blonde on stage goes into very very deep thought and after about half an hour she smiles goes \" 25 \"Again the whole convention goes \" GIVE HER ANOTHER CHANCE\" . Now the announcer feels he is doing more harm than good but still asks \" What is 10 + 10 \" . She is depressed but tries again. She puts her utmost efforts and after an hour says \" 20 \".\" GIVE HER ANOTHER CHANCE.. GIVE HER ANOTHER CHANCE ! \" Read Less"
    },
    "173": {
        "category": "funny-blonde-jokes",
        "id": "43337",
        "punchline": "A blonde walks into an appliance store and sees a TV she'd like to buy. She goes to the register and says, \"I wanna buy that TV.\" The man says, \"Ma'am, I'm sorry, we don't sell to blondes.\" The blonde walks out and dyes her hair brown. She comes back in and say, \"I wanna buy that TV.\" The man gives ...Read Moreher a look and says, \"Ma'am, I've told you, we don't sell to blondes.\" So she walks out and dyes her hair black. She comes back in and says, \"I wanna buy that TV.\" The man gives her another look of pity and says, \"Ma'am, I've told you three times, we don't sell to blondes.\" The blonde walks out and dyes her hair red. She comes back in and says, \"I wanna buy that TV.\" The man gives her a very tired look and says, \"Ma'am, I've told you. We don't sell to blondes.\" She asks, \"How have you known I'm a blonde this whole time?\"The man replies, \"Because ma'am... that's a microwave.\" Read Less"
    },
    "174": {
        "category": "funny-blonde-jokes",
        "id": "39926",
        "punchline": " Q: What do you do if a blonde chucks a grenade at you?A: Pull the pin and throw it back"
    },
    "175": {
        "category": "funny-blonde-jokes",
        "id": "614",
        "punchline": "Two blondes were talking in heaven, they were discussing how they died. The first blonde said 'i had a heart attact, my family has a long line of heart disease, i guess it was my time.' The second blonde said ' oh.. i froze to death, it was NOT the way i wanted to die, its too late now.' 'the first ...Read Moreblonde asked, 'what is it like to freeze to death?' 'It is cold, but soon its kinda peaceful, once you know you're dying. What happened before you had your heart attack? 'the first blonde answered ' i knew my husband was cheating on me, so one day i went home early. my car is really old, so my husband probly could hear me pull into the driveway. That give his girlfriend plenty of time to hide. when i walked into the house, it was quiet. i ran up to out bedroom and found my husband watching tv in bed. i could see a glimpse of a bra underneath our bed that definitely wasn't mine, so i immediately accused him of cheating, and i ran around  the house to find the hoe. I checked in every room, but when i got to the attic, i had a heart attackthat instantly killed me.' the second blonde moaned 'shame, if you had only looked in the freezer, we would both still be alive.'Post your awesome joke here. Read Less"
    },
    "176": {
        "category": "funny-blonde-jokes",
        "id": "3471",
        "punchline": "There are three 6th grade girls: a blonde, a brunette, and a redhead. Which one has the biggest tits?\nThe blonde....she's 18."
    },
    "177": {
        "category": "funny-blonde-jokes",
        "id": "26079",
        "punchline": "Q: What do blondes wear behind their ears to attract Anant.A: Their heels. "
    },
    "178": {
        "category": "funny-blonde-jokes",
        "id": "28067",
        "punchline": "1. Why was the blonde exited when she finished a jigsaw puzzle in 6 months? Because the box said 2-4 years2. Why did the blonde sell her car? She needed gas money3. What do u do when a blonde throws a grenade at you? Pull the pin, and throw it back4. why do blondes have TGIF written on their shoes? ...Read MoreTo remind themselves that TOES GO IN FIRST.5. How did the blonde break her leg raking leaves? She fell out of the tree6. How do you amuse a blonde for hours? Give her a sheet of paper that says \"please turn over\" on both sides7. What did the blonde bring to the super bowl? A spoon8. What do you call it when a blonde dyes her hair brunette? Artificial intelligence. 9. What is a blonde doing when she holds her hands tightly over her ears? She's trying to hold onto a thought10. What does a blonde do when you say \"it's chilly outside\"? She grabs a bowl11. What do you call a blonde skeleton in a closet? Last years hide and seek champion12. What did the blonde name her pet zebra? Spot Read Less"
    },
    "179": {
        "category": "funny-blonde-jokes",
        "id": "41835",
        "punchline": "How to mess with a blond for hours?write 'please turn over' on each side of the paper"
    },
    "180": {
        "category": "funny-blonde-jokes",
        "id": "6757",
        "punchline": "What My Blonde Friend DidShe called me to get my phone number. She spent 20 minutes looking at the orange juice box because it said \"concentrate.\" She put lipstick on her forehead because she wanted to make up her mind. She got stabbed in a shoot-out. She told me to meet her at the corner of \"WALK\" ...Read Moreand \"DON'T WALK.\" She tried to put M&M's in alphabetical order. She sat on the TV and watched the couch. She sent me a fax with a stamp on it. She tried to drown a fish. She thought a quarterback was a refund. She got locked in a grocery store and starved to death. If you gave her a penny for her thoughts, you'd get change back. They had to burn the school down to get her out of third grade. Under \"education\" on her job application, she put \"Hooked On Phonics.\" She tripped over a cordless phone. She took a ruler to bed to see how long she slept. At the bottom of the application where it says \"sign here\" she put \"Sagittarius.\" She asked for a price check at the Dollar Store. It takes her two hours to watch 60 Minutes. If she spoke her mind, she'd probably be speechless. She studied for a blood test. She thought Boyz II Men was a daycare center. She thought Meow Mix was a record for cats. She thought she needed a token to get on Soul Train. She sold the car for gas money. When she saw the \"NC-17\" (under 17 not admitted), she went home and got 16 friends. When she heard that 90% of all crimes occur around the home, she moved. She thinks Taco Bell is where you pay your phone bill. When she missed the 44 bus, she took the 22 bus twice instead. When she took you to the airport and saw a sign that said \"Airport Left\" she turned around and went home.-The Awesome 1 Read Less"
    },
    "181": {
        "category": "funny-blonde-jokes",
        "id": "26056",
        "punchline": "Anant and blonde were having sex. In middle of heat, Anant blows in her ear.\nBlonde says \"Ooooh that's nice. Thanks for the refill!\""
    },
    "182": {
        "category": "funny-blonde-jokes",
        "id": "33993",
        "punchline": "A brunette was walking down some train tracks saying \"21, 21, 21...\" repeatedly. A blonde saw her and began to follow along. After a moment the blonde asked, \"whatchya doin?\" The brunette said \"counting\" and went back to chanting 21. The blonde asked if she could join the brunette and the brunette ...Read Moresaid \"sure, hop up onto the tracks.\"Both girls walked down the track saying 21 over and over. Eventually a train started coming down the tracks, horn blaring. When the rails started to rumble the brunette jumped down and walked away to a safe distance. A few seconds later the train hit the blonde, throwing her far out into the field dead.After the train passed the brunette hopped back onto the tracks and resumed walking. Now, however, she chanted \"22, 22, 22...\" Read Less"
    },
    "183": {
        "category": "funny-blonde-jokes",
        "id": "25533",
        "punchline": "A blonde walks into a doctors office with a gunshot wound in her hand. The doctor asks, \"How did this happen?\" She replies, \"Well, I was trying to commit suicide. I stuck the gun to my head and then...just before I pulled the trigger... I thought, this is going to be loud. So I covered my other ear ...Read Morebefore pulling the trigger\".....ab!!!!! Read Less"
    },
    "184": {
        "category": "funny-blonde-jokes",
        "id": "38350",
        "punchline": "there was a blonde walking down the park one day, she had headphones, if she took it off she dies. a man then bumps into her and knocks her headphones off. the man sees her die on the floor. he then picks up the headphones and listens to what she was listening too. what he heard was \"breathe in, breathe out\""
    },
    "185": {
        "category": "funny-blonde-jokes",
        "id": "1393",
        "punchline": "Someone tells a blonde, I like Eminem. \nThe blonde says, I like Skittles. \nThe person says, No the rapper. \nThe blonde replies, Who cares about the Wrapper?"
    },
    "186": {
        "category": "funny-blonde-jokes",
        "id": "26569",
        "punchline": "Anant goes into confessional, \"Forgive me Father, for I have sinned.\"The priest said, \"Confess your sins and be forgiven.\"Anant said, \"Last night my girlfriend made mad passionate love to me seven times.\"The priest thought long and hard and then said, \"Squeeze seven lemons into a glass and then ...Read Moredrink the juice.\"Anant asked, \"Will this cleanse me of my sins?\"The Priest said \"No, but it will wipe that smile off of your face.\" Read Less"
    },
    "187": {
        "category": "funny-blonde-jokes",
        "id": "43181",
        "punchline": "Blonde: I'm really cold.Me: Really?Blonde: Yes, but I heard I should stand in a corner when I'm cold.Me: And how does that work?Blonde: A corner is 90 degrees."
    },
    "188": {
        "category": "funny-blonde-jokes",
        "id": "1454",
        "punchline": "A blonde, wanting to earn some money, decided to hire herself out as a handyman-type and started canvassing a wealthy neighborhood. She went to the front door of the first house and asked the owner if he had any jobs for her to do.\n\"Well, you can paint my porch. How much will you charge?\"\nThe ...Read Moreblonde said \"How about 50 dollars?\"\nThe man agreed and told her that the paint and ladders that she might need were in the garage. The man's wife, inside the house, heard the conversation and said to her husband, \"Does she realize that the porch goes all the way around the house?\" The man replied, \"She should. She was standing on the porch.\" A short time later, the blonde came to the door to collect her money. \"You're finished already?\" he asked. \"Yes,\" the blonde answered, \"and I had paint left over, so I gave it two coats.\" Impressed, the man reached in his pocket for the $50. \"And by the way,\" the blonde added, \"that's not a Porch, it's a Ferrari.\" Read Less"
    },
    "189": {
        "category": "funny-blonde-jokes",
        "id": "31567",
        "punchline": "How to confuse a blonde: draw a circle on the ground and tell them to find the corner."
    },
    "190": {
        "category": "funny-blonde-jokes",
        "id": "19782",
        "punchline": "So three blond's get into a car accident they all die To get to heven they have to walk up a million stepsWithout laughing if they do laugh they go to hell there will be a joke on every step The first blonde Dies on the first step the second blonde goes half way up And dies the third blonde is on ...Read Moreher last step. BeforeThe guy tells the joke she starts laughing the guy asksWhat's wrong the blonde says I just got the first one Read Less"
    },
    "191": {
        "category": "funny-blonde-jokes",
        "id": "26477",
        "punchline": "A Blonde reached college late.Blonde: Good morning sir.Anant: Why are you so late?Blonde: Sir, a boy was following me in the way\"Anant: But why are you late.Girl: Sir, that boy was walking very slow."
    },
    "192": {
        "category": "funny-blonde-jokes",
        "id": "40266",
        "punchline": "80000 blondes meet up for a ' BLONDS ARE NOT DUMB ' Convention. There are many reporters here and there is one main announcer. So the announcer calls up one volunteer blonde to ask some simple questions to. One blonde reluctantly comes on stage. The announcer asks her \" What is 124 + 26 \". After ...Read Morethinking for about 15 minutes she gets very excited and answers \" 55 \". The announcer says that the answer is wrong and then the whole convention is depressed. Suddenly the whole convention erupts with the chant \" GIVE HER ANOTHER CHANCE\" .So the announcer thinks it cant be worse so he asks an easier question \" What is 16 + 4\"The blonde on stage goes into very very deep thought and after about half an hour she smiles goes \" 25 \"Again the whole convention goes \" GIVE HER ANOTHER CHANCE\" . Now the announcer feels he is doing more harm than good but still asks \" What is 10 + 10 \" . She is depressed but tries again. She puts her utmost efforts and after an hour says \" 20 \".\" GIVE HER ANOTHER CHANCE.. GIVE HER ANOTHER CHANCE ! \" Read Less"
    },
    "193": {
        "category": "funny-blonde-jokes",
        "id": "43337",
        "punchline": "A blonde walks into an appliance store and sees a TV she'd like to buy. She goes to the register and says, \"I wanna buy that TV.\" The man says, \"Ma'am, I'm sorry, we don't sell to blondes.\" The blonde walks out and dyes her hair brown. She comes back in and say, \"I wanna buy that TV.\" The man gives ...Read Moreher a look and says, \"Ma'am, I've told you, we don't sell to blondes.\" So she walks out and dyes her hair black. She comes back in and says, \"I wanna buy that TV.\" The man gives her another look of pity and says, \"Ma'am, I've told you three times, we don't sell to blondes.\" The blonde walks out and dyes her hair red. She comes back in and says, \"I wanna buy that TV.\" The man gives her a very tired look and says, \"Ma'am, I've told you. We don't sell to blondes.\" She asks, \"How have you known I'm a blonde this whole time?\"The man replies, \"Because ma'am... that's a microwave.\" Read Less"
    },
    "194": {
        "category": "funny-blonde-jokes",
        "id": "39926",
        "punchline": " Q: What do you do if a blonde chucks a grenade at you?A: Pull the pin and throw it back"
    },
    "195": {
        "category": "funny-blonde-jokes",
        "id": "614",
        "punchline": "Two blondes were talking in heaven, they were discussing how they died. The first blonde said 'i had a heart attact, my family has a long line of heart disease, i guess it was my time.' The second blonde said ' oh.. i froze to death, it was NOT the way i wanted to die, its too late now.' 'the first ...Read Moreblonde asked, 'what is it like to freeze to death?' 'It is cold, but soon its kinda peaceful, once you know you're dying. What happened before you had your heart attack? 'the first blonde answered ' i knew my husband was cheating on me, so one day i went home early. my car is really old, so my husband probly could hear me pull into the driveway. That give his girlfriend plenty of time to hide. when i walked into the house, it was quiet. i ran up to out bedroom and found my husband watching tv in bed. i could see a glimpse of a bra underneath our bed that definitely wasn't mine, so i immediately accused him of cheating, and i ran around  the house to find the hoe. I checked in every room, but when i got to the attic, i had a heart attackthat instantly killed me.' the second blonde moaned 'shame, if you had only looked in the freezer, we would both still be alive.'Post your awesome joke here. Read Less"
    },
    "196": {
        "category": "funny-blonde-jokes",
        "id": "3471",
        "punchline": "There are three 6th grade girls: a blonde, a brunette, and a redhead. Which one has the biggest tits?\nThe blonde....she's 18."
    },
    "197": {
        "category": "funny-blonde-jokes",
        "id": "26079",
        "punchline": "Q: What do blondes wear behind their ears to attract Anant.A: Their heels. "
    },
    "198": {
        "category": "funny-blonde-jokes",
        "id": "28067",
        "punchline": "1. Why was the blonde exited when she finished a jigsaw puzzle in 6 months? Because the box said 2-4 years2. Why did the blonde sell her car? She needed gas money3. What do u do when a blonde throws a grenade at you? Pull the pin, and throw it back4. why do blondes have TGIF written on their shoes? ...Read MoreTo remind themselves that TOES GO IN FIRST.5. How did the blonde break her leg raking leaves? She fell out of the tree6. How do you amuse a blonde for hours? Give her a sheet of paper that says \"please turn over\" on both sides7. What did the blonde bring to the super bowl? A spoon8. What do you call it when a blonde dyes her hair brunette? Artificial intelligence. 9. What is a blonde doing when she holds her hands tightly over her ears? She's trying to hold onto a thought10. What does a blonde do when you say \"it's chilly outside\"? She grabs a bowl11. What do you call a blonde skeleton in a closet? Last years hide and seek champion12. What did the blonde name her pet zebra? Spot Read Less"
    },
    "199": {
        "category": "funny-blonde-jokes",
        "id": "41835",
        "punchline": "How to mess with a blond for hours?write 'please turn over' on each side of the paper"
    },
    "200": {
        "category": "funny-blonde-jokes",
        "id": "6757",
        "punchline": "What My Blonde Friend DidShe called me to get my phone number. She spent 20 minutes looking at the orange juice box because it said \"concentrate.\" She put lipstick on her forehead because she wanted to make up her mind. She got stabbed in a shoot-out. She told me to meet her at the corner of \"WALK\" ...Read Moreand \"DON'T WALK.\" She tried to put M&M's in alphabetical order. She sat on the TV and watched the couch. She sent me a fax with a stamp on it. She tried to drown a fish. She thought a quarterback was a refund. She got locked in a grocery store and starved to death. If you gave her a penny for her thoughts, you'd get change back. They had to burn the school down to get her out of third grade. Under \"education\" on her job application, she put \"Hooked On Phonics.\" She tripped over a cordless phone. She took a ruler to bed to see how long she slept. At the bottom of the application where it says \"sign here\" she put \"Sagittarius.\" She asked for a price check at the Dollar Store. It takes her two hours to watch 60 Minutes. If she spoke her mind, she'd probably be speechless. She studied for a blood test. She thought Boyz II Men was a daycare center. She thought Meow Mix was a record for cats. She thought she needed a token to get on Soul Train. She sold the car for gas money. When she saw the \"NC-17\" (under 17 not admitted), she went home and got 16 friends. When she heard that 90% of all crimes occur around the home, she moved. She thinks Taco Bell is where you pay your phone bill. When she missed the 44 bus, she took the 22 bus twice instead. When she took you to the airport and saw a sign that said \"Airport Left\" she turned around and went home.-The Awesome 1 Read Less"
    },
    "201": {
        "category": "funny-blonde-jokes",
        "id": "7330",
        "punchline": "There was a blonde, brunet and a redhead they were on there way to heaven. God said, \"I will give you 100 jokes; if you laugh you go to hell.\" The brunet laughed at the 10th joke and she went to hell. The redhead laughed at the 43rd joke and she went to hell. The blonde was at the 99th joke then ...Read Moreshe laughed. \"WHAT THE HELL YOU WERE ALMOST TO HEAVEN ! WHY DID YOU LAUGH?\", said god. Blonde said, \"I just got the first joke.\" Read Less"
    },
    "202": {
        "category": "funny-blonde-jokes",
        "id": "31357",
        "punchline": "why did the cute blonde girl get fired from the M&M factory?? because she threw away all the W's"
    },
    "203": {
        "category": "funny-blonde-jokes",
        "id": "10091",
        "punchline": "Once upon a time a blonde was swimming in the river. A man went up to her and asked, \"Why are you doing this? The blonde said, \"I'm washing my clothes. Is there a problem?\" The man said, \"Why don't you try a washing machine? The blonde replied, \"I feel dizzy in the washing machine!\" "
    },
    "204": {
        "category": "funny-blonde-jokes",
        "id": "22753",
        "punchline": "Blonde: Hey, what does IDK,TTYL,ILY mean?BF: I don't know, talk to you later, I love youBlonde: OKBlonde: Just for the record, what does STFU mean?BF: Shut the fu*k upBlonde: THAT IS SO RUDE! WE ARE BREAKING UP.BF: *facepalm*"
    },
    "205": {
        "category": "funny-blonde-jokes",
        "id": "26261",
        "punchline": "Anna, a blonde in the police station. The desk officer sayes \"so when did you realise you were raped ?\"She replies ... \"when the cheque bounced !\""
    },
    "206": {
        "category": "funny-blonde-jokes",
        "id": "797",
        "punchline": "A red haired person, a blond, and a brunette go hunting the brunette comes back with a deer and the red haired person says, \"how did you get that?\"  The brunette responds, \"I saw the tracks; I followed the tracks and boom a deer.\" So the red head comes back with an elephant and says, \"I saw the ...Read Moretracks; I followed the tracks and boom an elephant.\" The blonde comes back beaten and nearly dead and says, \"I saw the tracks; I followed the track and boom a train.\" Read Less"
    },
    "207": {
        "category": "funny-blonde-jokes",
        "id": "38557",
        "punchline": "Girlfriend : I need help with this puzzleBoyfriend : what is it supposed to look like?Girlfriend : a tigerBoyfriend : we are never going to finish this puzzleBoyfriend : now put the frosted flakes back in the cereal box"
    },
    "208": {
        "category": "funny-blonde-jokes",
        "id": "10789",
        "punchline": "Blonde1- Hey can I have some of your shampoo?Blonde2- Yeah, why not use yours?Blonde1- Mine is for dry hair and I got it wet already."
    },
    "209": {
        "category": "funny-blonde-jokes",
        "id": "34108",
        "punchline": "Why can't a blonde count to 70 because 69 was a mouth full "
    },
    "210": {
        "category": "funny-blonde-jokes",
        "id": "3617",
        "punchline": "Two blondes lock their keys in the car. One of the blondes tries to break into the car while the the other one watches. \n\nFinally the first blonde says \"Darn, I can't get in the car!\" The other blond replies, \"keep trying, it looks like it is going to rain and the top is down\"."
    },
    "211": {
        "category": "funny-blonde-jokes",
        "id": "9490",
        "punchline": "Why did the blonde put her iPad in a blender? Because she wanted to make apple juice. "
    },
    "212": {
        "category": "funny-blonde-jokes",
        "id": "26242",
        "punchline": "Anant: And therefore, sperm cells are made up of fructose. So its sweet to taste.Blonde: But it doesn't even taste like that... Anant: Because sweetness taste buds are situated at tip of tongue inlt"
    },
    "213": {
        "category": "funny-blonde-jokes",
        "id": "39271",
        "punchline": "What's the difference between a UFO and a smart blonde?THERE HAVE BEEN UFO SIGHTINGS"
    },
    "214": {
        "category": "funny-blonde-jokes",
        "id": "13651",
        "punchline": "What did the blonde see when she looked into a box if cheerios?Donut seeds"
    },
    "215": {
        "category": "funny-blonde-jokes",
        "id": "18864",
        "punchline": "Two blondes are walking on opposite sides of a river. the first blonde yells out, Hey How do I get to the other side of the river? The second blonde thinks about it for a moment, then yells back. Don't be silly, You are on the other side!"
    },
    "216": {
        "category": "funny-blonde-jokes",
        "id": "40502",
        "punchline": "Blonde is standing in front of the soda machine at work and keeps putting in 50 cents and getting a soda. After awhile, with several sodas at her feet and a long line forming behind her, one of the other workers taps her on the shoulder and asks if she will be much longer because they want sodas ...Read Moretoo. The blonde turns around and quite exasperated says, \"duh, I am still winning...\" Read Less"
    },
    "217": {
        "category": "funny-blonde-jokes",
        "id": "26698",
        "punchline": "Professors Anant is well known for his sexist comments in class. One day, all of the blondes in the class gathered outside of the classroom and decided that the next time he made a sexist comment they would all walk out of the classroom.The next day the Anant was talking and made another sexist ...Read Morestatement as expected, \"You ladies will be happy to hear that the nigerians have an average penis size of 12 inches.\" With this all of the blondes walk out. He calls to them, \"Girls! Wait! The next flight to nigeria doesn't leave for next few hours!\" Read Less"
    },
    "218": {
        "category": "funny-blonde-jokes",
        "id": "36226",
        "punchline": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging ...Read Moreand pleading with her not to shoot herself. Hysterically the blonde responds to the husband, ''Shut up...you're next!''by korowal Read Less"
    },
    "219": {
        "category": "funny-blonde-jokes",
        "id": "5782",
        "punchline": "what do you call a blonde with pig tails?\na blowjob with handlebars."
    },
    "220": {
        "category": "funny-blonde-jokes",
        "id": "42860",
        "punchline": "One day, a blonde wanted to travel from America to Europe. She rang a Travel agent to ask how long it would take. Blonde: How long does take to travel to Europe from America?Travel agent: just a minute,Blonde: Thanks *hangs up phone*"
    },
    "221": {
        "category": "funny-blonde-jokes",
        "id": "7330",
        "punchline": "There was a blonde, brunet and a redhead they were on there way to heaven. God said, \"I will give you 100 jokes; if you laugh you go to hell.\" The brunet laughed at the 10th joke and she went to hell. The redhead laughed at the 43rd joke and she went to hell. The blonde was at the 99th joke then ...Read Moreshe laughed. \"WHAT THE HELL YOU WERE ALMOST TO HEAVEN ! WHY DID YOU LAUGH?\", said god. Blonde said, \"I just got the first joke.\" Read Less"
    },
    "222": {
        "category": "funny-blonde-jokes",
        "id": "31357",
        "punchline": "why did the cute blonde girl get fired from the M&M factory?? because she threw away all the W's"
    },
    "223": {
        "category": "funny-blonde-jokes",
        "id": "10091",
        "punchline": "Once upon a time a blonde was swimming in the river. A man went up to her and asked, \"Why are you doing this? The blonde said, \"I'm washing my clothes. Is there a problem?\" The man said, \"Why don't you try a washing machine? The blonde replied, \"I feel dizzy in the washing machine!\" "
    },
    "224": {
        "category": "funny-blonde-jokes",
        "id": "22753",
        "punchline": "Blonde: Hey, what does IDK,TTYL,ILY mean?BF: I don't know, talk to you later, I love youBlonde: OKBlonde: Just for the record, what does STFU mean?BF: Shut the fu*k upBlonde: THAT IS SO RUDE! WE ARE BREAKING UP.BF: *facepalm*"
    },
    "225": {
        "category": "funny-blonde-jokes",
        "id": "26261",
        "punchline": "Anna, a blonde in the police station. The desk officer sayes \"so when did you realise you were raped ?\"She replies ... \"when the cheque bounced !\""
    },
    "226": {
        "category": "funny-blonde-jokes",
        "id": "797",
        "punchline": "A red haired person, a blond, and a brunette go hunting the brunette comes back with a deer and the red haired person says, \"how did you get that?\"  The brunette responds, \"I saw the tracks; I followed the tracks and boom a deer.\" So the red head comes back with an elephant and says, \"I saw the ...Read Moretracks; I followed the tracks and boom an elephant.\" The blonde comes back beaten and nearly dead and says, \"I saw the tracks; I followed the track and boom a train.\" Read Less"
    },
    "227": {
        "category": "funny-blonde-jokes",
        "id": "38557",
        "punchline": "Girlfriend : I need help with this puzzleBoyfriend : what is it supposed to look like?Girlfriend : a tigerBoyfriend : we are never going to finish this puzzleBoyfriend : now put the frosted flakes back in the cereal box"
    },
    "228": {
        "category": "funny-blonde-jokes",
        "id": "10789",
        "punchline": "Blonde1- Hey can I have some of your shampoo?Blonde2- Yeah, why not use yours?Blonde1- Mine is for dry hair and I got it wet already."
    },
    "229": {
        "category": "funny-blonde-jokes",
        "id": "34108",
        "punchline": "Why can't a blonde count to 70 because 69 was a mouth full "
    },
    "230": {
        "category": "funny-blonde-jokes",
        "id": "3617",
        "punchline": "Two blondes lock their keys in the car. One of the blondes tries to break into the car while the the other one watches. \n\nFinally the first blonde says \"Darn, I can't get in the car!\" The other blond replies, \"keep trying, it looks like it is going to rain and the top is down\"."
    },
    "231": {
        "category": "funny-blonde-jokes",
        "id": "9490",
        "punchline": "Why did the blonde put her iPad in a blender? Because she wanted to make apple juice. "
    },
    "232": {
        "category": "funny-blonde-jokes",
        "id": "26242",
        "punchline": "Anant: And therefore, sperm cells are made up of fructose. So its sweet to taste.Blonde: But it doesn't even taste like that... Anant: Because sweetness taste buds are situated at tip of tongue inlt"
    },
    "233": {
        "category": "funny-blonde-jokes",
        "id": "39271",
        "punchline": "What's the difference between a UFO and a smart blonde?THERE HAVE BEEN UFO SIGHTINGS"
    },
    "234": {
        "category": "funny-blonde-jokes",
        "id": "13651",
        "punchline": "What did the blonde see when she looked into a box if cheerios?Donut seeds"
    },
    "235": {
        "category": "funny-blonde-jokes",
        "id": "18864",
        "punchline": "Two blondes are walking on opposite sides of a river. the first blonde yells out, Hey How do I get to the other side of the river? The second blonde thinks about it for a moment, then yells back. Don't be silly, You are on the other side!"
    },
    "236": {
        "category": "funny-blonde-jokes",
        "id": "40502",
        "punchline": "Blonde is standing in front of the soda machine at work and keeps putting in 50 cents and getting a soda. After awhile, with several sodas at her feet and a long line forming behind her, one of the other workers taps her on the shoulder and asks if she will be much longer because they want sodas ...Read Moretoo. The blonde turns around and quite exasperated says, \"duh, I am still winning...\" Read Less"
    },
    "237": {
        "category": "funny-blonde-jokes",
        "id": "26698",
        "punchline": "Professors Anant is well known for his sexist comments in class. One day, all of the blondes in the class gathered outside of the classroom and decided that the next time he made a sexist comment they would all walk out of the classroom.The next day the Anant was talking and made another sexist ...Read Morestatement as expected, \"You ladies will be happy to hear that the nigerians have an average penis size of 12 inches.\" With this all of the blondes walk out. He calls to them, \"Girls! Wait! The next flight to nigeria doesn't leave for next few hours!\" Read Less"
    },
    "238": {
        "category": "funny-blonde-jokes",
        "id": "36226",
        "punchline": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging ...Read Moreand pleading with her not to shoot herself. Hysterically the blonde responds to the husband, ''Shut up...you're next!''by korowal Read Less"
    },
    "239": {
        "category": "funny-blonde-jokes",
        "id": "5782",
        "punchline": "what do you call a blonde with pig tails?\na blowjob with handlebars."
    },
    "240": {
        "category": "funny-blonde-jokes",
        "id": "42860",
        "punchline": "One day, a blonde wanted to travel from America to Europe. She rang a Travel agent to ask how long it would take. Blonde: How long does take to travel to Europe from America?Travel agent: just a minute,Blonde: Thanks *hangs up phone*"
    },
    "241": {
        "category": "funny-blonde-jokes",
        "id": "20475",
        "punchline": "Q: Why was the blonde so disappointed when she got her license?A: She had gotten an F in sex!"
    },
    "242": {
        "category": "funny-blonde-jokes",
        "id": "22094",
        "punchline": "Why did the blonde stare at the orange juice, Because on the container it said concentrate."
    },
    "243": {
        "category": "funny-blonde-jokes",
        "id": "30333",
        "punchline": "A blonde was walking in a mall during Christmas time, as she walked by Santa he said \"ho ho ho!\" She looked back and yelled \"sorry! I'm not working right now, but I will tonight!\""
    },
    "244": {
        "category": "funny-blonde-jokes",
        "id": "26776",
        "punchline": "Pakistani to his Wife:Our pathan watchman is casanova. He has f*ckd every woman in our buildng excpt one.Wife: It must be Lady on 4th floor. She is very religious."
    },
    "245": {
        "category": "funny-blonde-jokes",
        "id": "3818",
        "punchline": "A blonde had just totaled her car in a horrific accident. Miraculously, she managed to pry herself from the wreckage without a scratch and was applying fresh lipstick when the state trooper arrived.\n \n“My God!” the trooper gasped. “Your car looks like an accordion that was stomped on by an elephant....Read More Are you OK ma’am?”\n \n“Yes, officer, I’m just fine” the blonde chirped.\n \n“Well, how in the world did this happen?” the officer asked as he surveyed the wrecked car.\n \n“Officer, it was the strangest thing!” the blonde began. I was driving along this road when from out of nowhere this TREE pops up in front of me. So I swerved to the right, and there was another tree! I swerved to the left and there was ANOTHER tree! I served to the right and there was another tree! I swerved to the left and there was ….”\n \n“Uh, ma’am”, the officer said, cutting her off, “There isn’t a tree on this road for 30 miles. That was your air freshener swinging back and forth. Read Less"
    },
    "246": {
        "category": "funny-blonde-jokes",
        "id": "5022",
        "punchline": "A blonde desserts her home town out of shame, and colors her hair brown. She drives past a farm and sees all the sheep. She goes up to the farmer and ask, \"If I guess how many sheep you have can I have one?\" The farmer nodded. She continued. \"159\" The farmer is surprised. \"How did you know?\" \"Lucky ...Read Moreguess\" She grabs one and gets in her car. The farmer comes up and says, \"If I can guess your real hair color can I get my dog back?\" Read Less"
    },
    "247": {
        "category": "funny-blonde-jokes",
        "id": "10847",
        "punchline": "How do you know when a blonde is having a bad day?when she has a tampon tucked behind her ear and she cant find her pencil"
    },
    "248": {
        "category": "funny-blonde-jokes",
        "id": "41723",
        "punchline": "how to drowned a blonde:put a scratch and sniff sticker at the bottom of a pool "
    },
    "249": {
        "category": "funny-blonde-jokes",
        "id": "36848",
        "punchline": "Two blonds driving down the road looking for Disneyland until they come to a sign that say's Disneyland Left, so they went home!"
    },
    "250": {
        "category": "funny-blonde-jokes",
        "id": "3550",
        "punchline": "A blind guy on a bar stool shouts to the bartender, \"Wanna hear a blonde joke?\"\n      In a hushed voice, the guy next to him says, \"Before you tell that joke, you should know something.\n      \"Our bartender IS blonde, the bouncer is blonde. I'm a 6' tall, 200 lb black belt. The guy sitting next to ...Read Moreme is 6'2, weighs 225 and he's a rugby player. The fella to your right is 6'5\" pushing 300 and he's a wrestler. Each one of US is blonde. Think about it, Mister. Do you still wanna tell that joke?\"\n     The blind guy says, \"Nah, not if I'm gonna have to explain it five f*cking times.\" Read Less"
    },
    "251": {
        "category": "funny-blonde-jokes",
        "id": "35664",
        "punchline": "What do you do when a blonde throws a grenaed at you?Awenser: pull the ring and throw it back"
    },
    "252": {
        "category": "funny-blonde-jokes",
        "id": "18972",
        "punchline": "A blonde and a red head fall out of a window at the exact same time. Who makes it to the groung first? The redhead, because the blonde had to stop and ask for directions on the way down. "
    },
    "253": {
        "category": "funny-blonde-jokes",
        "id": "6190",
        "punchline": "Why is a blonde like a railway track?\nShe gets laid all over the country."
    },
    "254": {
        "category": "funny-blonde-jokes",
        "id": "27416",
        "punchline": "Blonde tells Dr Anant \"don't you think that you males are the root of problems ?Anant - ??????Blonde continued - menorrhagia, menarche, dysmenorrhoea, amenorrhoea! !! All have one thing in common MEN. Is there end to it???Anant replying with smile - After 40 you get a phase when men won't disturb ...Read Moreyou, when men-o-pause will come!!! Read Less"
    },
    "255": {
        "category": "funny-blonde-jokes",
        "id": "27039",
        "punchline": "ALWAYS TIREDA blonde goes to her doctor Anant complaining that she isexhausted all the time. After the diagnostic tests showed nothing, the Anant gets around to asking her how often she has intercourse. \"Every Monday, Wednesday, and Saturday,\" she says. The doctor advises her to cut out Wednesday. \"...Read MoreI can't,\" says the woman. \"That's the only night I'm home with my husband!\" Read Less"
    },
    "256": {
        "category": "funny-blonde-jokes",
        "id": "6871",
        "punchline": "Why did the blonde not talk during sex? Beacuse her mom told her not to talk to strangers"
    },
    "257": {
        "category": "funny-blonde-jokes",
        "id": "31317",
        "punchline": "A hot blonde woman is walking past a school with a pig in her hands A student yells \"How did you get that\"The pig yells back \"I won her in a raffle\" "
    },
    "258": {
        "category": "funny-blonde-jokes",
        "id": "28108",
        "punchline": "Two blondes where driving to Disneyland they pasted a sign that said Disneyland Left, and they went home crying."
    },
    "259": {
        "category": "funny-blonde-jokes",
        "id": "35437",
        "punchline": "A blonde walks into a hospital and says doctor I have pain all over my body. When I press my knee it hurts when I press my arm it hurts, anywhere I press I'm in pain. The doctor says you have hurt your finger and walks off"
    },
    "260": {
        "category": "funny-blonde-jokes",
        "id": "31687",
        "punchline": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\""
    },
    "261": {
        "category": "funny-blonde-jokes",
        "id": "20475",
        "punchline": "Q: Why was the blonde so disappointed when she got her license?A: She had gotten an F in sex!"
    },
    "262": {
        "category": "funny-blonde-jokes",
        "id": "22094",
        "punchline": "Why did the blonde stare at the orange juice, Because on the container it said concentrate."
    },
    "263": {
        "category": "funny-blonde-jokes",
        "id": "30333",
        "punchline": "A blonde was walking in a mall during Christmas time, as she walked by Santa he said \"ho ho ho!\" She looked back and yelled \"sorry! I'm not working right now, but I will tonight!\""
    },
    "264": {
        "category": "funny-blonde-jokes",
        "id": "26776",
        "punchline": "Pakistani to his Wife:Our pathan watchman is casanova. He has f*ckd every woman in our buildng excpt one.Wife: It must be Lady on 4th floor. She is very religious."
    },
    "265": {
        "category": "funny-blonde-jokes",
        "id": "3818",
        "punchline": "A blonde had just totaled her car in a horrific accident. Miraculously, she managed to pry herself from the wreckage without a scratch and was applying fresh lipstick when the state trooper arrived.\n \n“My God!” the trooper gasped. “Your car looks like an accordion that was stomped on by an elephant....Read More Are you OK ma’am?”\n \n“Yes, officer, I’m just fine” the blonde chirped.\n \n“Well, how in the world did this happen?” the officer asked as he surveyed the wrecked car.\n \n“Officer, it was the strangest thing!” the blonde began. I was driving along this road when from out of nowhere this TREE pops up in front of me. So I swerved to the right, and there was another tree! I swerved to the left and there was ANOTHER tree! I served to the right and there was another tree! I swerved to the left and there was ….”\n \n“Uh, ma’am”, the officer said, cutting her off, “There isn’t a tree on this road for 30 miles. That was your air freshener swinging back and forth. Read Less"
    },
    "266": {
        "category": "funny-blonde-jokes",
        "id": "5022",
        "punchline": "A blonde desserts her home town out of shame, and colors her hair brown. She drives past a farm and sees all the sheep. She goes up to the farmer and ask, \"If I guess how many sheep you have can I have one?\" The farmer nodded. She continued. \"159\" The farmer is surprised. \"How did you know?\" \"Lucky ...Read Moreguess\" She grabs one and gets in her car. The farmer comes up and says, \"If I can guess your real hair color can I get my dog back?\" Read Less"
    },
    "267": {
        "category": "funny-blonde-jokes",
        "id": "10847",
        "punchline": "How do you know when a blonde is having a bad day?when she has a tampon tucked behind her ear and she cant find her pencil"
    },
    "268": {
        "category": "funny-blonde-jokes",
        "id": "41723",
        "punchline": "how to drowned a blonde:put a scratch and sniff sticker at the bottom of a pool "
    },
    "269": {
        "category": "funny-blonde-jokes",
        "id": "36848",
        "punchline": "Two blonds driving down the road looking for Disneyland until they come to a sign that say's Disneyland Left, so they went home!"
    },
    "270": {
        "category": "funny-blonde-jokes",
        "id": "3550",
        "punchline": "A blind guy on a bar stool shouts to the bartender, \"Wanna hear a blonde joke?\"\n      In a hushed voice, the guy next to him says, \"Before you tell that joke, you should know something.\n      \"Our bartender IS blonde, the bouncer is blonde. I'm a 6' tall, 200 lb black belt. The guy sitting next to ...Read Moreme is 6'2, weighs 225 and he's a rugby player. The fella to your right is 6'5\" pushing 300 and he's a wrestler. Each one of US is blonde. Think about it, Mister. Do you still wanna tell that joke?\"\n     The blind guy says, \"Nah, not if I'm gonna have to explain it five f*cking times.\" Read Less"
    },
    "271": {
        "category": "funny-blonde-jokes",
        "id": "35664",
        "punchline": "What do you do when a blonde throws a grenaed at you?Awenser: pull the ring and throw it back"
    },
    "272": {
        "category": "funny-blonde-jokes",
        "id": "18972",
        "punchline": "A blonde and a red head fall out of a window at the exact same time. Who makes it to the groung first? The redhead, because the blonde had to stop and ask for directions on the way down. "
    },
    "273": {
        "category": "funny-blonde-jokes",
        "id": "6190",
        "punchline": "Why is a blonde like a railway track?\nShe gets laid all over the country."
    },
    "274": {
        "category": "funny-blonde-jokes",
        "id": "27416",
        "punchline": "Blonde tells Dr Anant \"don't you think that you males are the root of problems ?Anant - ??????Blonde continued - menorrhagia, menarche, dysmenorrhoea, amenorrhoea! !! All have one thing in common MEN. Is there end to it???Anant replying with smile - After 40 you get a phase when men won't disturb ...Read Moreyou, when men-o-pause will come!!! Read Less"
    },
    "275": {
        "category": "funny-blonde-jokes",
        "id": "27039",
        "punchline": "ALWAYS TIREDA blonde goes to her doctor Anant complaining that she isexhausted all the time. After the diagnostic tests showed nothing, the Anant gets around to asking her how often she has intercourse. \"Every Monday, Wednesday, and Saturday,\" she says. The doctor advises her to cut out Wednesday. \"...Read MoreI can't,\" says the woman. \"That's the only night I'm home with my husband!\" Read Less"
    },
    "276": {
        "category": "funny-blonde-jokes",
        "id": "6871",
        "punchline": "Why did the blonde not talk during sex? Beacuse her mom told her not to talk to strangers"
    },
    "277": {
        "category": "funny-blonde-jokes",
        "id": "31317",
        "punchline": "A hot blonde woman is walking past a school with a pig in her hands A student yells \"How did you get that\"The pig yells back \"I won her in a raffle\" "
    },
    "278": {
        "category": "funny-blonde-jokes",
        "id": "28108",
        "punchline": "Two blondes where driving to Disneyland they pasted a sign that said Disneyland Left, and they went home crying."
    },
    "279": {
        "category": "funny-blonde-jokes",
        "id": "35437",
        "punchline": "A blonde walks into a hospital and says doctor I have pain all over my body. When I press my knee it hurts when I press my arm it hurts, anywhere I press I'm in pain. The doctor says you have hurt your finger and walks off"
    },
    "280": {
        "category": "funny-blonde-jokes",
        "id": "31687",
        "punchline": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\""
    },
    "281": {
        "category": "funny-blonde-jokes",
        "id": "5833",
        "punchline": "how do you keep a blonde busy for 7 hours.\n\n\nput her in a round room and tell her to sit in the corner."
    },
    "282": {
        "category": "funny-blonde-jokes",
        "id": "8281",
        "punchline": "How many Blondes does it take to screw in a light bulb?-1,0001 to hold the light bulb, and 999 to turn the house around."
    },
    "283": {
        "category": "funny-blonde-jokes",
        "id": "30631",
        "punchline": "How do you make a blond laugh on saturday?Tell her a joke on wensday."
    },
    "284": {
        "category": "funny-blonde-jokes",
        "id": "38556",
        "punchline": "There was a blonde and a brunette falling off a roof, which lands first?The brunette, the blonde has to ask for directions."
    },
    "285": {
        "category": "funny-blonde-jokes",
        "id": "737",
        "punchline": "A blonde was nervous that her husband was cheating on her. So she went to the store and bought a gun. She walks to her house and sees her husband in bed with a redhead. The blond holds the gun up to her head threatening to shoot herself. The husband gets out of bed and pleads for her not to shoot ...Read Moreherself. The blonde yells, \"Shut the hell up! Your next!\" Read Less"
    },
    "286": {
        "category": "funny-blonde-jokes",
        "id": "1420",
        "punchline": "A blonde with two red ears went to her doctor. The doctor asked her what had had happened to her ears?\n\"I was ironing a shirt and the phone rang - but instead of picking up the phone I accidentally picked up the iron and stuck it to my ear.\"\n\"Oh Dear!\" the doctor exclaimed in disbelief. \"But, what ...Read Morehappened to your other ear?\"\n\"The son-of-a-bitch called back.\" Read Less"
    },
    "287": {
        "category": "funny-blonde-jokes",
        "id": "6527",
        "punchline": "A man shouts out to a blonde on the other side of a river and says \" How did you get to the other side?\"The blonde replies by saying \"You are on the other side\""
    },
    "288": {
        "category": "funny-blonde-jokes",
        "id": "27114",
        "punchline": "Anant seduces virgin blonde. He takes her to his home.While enjoying sex. Suddenly she runs straight to the bathroom Anant goes and knocks on the door, \"Are you okay ??\"No answer, so he opens the door and there sits blonde with her panties around her ankles, legs spread, and her head stuck between ...Read Moreher legs looking at herself.\"What is it ??? What's wrong?\" asks Anant.\"It was 10 inches long when it went in... and 5 when it came out.I am trying to find the other half !!!\" Read Less"
    },
    "289": {
        "category": "funny-blonde-jokes",
        "id": "32625",
        "punchline": "Three blondes were walking in a forest, where they came across some tracks.\"Oh look, deer tracks!\" says one of the blondes.\"You dummy, those are moose tracks!\" the second one says.\"No, she was right, they're deer tracks!\" the third one yells.The three blondes were still arguing about it when the train hit them."
    },
    "290": {
        "category": "funny-blonde-jokes",
        "id": "3493",
        "punchline": "A brunette, a blonde, and a redhead were standing in a line before a firing squad. The commander says, \"READY, AIM\" and the brunette yells \"TORNADO!\" All the people turned around and looked and the brunette ran away. \n     Next, it's the redhead's turn. The commander says, \"READY, AIM\" and the ...Read Moreredhead yells \"HURRICANE!\" Once again all the people turn around to look for the hurricane and the redhead runs away.\n     Finally, it's the blonde's turn. The commander says, \"READY, AIM\" and the blonde yells \"FIRE!\" and gets shot. Read Less"
    },
    "291": {
        "category": "funny-blonde-jokes",
        "id": "4918",
        "punchline": "There was a brunette and a blonde speeding in a car.  Brunette tells the blonde to watch out for the cops. Brunette says \" You see  any police lights\". Blonde responds \"Yes, no, yes, no, yes,no,yes.\""
    },
    "292": {
        "category": "funny-blonde-jokes",
        "id": "14576",
        "punchline": "Q: Why did the blonde have trouble in the ladies' room?A: She is not used to pulling her own pants down."
    },
    "293": {
        "category": "funny-blonde-jokes",
        "id": "15297",
        "punchline": "A blonde female cop pulls over another female blonde.The cop say \"Can i have you're license mam?\". The blonde looks in her purse for 2 minutes and gets mad and says \" What does it look like?\"The cop says \"Its square with you're face on it.\". The blonde keeps looking. She finds a square mirror and ...Read Morelooks in it, and her reflection is there. She hands it to the cop.The cop looks and says \"Oh i didn't realize you were a cop.\". Read Less"
    },
    "294": {
        "category": "funny-blonde-jokes",
        "id": "23851",
        "punchline": "What dis the blonde say while having sex?Nothing, her mother told her not to talk to strangers."
    },
    "295": {
        "category": "funny-blonde-jokes",
        "id": "6065",
        "punchline": "Q: Why did the blonde climb on to the roof?\nA: Someone told her the drinks were on the house."
    },
    "296": {
        "category": "funny-blonde-jokes",
        "id": "33727",
        "punchline": "Brunette: \"where are you from?\"Blonde: \"California\"Brunette: \"what part?\"Blonde: \"all of me\""
    },
    "297": {
        "category": "funny-blonde-jokes",
        "id": "43017",
        "punchline": "Blonde: *calling the doctor surgery*Doctor: Dr. Raymond speaking, how may I help you?Blonde: I'm going to have to cancel my 2 o' clock appointment I am afraid.Doctor: Oh, why is that?Blonde: I don't feel well."
    },
    "298": {
        "category": "funny-blonde-jokes",
        "id": "114",
        "punchline": "A blonde watching the news hears that 2 Brazilian men died in a skydiving accident. She cries and says, \"Oh my god, how many is a brazilian?\""
    },
    "299": {
        "category": "funny-blonde-jokes",
        "id": "21180",
        "punchline": "One day a redhead mom walks into her daughter's room and finds a cigerret and says, \"omg I didn't know my daughter smoked!\" Then a burnette mom walks into her daughter's room and finds a beer bottle and says' \"I didn't know my daughter drank!\" Then a blonde mom walks into her daughter's room and ...Read Morefinds a condom and yells, \"I didn't know my daughter had a dick\"! Read Less"
    },
    "300": {
        "category": "funny-blonde-jokes",
        "id": "26758",
        "punchline": "Anant to Blonde :- Dear, u r not wearing panty today?Blonde:- Yes sir, u r great.. hw did u know that?Anant:- i can see dandruff on ur shoes.."
    },
    "301": {
        "category": "funny-blonde-jokes",
        "id": "26617",
        "punchline": "Blonde says to Anant \" My boyfriend has dumped me. Why the hell guys want to marry virgins?\"Anant \"to avoid comparison\""
    },
    "302": {
        "category": "funny-blonde-jokes",
        "id": "5507",
        "punchline": "One day a blonde, brunette, and redhead were stuck on an island 100 miles away from civilization. The only way to get home was to swim. The brunette swam 50 miles before drowning. The redhead swam 64 miles before getting attacked by a shark. The blonde went 99 miles but got tried a swam back to the island."
    },
    "303": {
        "category": "funny-blonde-jokes",
        "id": "23906",
        "punchline": "After robbing a bank, a blond, a brunette, and a redhead duck into an alley where they hide in potato sacks. The cops first go to the sack with the brunette in it and kick it. The brunette says, \"Meow.\" They go to the sack with the redhead and kick it. She says, \"Woof, woof.\" Last, they kick the ...Read Moresack with the blond, and she says, \"Po-ta-to.\" Read Less"
    },
    "304": {
        "category": "funny-blonde-jokes",
        "id": "34976",
        "punchline": "A blond and a brunette were walking past a flower shop. The brunette looked inside and said, \"Oh shit! He's in there!\" \"Who's in there?\", the blond asked. \"My boyfriend.\", came the reply. \"Well, what's he doing?\" the blond inquired. \"He's buying flowers.\" answered the brunette. \"What's the matter ...Read Morewith you, ...don't you like to get flowers?\" \"Of course I do, but therein lies the problem.\" \"What problem?\" the blond asked innocently. \"For the next three days, I'll be laying on my back, with my feet in the air!\" the brunette explained. After the blond thought about what her friend had just said, she offered, \"What's the matter, don't you have a vase?\" Read Less"
    },
    "305": {
        "category": "funny-blonde-jokes",
        "id": "43470",
        "punchline": "Two people are texting. One is called Stacy who is blonde and the other is called Rachel who is a brunette.Rachel: Hey sorry I lost my phone I can't text right now.Stacy: Well can you PLEASE find it I really want to text you... you are my best friend!!!Rachel: You're an idiot.Stacy: Umm I'm not ...Read Morethe one who lost my phone can you just text me when you find it?Rachel: You're such a blonde. Read my first text again.Stacy: IK !!! FIND YOUR PHONE !!! Read Less"
    },
    "306": {
        "category": "funny-blonde-jokes",
        "id": "5760",
        "punchline": "How did the blond break her arm raking leaves?\nShe fell out of the tree."
    },
    "307": {
        "category": "funny-blonde-jokes",
        "id": "11996",
        "punchline": "So a blonde walks into a library, and says to the librarian loudly \"May I have a cheeseburger and fries?\" The librarian says \"This is a library!\" Blonde whispers \"Oh, may I have a cheeseburger and fries.\""
    },
    "308": {
        "category": "funny-blonde-jokes",
        "id": "23687",
        "punchline": "A blonde went fishing and there was a hole in her boat where water was leaking through. To fix it she made another hole in the boat to drain the water. "
    },
    "309": {
        "category": "funny-blonde-jokes",
        "id": "26570",
        "punchline": "Anna's English translation:Yes = NoNo = YesMaybe = NoI'm sorry = You'll be sorryWe need = I wantIt's your decision = The correct decision should be obvious by now.Do what you want = You'll pay for this later.We need to talk = I need to complain.Sure go ahead = I don't want you to.I'm not upset = Of ...Read Morecourse I'm upset, you moron! Read Less"
    },
    "310": {
        "category": "funny-blonde-jokes",
        "id": "27069",
        "punchline": "Anna turns to old captain and says, ‘When was the last time you made love to a woman?’Captain thinks for a moment then says, ‘1947.’ ‘Good heavens,’ says Anna. ‘That’s a very long time ago.’ Captain \"Not exactly. It's just 2130 now\""
    },
    "311": {
        "category": "funny-blonde-jokes",
        "id": "30784",
        "punchline": "How do you make a blonde that is holding on to a tree with one hand fall out?Wave."
    },
    "312": {
        "category": "funny-blonde-jokes",
        "id": "2073",
        "punchline": "2 cops were chasing 3 girls by a barn. A brunette, blonde, and red head. The brunette jumped in with the cows, the red jumped in with the pigs, and the blonde jumped behind a sack of potatoes. \n\nThe cops went to the cows and said hello, any body in there? The brunette went, moo! moo! \n\nThen the ...Read Morecops went over to the pigs and said, hello any body in there? The red went oink oink oink! \n\nThen they went over by the sack of potatoes and they said, hello any body over there? The blonde went potato potato potato! Read Less"
    },
    "313": {
        "category": "funny-blonde-jokes",
        "id": "40322",
        "punchline": "There was a red head a brunette and the dumb blonde reading a book about this cliff that if you jumped off of it you'd turn into anything you wanted. So the red head goes first and jumps and says \"Eagle\" So she turns into an eagle, The brunette jumps and says \"Falcon\" So she turns into a falcon, ...Read MoreThe dumb blonde trips on a rock and falls and says shit, Guess what happens? She falls and turns into shit. :3 Read Less"
    },
    "314": {
        "category": "funny-blonde-jokes",
        "id": "691",
        "punchline": "Blonde - What does IDK mean?\nMe - I don't know\nBlonde - OMG no one knows what it means!"
    },
    "315": {
        "category": "funny-blonde-jokes",
        "id": "39848",
        "punchline": "I used to have a best friend that was a blonde. One day we were talking about a cute guy that was really annoying at times and really cute the other times. We pretended to date so that I would be able to avoid her. After the date I told her that he wasn't my boyfriend. She asks \"So what is he?\". I ...Read Moresay \"Let's just say he's the opposite of 'my boyfriend.\" Then she says \"So he's your girlfriend?\" Read Less"
    },
    "316": {
        "category": "funny-blonde-jokes",
        "id": "1552",
        "punchline": "One day 2 blondes decided to drive to Disney Land. When they saw a sign that said 'Disney Land left' they turned around and went home.\n"
    },
    "317": {
        "category": "funny-blonde-jokes",
        "id": "40189",
        "punchline": "I wish this was a joke but it's what happened at my work 30 min ago so i had to share, a new Blonde girl that we hired to park customers cars was given the task or moving a Prius that was blocking the way, the car was still on mind you. I see her sit in the car and few taps on the brake and about 2 ...Read Moremin later the car is still there as she exits the car and walks into the office to tell me the car isn't turning on something is definitely wrong with the car, i said okay lets go look at it, i sit in the driver seat and she in the passenger. I asked her what the problem was and she replied it's not turning on, i didn't want to make her feel bad so i said don't tell anyone but the car is already on. Read Less"
    },
    "318": {
        "category": "funny-blonde-jokes",
        "id": "4921",
        "punchline": "There are three blondes on an island. A genie says they can only have one wish t get themselfs off. The first says\" I wish I was smart\" so she turns into a red head and swims off the island. The second says \" I wish I was smarter than her\" so she turns into a brunette and swims away. The third one ...Read Moresays \" I wish I was smarter than both of them\" so she turns into a man and walks on the bridge. Read Less"
    },
    "319": {
        "category": "funny-blonde-jokes",
        "id": "5642",
        "punchline": "Boy1: A blonde and brunette are on the top of a building. Who falls off first?\nBoy2: The blonde?\nBoy1: No, she has to ask for directions on how."
    },
    "320": {
        "category": "funny-blonde-jokes",
        "id": "668",
        "punchline": "A blonde arrived for her first golf lesson and the pro asked her to take a swing at a ball to see how shed do. The blonde did so and competely duffed the shot. The pro said \"Your swing is good but youre gripping the club too hard - grip the club gently as you would your husbands penis.\" The blonde ...Read Moretook another shot and nailed the ball 275 yards straight down the fairway. The pro said \"That was excellent! Lets try it again only this time take the club out of your mouth.\" Read Less"
    },
    "321": {
        "category": "funny-blonde-jokes",
        "id": "1399",
        "punchline": "A trucker stops at a red light and a blonde catches up to him. She knocks on the window and says, \"Hi, my name is Heather and you are losing some of your load. \"\nThe trucker just ignores her, the light changes, and he proceeds down the street. At the next light, the blonde again catches up and says,...Read More \"Hi, my name is Heather, and you are losing some of your load. \"\nHe ignores her again and continues down the street. At the next red light the blonde catches up, all out of breath, knocks on the window and says, \"Hi, my name is Heather and you are losing some of your load. \"\nThe trucker looks at her and finally he says, \"Hi, my name is Kevin, it's snowing, and I'm driving a salt truck. \" Read Less"
    },
    "322": {
        "category": "funny-blonde-jokes",
        "id": "4232",
        "punchline": "Q: What's the difference between a blonde and a toothbrush?\n\nA: You don't share a toothbrush with your friends."
    },
    "323": {
        "category": "funny-blonde-jokes",
        "id": "5569",
        "punchline": "a blonde a brunette and a red head are getting chased by the police and they hide in the farm.the brunette hides behind a sheep.the red head hides behind a cow .the blond hides behind  a sack of potatoes.the cop comes in to where the brunette is ,\"is anyone in here?\".she says bahhh .\"he then goes ...Read Morein where the red head and says\"is anyone in here?,\"moo\".the cop goes into where the blond is and says \"is any one in here?\" The blonde says \"potatoes\" Read Less"
    },
    "324": {
        "category": "funny-blonde-jokes",
        "id": "27378",
        "punchline": "On 60th birthday of salma in Lahore Pakistan. Everyone was admired her.In goodwill speech rednecks told \" Salma is a complete woman.Friends later asked about it.He says\" she adores Anant which was her platonic love. She is thankful to alim who married her. She don't forget aslam with whom she had ...Read Morefirst sex. She is excited about abdul who was her long time lover. She also praises wajid for children she had in her life. And she also craves for sex with biber in her dreams.Isn't she a complete woman. Read Less"
    },
    "325": {
        "category": "funny-blonde-jokes",
        "id": "27177",
        "punchline": "Anna and blonde arguing.....Which is the best contraceptive?- Blonde - An aspirinAnna - ???Blonde - Take an aspirin, put it between the knees and keep it tight"
    },
    "326": {
        "category": "funny-blonde-jokes",
        "id": "116",
        "punchline": "How do you make a blonde laugh on Saturday? \nTell her a joke on Wednesday."
    },
    "327": {
        "category": "funny-blonde-jokes",
        "id": "33549",
        "punchline": "Blonde girl goes and signs up at a gym to work out, as she's walking around to see where she wants to start a trainer walks up to her and tells her if this is your first time working out i have to tell you that for the 1st week your body will feel very sore. The girls says, well thanx for the tip ...Read Moreill just go home and start next week then Read Less"
    },
    "328": {
        "category": "funny-blonde-jokes",
        "id": "1826",
        "punchline": "A blonde bought two horses, and could never remember which was which. A neighbor suggested that she cut the tail of one horse and that worked great until the other horse got his tail caught in a bush. It tore just right and looked exactly like the other horse's tail and our friend was stuck again. ...Read MoreThe neighbor suggested she notch the ear off one horse. That worked fine until the other horse caught his ear on a barbed wire fence. Once again our friend couldn't tell them apart. The neighbor suggested she measure the horses for height. When she did, she was very pleased to find that the white horse was 2 inches taller than the black. Read Less"
    },
    "329": {
        "category": "funny-blonde-jokes",
        "id": "27006",
        "punchline": "Anna had a night out on the town with her friends. She awoke the next morning, totally naked and with a monster of a hang-over, so she rang for the butler and asked for a cup of strong black coffee.\"Jeeves\" she said, \"I can't remember a thing about last night. How did I get to bed?\" \"Well, Madam, I ...Read Morecarried you upstairs and put you to bed\" \"But my dress?\" \"It seemed a pity to crumple it, so I took it off and hung it up\" \"But what about my underwear?\" \"I thought the elastic might stop the circulation, so I took the liberty of removing them\". \"What a night!\" she said. \"I must have been tight!\" \"Only the first time, Madam.\" Read Less"
    },
    "330": {
        "category": "funny-blonde-jokes",
        "id": "30875",
        "punchline": "Blondes have more fun but brunettes remember it the next day! ;) ?"
    },
    "331": {
        "category": "funny-blonde-jokes",
        "id": "10022",
        "punchline": "what do you call a blonde with pig tails?... a blowjob with handle bars!"
    },
    "332": {
        "category": "funny-blonde-jokes",
        "id": "3489",
        "punchline": "A blonde comes home from a day of shopping and discovers that her house is on fire, so she calls the fire department on her cell phone. \n\"Please state the nature of your emergency,\" says the operator.\n\"Help! My house is on fire!\" the blonde replies.\n\"Okay, where do you live?\"\n\"In a house you silly ...Read Morebilly!\" the blonde replies.\n\"No,no! How do we get there?\" the operator asks frustratedly.\n\"Duh! Big Red Truck!!\" Read Less"
    },
    "333": {
        "category": "funny-blonde-jokes",
        "id": "5364",
        "punchline": "A blonde, a red head, and a brunette were on a plane.The red head takes a bite of an apple doesn't like it she throws it out the window. The brunette takes a bite out of an orange doesn't like it she throws it out the window. The blonde takes a bit of a bomb doesn't like it she throws it out the ...Read Morewindow. They get out of the plane. They come up to a little boy asks why he is crying! he says \"An apple fell on my dog and killed my dog.\" They keep walking and come up to a little girl and asks why she is crying. She says\" An orange fell on my cat and killed my cat.\" They keep walking. They come up to a blonde laughing her head off. \"Why are you laughing so hard?\" they said. \"When I farted the building blew up!\" Read Less"
    },
    "334": {
        "category": "funny-blonde-jokes",
        "id": "5596",
        "punchline": "A surgeon went to check on his patient -- a pretty blonde -- after an operation. \"You'll be fine,\" he said after checking her out.\n\"Doctor? I have kind of a personal question,\" she said.\n\n\"Certainly -- doctors are trained to be discreet. What's your question?\"\n\n\"Well,\" she asked, \"How long will it ...Read Morebe before I am able to have a normal sex life again?\"\n\nThe surgeon seemed to pause, which alarmed the girl.\n\n\"What's the matter, Doctor? I will be all right, won't I?\"\n\n\"Well yes, you'll be fine!\" he replied. \"It's just that no one has ever asked me that after having their tonsils out.\" Read Less"
    },
    "335": {
        "category": "funny-blonde-jokes",
        "id": "8542",
        "punchline": "How do you confuse a blonde?You don't! They're born that way."
    },
    "336": {
        "category": "funny-blonde-jokes",
        "id": "26757",
        "punchline": "Blonde goes to chemist Anant.\"Give me medicine which will make penis limp for one month. And give me contraceptive medicine for one month.Anant puzzled \"will give you medicine. But tell me reason\"Blonde \" I will be in Europe trip for one month \""
    },
    "337": {
        "category": "funny-blonde-jokes",
        "id": "36145",
        "punchline": "A blonde a red head and a brunet rob a bank and are running away from the cops. They are cornered in an ally way and hide in potato bags and the police check the bags by kicking them. They kick the 1st bag with the brunet and she says \"meow\" and the cops thought it was a cat. Then they kick the 2nd ...Read Morebag and the red head says \"woof, woof\" and the cops think it's just a dog. Then they kick the last bag and the blonde says \" Potato, Potato.\" Read Less"
    },
    "338": {
        "category": "funny-blonde-jokes",
        "id": "1390",
        "punchline": "how can u tell when a blonde is trying to commite suicide\ntheres 6 bullet holes in the mirror"
    },
    "339": {
        "category": "funny-blonde-jokes",
        "id": "10027",
        "punchline": "why did chevy invent horns in there early days ? so blondes would have something to blow in traffic jams!"
    },
    "340": {
        "category": "funny-blonde-jokes",
        "id": "14365",
        "punchline": "What are the blonde's first words after 4 years of college?\"Would you like fries with that?\""
    },
    "341": {
        "category": "funny-blonde-jokes",
        "id": "18904",
        "punchline": "How is Santa Claus like a smart blonde? They both don't exist"
    },
    "342": {
        "category": "funny-blonde-jokes",
        "id": "354",
        "punchline": "What do UFO's and smart blondes have in common?\nYou hear about them all the time, but you never see one."
    },
    "343": {
        "category": "funny-blonde-jokes",
        "id": "355",
        "punchline": "What do you call a blonde with two brain cells?\nPregnant"
    },
    "344": {
        "category": "funny-blonde-jokes",
        "id": "669",
        "punchline": "A blonde was driving home after work, and got caught in a really bad hailstorm. Her car was covered with dents, so the next day she took it to a repair shop. The shop owner saw that she was a blonde, so he decided to have some fun. He told her to just go home and blow into the tailpipe really hard, ...Read Moreand all the dents would pop out. So, the blonde went home, got down on her hands and knees and started blowing into her car's tailpipe.Nothing happened. She blew a little harder, and still nothing happened. Her roommate, another blonde, came home and said, \"What are you doing?\" The first blonde told her how the repairman had instructed her to blow into the tailpipe in order to get the dents to pop out. Her roommate rolled her eyes and said, \"HELLLLOOOO!!! You need to roll up the windows.\" Read Less"
    },
    "345": {
        "category": "funny-blonde-jokes",
        "id": "5456",
        "punchline": "Blonde Invention:\n Book on how to read"
    },
    "346": {
        "category": "funny-blonde-jokes",
        "id": "22552",
        "punchline": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging ...Read Moreand pleading with her not to shoot herself. Hysterically the blonde responds to the husband, ''Shut up...you're next!'' Read Less"
    },
    "347": {
        "category": "funny-blonde-jokes",
        "id": "40503",
        "punchline": "Brunette is walking down Main St with her blonde friend and she spots her boyfriend in the flower shop buying roses. The brunette says, “Oh great, I see my boyfriend buying me flowers again and that means in return I will have to spend a week on my back with my legs in the air”.Blonde says, “You ...Read Morepoor thing, don’t you have a vase”? Read Less"
    },
    "348": {
        "category": "funny-blonde-jokes",
        "id": "28849",
        "punchline": "what would you do if a blonde throws a grenade at you,pull the pin and throw it back.what if a blonde throws a pin at you,run because the grenade is in her mouth."
    },
    "349": {
        "category": "funny-blonde-jokes",
        "id": "2713",
        "punchline": "Me: If a blonde girl and brunette girl jumped off a cliff at the same time, who would hit the ground first?\nFriend: I don't know, who?\nMe: The brunnete, the blonde had to ask for directions."
    },
    "350": {
        "category": "funny-blonde-jokes",
        "id": "4670",
        "punchline": "There a ventriloquist telling blond joke . A blond comes storming up on stage and start says\"blonds can be smart to you know,and I'm smart, I should know.\" The ventriloquist says\" ok ok I'm sorry I won't do it again\" then the blond says \"you shut up and stay out of this cuz I'm talking to the jurk on your knee\""
    },
    "351": {
        "category": "funny-blonde-jokes",
        "id": "5506",
        "punchline": "One day a Blonde went the doctor with a burn on her stomach. The doctor gasped and asked what happened. the Blonde told the doctor she put a lighter against her stomach. the doctor asked her why in the world she would do that. the blond said \"I was trying to burn calories.\""
    },
    "352": {
        "category": "funny-blonde-jokes",
        "id": "23190",
        "punchline": "Me: how many blondes did it take to screw in a lightbulb?Friend: how many?Me: 1001, 1 to hold the lightbulb in, and the rest turn the house"
    },
    "353": {
        "category": "funny-blonde-jokes",
        "id": "38732",
        "punchline": "A guy driving his car asks his blonde girlfriend to stick her head out of the window and check to see if the blinkers are working, she sticks her head out and tells the boyfriend to go ahead I'm looking at them. He then replies okay honey are they working or not? She replies back--yes,no,yes,no,yes,no,yes,no,yes,no,yes,no"
    },
    "354": {
        "category": "funny-blonde-jokes",
        "id": "6119",
        "punchline": "Three blondes were walking through a forest when they came upon a set of tracks. The first blonde looked down at the tracks and said, \"I think these are bird tracks.\" The second blonde looked at them and said, \"No, these are deer tracks.\" The third blonde looked down, and BOOM!!! she gets run over by a train."
    },
    "355": {
        "category": "funny-blonde-jokes",
        "id": "38282",
        "punchline": "À brunette was walking along the creek and saw a blonde across the creek. She asked her how did you get on the other side. The blonde looked at her surroundings and replied you are on the other side. "
    },
    "356": {
        "category": "funny-blonde-jokes",
        "id": "1558",
        "punchline": "Doctor - \"Your pregnant\"\nBlonde - \"Is it mine?\""
    },
    "357": {
        "category": "funny-blonde-jokes",
        "id": "5908",
        "punchline": "Why was the blonde staring at the Orange Juice? Because it said concentrate!"
    },
    "358": {
        "category": "funny-blonde-jokes",
        "id": "19618",
        "punchline": "There was a red haired, a blue haired and blonde stuck on an island. The smart red haired guessed that it was 20 kilometres from where they were and to the city. The red haired swam 5 kilometres before getting tired then swam 5 more but was too tired so she drowned. The blue haired swam 10 ...Read Morekilometres before getting tired then 5 more but was too tired so she drowned. The blonde wondered if they made it so she swam 15 kilometres before getting tired then she said \" I'm too tired\" and swam back. Read Less"
    },
    "359": {
        "category": "funny-blonde-jokes",
        "id": "19252",
        "punchline": "wanna know how to confuse a blonde? put her in a round room and tell her to sit in a corner."
    },
    "360": {
        "category": "funny-blonde-jokes",
        "id": "28492",
        "punchline": "How do you keep a blonde in suspense?I'll tell u tomorrow "
    },
    "361": {
        "category": "funny-blonde-jokes",
        "id": "18904",
        "punchline": "How is Santa Claus like a smart blonde? They both don't exist"
    },
    "362": {
        "category": "funny-blonde-jokes",
        "id": "354",
        "punchline": "What do UFO's and smart blondes have in common?\nYou hear about them all the time, but you never see one."
    },
    "363": {
        "category": "funny-blonde-jokes",
        "id": "355",
        "punchline": "What do you call a blonde with two brain cells?\nPregnant"
    },
    "364": {
        "category": "funny-blonde-jokes",
        "id": "669",
        "punchline": "A blonde was driving home after work, and got caught in a really bad hailstorm. Her car was covered with dents, so the next day she took it to a repair shop. The shop owner saw that she was a blonde, so he decided to have some fun. He told her to just go home and blow into the tailpipe really hard, ...Read Moreand all the dents would pop out. So, the blonde went home, got down on her hands and knees and started blowing into her car's tailpipe.Nothing happened. She blew a little harder, and still nothing happened. Her roommate, another blonde, came home and said, \"What are you doing?\" The first blonde told her how the repairman had instructed her to blow into the tailpipe in order to get the dents to pop out. Her roommate rolled her eyes and said, \"HELLLLOOOO!!! You need to roll up the windows.\" Read Less"
    },
    "365": {
        "category": "funny-blonde-jokes",
        "id": "5456",
        "punchline": "Blonde Invention:\n Book on how to read"
    },
    "366": {
        "category": "funny-blonde-jokes",
        "id": "22552",
        "punchline": "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging ...Read Moreand pleading with her not to shoot herself. Hysterically the blonde responds to the husband, ''Shut up...you're next!'' Read Less"
    },
    "367": {
        "category": "funny-blonde-jokes",
        "id": "40503",
        "punchline": "Brunette is walking down Main St with her blonde friend and she spots her boyfriend in the flower shop buying roses. The brunette says, “Oh great, I see my boyfriend buying me flowers again and that means in return I will have to spend a week on my back with my legs in the air”.Blonde says, “You ...Read Morepoor thing, don’t you have a vase”? Read Less"
    },
    "368": {
        "category": "funny-blonde-jokes",
        "id": "28849",
        "punchline": "what would you do if a blonde throws a grenade at you,pull the pin and throw it back.what if a blonde throws a pin at you,run because the grenade is in her mouth."
    },
    "369": {
        "category": "funny-blonde-jokes",
        "id": "2713",
        "punchline": "Me: If a blonde girl and brunette girl jumped off a cliff at the same time, who would hit the ground first?\nFriend: I don't know, who?\nMe: The brunnete, the blonde had to ask for directions."
    },
    "370": {
        "category": "funny-blonde-jokes",
        "id": "4670",
        "punchline": "There a ventriloquist telling blond joke . A blond comes storming up on stage and start says\"blonds can be smart to you know,and I'm smart, I should know.\" The ventriloquist says\" ok ok I'm sorry I won't do it again\" then the blond says \"you shut up and stay out of this cuz I'm talking to the jurk on your knee\""
    },
    "371": {
        "category": "funny-blonde-jokes",
        "id": "5506",
        "punchline": "One day a Blonde went the doctor with a burn on her stomach. The doctor gasped and asked what happened. the Blonde told the doctor she put a lighter against her stomach. the doctor asked her why in the world she would do that. the blond said \"I was trying to burn calories.\""
    },
    "372": {
        "category": "funny-blonde-jokes",
        "id": "23190",
        "punchline": "Me: how many blondes did it take to screw in a lightbulb?Friend: how many?Me: 1001, 1 to hold the lightbulb in, and the rest turn the house"
    },
    "373": {
        "category": "funny-blonde-jokes",
        "id": "38732",
        "punchline": "A guy driving his car asks his blonde girlfriend to stick her head out of the window and check to see if the blinkers are working, she sticks her head out and tells the boyfriend to go ahead I'm looking at them. He then replies okay honey are they working or not? She replies back--yes,no,yes,no,yes,no,yes,no,yes,no,yes,no"
    },
    "374": {
        "category": "funny-blonde-jokes",
        "id": "6119",
        "punchline": "Three blondes were walking through a forest when they came upon a set of tracks. The first blonde looked down at the tracks and said, \"I think these are bird tracks.\" The second blonde looked at them and said, \"No, these are deer tracks.\" The third blonde looked down, and BOOM!!! she gets run over by a train."
    },
    "375": {
        "category": "funny-blonde-jokes",
        "id": "38282",
        "punchline": "À brunette was walking along the creek and saw a blonde across the creek. She asked her how did you get on the other side. The blonde looked at her surroundings and replied you are on the other side. "
    },
    "376": {
        "category": "funny-blonde-jokes",
        "id": "1558",
        "punchline": "Doctor - \"Your pregnant\"\nBlonde - \"Is it mine?\""
    },
    "377": {
        "category": "funny-blonde-jokes",
        "id": "5908",
        "punchline": "Why was the blonde staring at the Orange Juice? Because it said concentrate!"
    },
    "378": {
        "category": "funny-blonde-jokes",
        "id": "19618",
        "punchline": "There was a red haired, a blue haired and blonde stuck on an island. The smart red haired guessed that it was 20 kilometres from where they were and to the city. The red haired swam 5 kilometres before getting tired then swam 5 more but was too tired so she drowned. The blue haired swam 10 ...Read Morekilometres before getting tired then 5 more but was too tired so she drowned. The blonde wondered if they made it so she swam 15 kilometres before getting tired then she said \" I'm too tired\" and swam back. Read Less"
    },
    "379": {
        "category": "funny-blonde-jokes",
        "id": "19252",
        "punchline": "wanna know how to confuse a blonde? put her in a round room and tell her to sit in a corner."
    },
    "380": {
        "category": "funny-blonde-jokes",
        "id": "28492",
        "punchline": "How do you keep a blonde in suspense?I'll tell u tomorrow "
    },
    "381": {
        "category": "funny-blonde-jokes",
        "id": "28960",
        "punchline": "blonde calls me on her phone ...blonde: Hello whats your phone number?Me:(slams down he phone) "
    },
    "382": {
        "category": "funny-blonde-jokes",
        "id": "39959",
        "punchline": "A blonde couple went to adopt a child.Assistant:How can I help youCouple:We want to adopt a babyAssistant:Come and take a look. Couple:Ooohhh this chinese baby is cute but will come get it laterAssistant:why not now?Couple:First we'll have to learn how to speak Chinese. "
    },
    "383": {
        "category": "funny-blonde-jokes",
        "id": "688",
        "punchline": "How did the blonde break her arm while raking leaves?\nShe fell out of a tree.\n"
    },
    "384": {
        "category": "funny-blonde-jokes",
        "id": "5565",
        "punchline": "What does a blonde see when she looks into a box of cheerios? Donut Seeds."
    },
    "385": {
        "category": "funny-blonde-jokes",
        "id": "5684",
        "punchline": "What do you call three blondes on Christmas? \n       Ho,Ho,Ho"
    },
    "386": {
        "category": "funny-blonde-jokes",
        "id": "43113",
        "punchline": "For some reason when I close my eyes I cant f*cking see"
    },
    "387": {
        "category": "funny-blonde-jokes",
        "id": "5176",
        "punchline": "Why is it hard for a blonde to count to 70?\nBecause 69 is such a mouthful."
    },
    "388": {
        "category": "funny-blonde-jokes",
        "id": "18513",
        "punchline": "Q: What do you call a bunch of blondes in a freezer?A: Frosted flakes"
    },
    "389": {
        "category": "funny-blonde-jokes",
        "id": "34476",
        "punchline": "I was on a date with layla, a blonde girl from Essex, looking at the menu she points and says,\"oh i like the idea of this choice but it says fat free..i dont want any free fat!\""
    },
    "390": {
        "category": "funny-blonde-jokes",
        "id": "5145",
        "punchline": "How do you entertain a blonde?\ntell her to find a corner in a circle room"
    },
    "391": {
        "category": "funny-blonde-jokes",
        "id": "5170",
        "punchline": "Why do blondes like blonde jokes?\n'Cause they make them feel famous!"
    },
    "392": {
        "category": "funny-blonde-jokes",
        "id": "5587",
        "punchline": "A blonde was walking down the road with a healthy looking pig under her arm. As she passed the bus stop, someone asked, \"Where did you get that?\" \n\nThe pig replied, \"I won her in a raffle!\""
    },
    "393": {
        "category": "funny-blonde-jokes",
        "id": "45637",
        "punchline": "Two blondes are walking in the park and come up on a set of tracksOne blonde says I think these are bear tracks, the other blonde argues they are deer tracksThey were still arguing when the train hit them."
    },
    "394": {
        "category": "funny-blonde-jokes",
        "id": "3579",
        "punchline": "q : What do you call a blonde sitting in the back of your 6th grade class?\nA : your 25 year old mom."
    },
    "395": {
        "category": "funny-blonde-jokes",
        "id": "40501",
        "punchline": "A blonde walks into a bar and sees her friend sitting there with a drink in her hand and looking very sad.She walks over and sits down to ask what is wrong and to see if can she help.Her friend says, \" I feel awful, I went out last night got drunk and wound up sleeping with a Brazilian.\"The blonde ...Read Moresays, \"OMG, wow. How many is that\"? Read Less"
    },
    "396": {
        "category": "funny-blonde-jokes",
        "id": "1397",
        "punchline": "A police officer pulls over a car with a young blonde driver in it....\nCop : \"Miss, this is a 65 MPH highway, why are you going so slowly?\"\nBlonde : \"Officer, I saw a lot of signs saying 22, not 65.\"\nCop : \"Oh miss, that's not the speed limit, that's the name of the highway you're on!\" \nBlonde : \"...Read MoreOh! Stupid me! Thanks for letting me know, Ill be more careful from now on.\" At this point the cop looks into the back seat of the car, where the passengers are shaking and white as ghosts. \nCop : \"Excuse me miss, what's wrong with your friends back there? They're shaking something awful.\" \nBlonde : \"Oh... We just got off of highway 119\". Read Less"
    },
    "397": {
        "category": "funny-blonde-jokes",
        "id": "6937",
        "punchline": "Me: hey can you see if my left indicator is working or not?Blonde : yes... no... yes.. no... yes.... no... "
    },
    "398": {
        "category": "funny-blonde-jokes",
        "id": "40100",
        "punchline": "A blonde has a baby and says I wish I knew who the mother is."
    },
    "399": {
        "category": "funny-blonde-jokes",
        "id": "2785",
        "punchline": "A brunnette and a red haid were riding in the front of a pickup truck the blonde was in the back. The truck crashed into the lake and the redhead and the brunnette made it to shore quickly but it took the blonde ten min.  They asked when she got there, \"What took so long\"? The blonde replied, \" I ...Read Morehad to get the tailgate open\". Read Less"
    },
    "400": {
        "category": "funny-blonde-jokes",
        "id": "23819",
        "punchline": " to drown a blonde.....put a scratch and sniff sticker at the bottom of a pool"
    },
    "401": {
        "category": "funny-blonde-jokes",
        "id": "3973",
        "punchline": "What are 10 blonde's standing ear to ear.\nA wind tunnel."
    },
    "402": {
        "category": "funny-blonde-jokes",
        "id": "6822",
        "punchline": "How can you tell if a blonde's been in your car?The gear sticks wet."
    },
    "403": {
        "category": "funny-blonde-jokes",
        "id": "119",
        "punchline": "Why was the blonde so excited when she finished her jigsaw puzzle in 6 months?\nBecause on the box it said 2-4 years."
    },
    "404": {
        "category": "funny-blonde-jokes",
        "id": "1924",
        "punchline": "A blonde calls a pizza place to have one ordered to her house. They ask her if she wants the pizza cut into 6 or 12 pieces and she says, \"Cut it into 6, I could never eat 12 pieces.\""
    },
    "405": {
        "category": "funny-blonde-jokes",
        "id": "4266",
        "punchline": "Thers a Blonde at a computer trying to play a game and it says \"press any key to begin\" and shes looking at the computer trying to find the any key"
    },
    "406": {
        "category": "funny-blonde-jokes",
        "id": "5171",
        "punchline": "How do you know if a blonde has been playing with your Xbox 360?\nThe joystick is wet."
    },
    "407": {
        "category": "funny-blonde-jokes",
        "id": "5931",
        "punchline": "A blonde walks into a doctor’s office and says, “Doc, I’m horribly sick!”\nThe doctor looks at her and asks, “Flu?”\n“No, I drove here.”"
    },
    "408": {
        "category": "funny-blonde-jokes",
        "id": "5763",
        "punchline": "Why did the one-handed blonde cross the road???\n\n\nBacause she wanted to go to the second hand shop..."
    },
    "409": {
        "category": "funny-blonde-jokes",
        "id": "6698",
        "punchline": "How do you know when a blonde's been sending e-mail? Envelopes in the disk drive."
    },
    "410": {
        "category": "funny-blonde-jokes",
        "id": "6996",
        "punchline": "want to know how to drown a blond?throw a scatch and sniff sticker at the bottom of a pool"
    },
    "411": {
        "category": "funny-blonde-jokes",
        "id": "29044",
        "punchline": "How do you keep a blonde bizy?Tell them to put skittles in alphabetical order."
    },
    "412": {
        "category": "funny-blonde-jokes",
        "id": "39485",
        "punchline": "Two blondes are driving down the road, the driver turns to the passengar and says can you tell me if my blinker is working.So the passengar sticks her head out the window and says yes,no,yes,no,yes,no,yes,no."
    },
    "413": {
        "category": "funny-blonde-jokes",
        "id": "43986",
        "punchline": "A blonde and her mother are walking around. The blonde starts falling over and bumping into everything.\"Lilly, what are you doing?\" The mother asks. She replies\"For some reason, when I close my eyes, I can't see anything!\"\"This is why I told your father we should've adopted an Asian\" The mother ...Read Moremumbles. Lilly falls over again. Read Less"
    },
    "414": {
        "category": "funny-blonde-jokes",
        "id": "353",
        "punchline": "What is a brunette between two blondes?\nAn interpreter."
    },
    "415": {
        "category": "funny-blonde-jokes",
        "id": "38634",
        "punchline": "so one day a black guy breaks into a blondes house and she says shadow when did you come to life?"
    },
    "416": {
        "category": "funny-blonde-jokes",
        "id": "349",
        "punchline": "What do you call a blonde with half a brain?\n Gifted!"
    },
    "417": {
        "category": "funny-blonde-jokes",
        "id": "115",
        "punchline": "How do you keep a blonde occupied for a few hours?\nTell her to count the stairs on the escalator."
    },
    "418": {
        "category": "funny-blonde-jokes",
        "id": "2347",
        "punchline": "Why did the blonde get fired from the M&M factory?\nShe kept throwing away all the W's!"
    },
    "419": {
        "category": "funny-blonde-jokes",
        "id": "4597",
        "punchline": "How many blonde does it take to change a lightbulb?\n\nA: 3. One to hold the lightbulb and two to turn the ladder."
    },
    "420": {
        "category": "funny-blonde-jokes",
        "id": "117",
        "punchline": "What's dumber than two brunettes trying to build a house under water?\nTwo blondes trying to burn it down."
    },
    "421": {
        "category": "funny-blonde-jokes",
        "id": "41724",
        "punchline": "why do blonde girls have bruises around their belly button cuz blonde guys aren't that smart either "
    },
    "422": {
        "category": "funny-blonde-jokes",
        "id": "118",
        "punchline": "A blonde texted me the other day and said, \"Hey what's your phone number?\""
    },
    "423": {
        "category": "funny-blonde-jokes",
        "id": "1494",
        "punchline": "A young brunette goes into the doctor's office and says that her body hurts wherever she touches it.\n\"Impossible,\" says the doctor. \"Show me.\"\nShe takes her finger and pushes her elbow and screams inagony. She pushes her knee and screams,pushes her ankle and screams and so on it goes.\nThe doctor ...Read Moresays, \"You're not really a brunette are you?\" \nShe says, \"No, I'm really a blonde.\" \n\"I thought so,\" he says. \"Your finger is broken Read Less"
    },
    "424": {
        "category": "funny-blonde-jokes",
        "id": "5303",
        "punchline": "Why does a blonde have an IQ 1 point higher than a policehorse?\nSo she won't shit on the street during a parade."
    },
    "425": {
        "category": "funny-blonde-jokes",
        "id": "27877",
        "punchline": "There is a blond a brenet and a red head they all go hunting and the first one that goes hunting is the brenet so she goes and comes back with a rabbit and the others ask \"how did you do that?!\" and she said I found tracks followed tracks and got the rabbit so the redhead says \"let me see that!\" ...Read Moreshe goes and she comes and the blond says \"how did you do that?!\" and she says found track followed tracks got the rabbit so the blond takes the gun and goes and comes back with no gun no rabbit with a broken arm eye ball poping out and they ask her what happened and she said found tracks got hit by a train Read Less"
    },
    "426": {
        "category": "funny-blonde-jokes",
        "id": "27827",
        "punchline": "The blonde Anna made her first appointment with a gynecologist and told him that she and her husband wished to start a family.\"We've been trying for months now, doctor, to get pregnant,\" she confessed miserably.\"I'm sure we'll solve your problem,\" the doctor reassured her.\"If you'll just take off ...Read Moreyour clothes and lie down on examining table.\"\"Well, all right, doctor,\" agreed the Anna, blushing, \"but It would have been better to have my husband's baby. Read Less"
    },
    "427": {
        "category": "funny-blonde-jokes",
        "id": "5183",
        "punchline": "Why did the blonde pee on the floor?\nBecause the sign said \"Wet Floor\""
    },
    "428": {
        "category": "funny-blonde-jokes",
        "id": "5592",
        "punchline": "How many blondes does it take to play tag?\nOne."
    },
    "429": {
        "category": "funny-blonde-jokes",
        "id": "5591",
        "punchline": "How do you confuse a blonde?\nYou don't -- they're born that way."
    },
    "430": {
        "category": "funny-blonde-jokes",
        "id": "5590",
        "punchline": "What do you call a blonde with an IQ of 70?\nGifted."
    },
    "431": {
        "category": "funny-blonde-jokes",
        "id": "5600",
        "punchline": "Why was the blond fired from the M&M factory?\nShe kept throwing away the W's."
    },
    "432": {
        "category": "funny-blonde-jokes",
        "id": "18250",
        "punchline": "this guy goes over to his friends house and he takes his girlfriend with him so his friend can meet her. Two weeks later they see each other and the guy was with a new girl so the other guy walks up and says hey man i see you got a new girl what happen to that blonde she was a b*tch the girl says I dyed my hair "
    },
    "433": {
        "category": "funny-blonde-jokes",
        "id": "23547",
        "punchline": "one day a blonde decided that she would like to buy a tv. she went to the electronics store and asked the man if she could buy that tv. The man said \"sorry we dont sell to blondes. she went home an dyed her hair black. The next day she went back and asked for the tv again. The man replied \" sorry ...Read Morewe dont sell to blondes\". \"but my hair is black\" she replied.\"yes but the 'tv' you wanted to buy is actually a microwave\" Read Less"
    },
    "434": {
        "category": "funny-blonde-jokes",
        "id": "23836",
        "punchline": "Why did the blonde woman shoot out all the mirrors in her home?Because when she looked out THOSE windows...the OTHER crazy blonde b*tch copied her every move. "
    },
    "435": {
        "category": "funny-blonde-jokes",
        "id": "1846",
        "punchline": "A blonde is driving down the road and she sees a dead rabbit. She stops the car and called out, \"does anybody got any hairspray!?\" A man pulls up and gives her a bottle of spray and she sprays it on the dead rabbit and the man stares and sad \"why u doing that?\" \nThe blonde says \"Hairspray is for dead hairs\""
    },
    "436": {
        "category": "funny-blonde-jokes",
        "id": "5328",
        "punchline": "There's a blonde walking down a trail. She comes to a river and stops. She looks right then left. She sees another blonde on the other side. She asks her \"how do you get to the other side?\" The blonde on the other side look right then left and says \"you are on the other side\"!"
    },
    "437": {
        "category": "funny-blonde-jokes",
        "id": "5687",
        "punchline": "boy:Did it hurt when you fell from hevan?\n blonde: are you calling me judah?....\n{blonde walks off}\nboy tells friends: first brunnetts ,then blacks, now blondes? lets go for reds."
    },
    "438": {
        "category": "funny-blonde-jokes",
        "id": "5682",
        "punchline": "When a  blonde gets told to do an Essay,she does a Mexican."
    },
    "439": {
        "category": "funny-blonde-jokes",
        "id": "27741",
        "punchline": "Blonde and Anant goes for a walk.Attractive lady crossing by says \"Hi' Anant\"Blonde: who is she ?Anant: Don't trouble me more. I am already worried. She will ask me same thing tomorrow !!!"
    },
    "440": {
        "category": "funny-blonde-jokes",
        "id": "28294",
        "punchline": "What do you call a blonde with a runny nose?Full"
    },
    "441": {
        "category": "funny-blonde-jokes",
        "id": "40634",
        "punchline": "I don't understand any jokes on this website-blonde"
    },
    "442": {
        "category": "funny-blonde-jokes",
        "id": "738",
        "punchline": "A blonde was driving home after work, and got caught in a really bad hailstorm. Her car was covered with dents, so the next day she took it to a repair shop. The shop owner saw that she was a blonde, so he decided to have some fun. He told her to just go home and blow into the tailpipe really hard, ...Read Moreand all the dents would pop out. So, the blonde went home, got down on her hands and knees and started blowing into her car's tailpipe.Nothing happened. She blew a little harder, and still nothing happened. Her roommate, another blonde, came home and said, \"What are you doing?\" The first blonde told her how the repairman had instructed her to blow into the tailpipe in order to get the dents to pop out. Her roommate rolled her eyes and said, ...\"HELLLLOOOO!!! You need to roll up the windows.\" Read Less"
    },
    "443": {
        "category": "funny-blonde-jokes",
        "id": "6587",
        "punchline": "A blonde woman is driving her car down the highway going way, way too fast. She passes a patrol car and is immediately pulled over. The police officer, who is also a blonde woman, comes over to the window and asks for her license. Dumbfounded, the blonde driver frantically tears through her ...Read Morepocketbook but can't seem to find it. She asks the officer, \"Well what does a license look like?\". The officer says, \"it's a small card with you picture on it.\" So she starts looking again and pulls out a small mirror. \"Aha! I found it!\" she says, and hands it to the officer. The officer looks at it, hands it back and says \"Your free to go.\" The driver asks why and the officer responds, \"I didn't know you were a cop.\" Read Less"
    },
    "444": {
        "category": "funny-blonde-jokes",
        "id": "262",
        "punchline": "What do you call a dumb blonde behind a steering wheel?\nAn Air Bag. "
    },
    "445": {
        "category": "funny-blonde-jokes",
        "id": "2672",
        "punchline": "What happened to the blond ice hockey team? They drown at spring training."
    },
    "446": {
        "category": "funny-blonde-jokes",
        "id": "4965",
        "punchline": "How many blondes does it take to screw in a light bulb? 1001.....1 to hold the light bulb and 1000 to turn the house."
    },
    "447": {
        "category": "funny-blonde-jokes",
        "id": "207",
        "punchline": "A blonde walks up to a Coke machine and puts in a coin. Out pops a Coke. The blonde looks amazed and runs away to get some more coins. She returns and starts feeding the machine madly and of course the machine keeps feeding out drinks.\nAnother person walks up behind the blonde and watches her ...Read Moreantics for a few minutes before stopping her and asking if someone else could have a go.\nThe blonde turns around and shouts, \"Can't you see I'm winning! \" Read Less"
    },
    "448": {
        "category": "funny-blonde-jokes",
        "id": "20362",
        "punchline": "How do you confuse a blonde?...... put her in a circular room and tell her to sit in a corner.this joke was posted by a blonde "
    },
    "449": {
        "category": "funny-blonde-jokes",
        "id": "5172",
        "punchline": "What is the difference between a blonde and a washing machine?\nA washing machine doesn't follow you around for three weeks after you dump your load into it."
    },
    "450": {
        "category": "funny-blonde-jokes",
        "id": "5232",
        "punchline": "Why did the blond speed on the highway?\nBecause she thought the cars behind her where chasing her!!!!"
    },
    "451": {
        "category": "funny-blonde-jokes",
        "id": "5301",
        "punchline": "Did you hear about the blonde who ran out of room to write on a transparency sheet?\nShe turned it over and used the other side!"
    },
    "452": {
        "category": "funny-blonde-jokes",
        "id": "6049",
        "punchline": "A blonde, brunette, and redhead are stranded on a island. They search the island and find a lamp. They rub it and out pops a genie. He says since there's three of them each gets one wish. The brunette wishes she was back home and disappears from the island. The redhead wishes the same thing and ...Read Moredisappears from the island. The blonde looks around and says \"I wish I had my friends back\"! Read Less"
    },
    "453": {
        "category": "funny-blonde-jokes",
        "id": "5685",
        "punchline": "Why did god create blondes?\ncus pets couldnt get beer bottles\nwhy did the god create brunnets?\ncus blondes couldnt either"
    },
    "454": {
        "category": "funny-blonde-jokes",
        "id": "5474",
        "punchline": "There was a blonde a redhead and a brunette running from a cop. They hide in potato sacks. The officer kicks each bag....when he kicks the redheads bag she goes meow....when he kick  the brunettes bag she  goes ruff...when he kicks the blondes bag she goes potatoes!"
    },
    "455": {
        "category": "funny-blonde-jokes",
        "id": "6677",
        "punchline": "Why did God give blondes 2 points higher IQs than horses? Because he didn't want them shitting in the streets during parades."
    },
    "456": {
        "category": "funny-blonde-jokes",
        "id": "5896",
        "punchline": "A blonde and a brunette fell off a building, which hit the ground first? The brunette, the blonde had to ask for directions"
    },
    "457": {
        "category": "funny-blonde-jokes",
        "id": "19414",
        "punchline": "What do blondes and tornadoes have in common? first there's a lot of sucking and blowing and then in the end you loose your house."
    },
    "458": {
        "category": "funny-blonde-jokes",
        "id": "31089",
        "punchline": "Three blondes are standing at the edge of a riverthey want to get across so the first blonde says \"I want to be 10% smarter\" And turns in to a brunette and swims across the riverThe second blonde says \"I want to be 20% smarter\" and so she builds a boat and goes across the riverThe third blonde says ...Read More\"okay that's it I want to be 100% smarter and turns into a man and walks across the bridge Read Less"
    },
    "459": {
        "category": "funny-blonde-jokes",
        "id": "31862",
        "punchline": "How many blondes does it take to fail a math test?Only 1"
    },
    "460": {
        "category": "funny-blonde-jokes",
        "id": "5092",
        "punchline": "a guy asked a blonde if his blinkers were working and she replied\non,off,on,off"
    },
    "461": {
        "category": "funny-blonde-jokes",
        "id": "40634",
        "punchline": "I don't understand any jokes on this website-blonde"
    },
    "462": {
        "category": "funny-blonde-jokes",
        "id": "738",
        "punchline": "A blonde was driving home after work, and got caught in a really bad hailstorm. Her car was covered with dents, so the next day she took it to a repair shop. The shop owner saw that she was a blonde, so he decided to have some fun. He told her to just go home and blow into the tailpipe really hard, ...Read Moreand all the dents would pop out. So, the blonde went home, got down on her hands and knees and started blowing into her car's tailpipe.Nothing happened. She blew a little harder, and still nothing happened. Her roommate, another blonde, came home and said, \"What are you doing?\" The first blonde told her how the repairman had instructed her to blow into the tailpipe in order to get the dents to pop out. Her roommate rolled her eyes and said, ...\"HELLLLOOOO!!! You need to roll up the windows.\" Read Less"
    },
    "463": {
        "category": "funny-blonde-jokes",
        "id": "6587",
        "punchline": "A blonde woman is driving her car down the highway going way, way too fast. She passes a patrol car and is immediately pulled over. The police officer, who is also a blonde woman, comes over to the window and asks for her license. Dumbfounded, the blonde driver frantically tears through her ...Read Morepocketbook but can't seem to find it. She asks the officer, \"Well what does a license look like?\". The officer says, \"it's a small card with you picture on it.\" So she starts looking again and pulls out a small mirror. \"Aha! I found it!\" she says, and hands it to the officer. The officer looks at it, hands it back and says \"Your free to go.\" The driver asks why and the officer responds, \"I didn't know you were a cop.\" Read Less"
    },
    "464": {
        "category": "funny-blonde-jokes",
        "id": "262",
        "punchline": "What do you call a dumb blonde behind a steering wheel?\nAn Air Bag. "
    },
    "465": {
        "category": "funny-blonde-jokes",
        "id": "2672",
        "punchline": "What happened to the blond ice hockey team? They drown at spring training."
    },
    "466": {
        "category": "funny-blonde-jokes",
        "id": "4965",
        "punchline": "How many blondes does it take to screw in a light bulb? 1001.....1 to hold the light bulb and 1000 to turn the house."
    },
    "467": {
        "category": "funny-blonde-jokes",
        "id": "207",
        "punchline": "A blonde walks up to a Coke machine and puts in a coin. Out pops a Coke. The blonde looks amazed and runs away to get some more coins. She returns and starts feeding the machine madly and of course the machine keeps feeding out drinks.\nAnother person walks up behind the blonde and watches her ...Read Moreantics for a few minutes before stopping her and asking if someone else could have a go.\nThe blonde turns around and shouts, \"Can't you see I'm winning! \" Read Less"
    },
    "468": {
        "category": "funny-blonde-jokes",
        "id": "20362",
        "punchline": "How do you confuse a blonde?...... put her in a circular room and tell her to sit in a corner.this joke was posted by a blonde "
    },
    "469": {
        "category": "funny-blonde-jokes",
        "id": "5172",
        "punchline": "What is the difference between a blonde and a washing machine?\nA washing machine doesn't follow you around for three weeks after you dump your load into it."
    },
    "470": {
        "category": "funny-blonde-jokes",
        "id": "5232",
        "punchline": "Why did the blond speed on the highway?\nBecause she thought the cars behind her where chasing her!!!!"
    },
    "471": {
        "category": "funny-blonde-jokes",
        "id": "5301",
        "punchline": "Did you hear about the blonde who ran out of room to write on a transparency sheet?\nShe turned it over and used the other side!"
    },
    "472": {
        "category": "funny-blonde-jokes",
        "id": "6049",
        "punchline": "A blonde, brunette, and redhead are stranded on a island. They search the island and find a lamp. They rub it and out pops a genie. He says since there's three of them each gets one wish. The brunette wishes she was back home and disappears from the island. The redhead wishes the same thing and ...Read Moredisappears from the island. The blonde looks around and says \"I wish I had my friends back\"! Read Less"
    },
    "473": {
        "category": "funny-blonde-jokes",
        "id": "5685",
        "punchline": "Why did god create blondes?\ncus pets couldnt get beer bottles\nwhy did the god create brunnets?\ncus blondes couldnt either"
    },
    "474": {
        "category": "funny-blonde-jokes",
        "id": "5474",
        "punchline": "There was a blonde a redhead and a brunette running from a cop. They hide in potato sacks. The officer kicks each bag....when he kicks the redheads bag she goes meow....when he kick  the brunettes bag she  goes ruff...when he kicks the blondes bag she goes potatoes!"
    },
    "475": {
        "category": "funny-blonde-jokes",
        "id": "6677",
        "punchline": "Why did God give blondes 2 points higher IQs than horses? Because he didn't want them shitting in the streets during parades."
    },
    "476": {
        "category": "funny-blonde-jokes",
        "id": "5896",
        "punchline": "A blonde and a brunette fell off a building, which hit the ground first? The brunette, the blonde had to ask for directions"
    },
    "477": {
        "category": "funny-blonde-jokes",
        "id": "19414",
        "punchline": "What do blondes and tornadoes have in common? first there's a lot of sucking and blowing and then in the end you loose your house."
    },
    "478": {
        "category": "funny-blonde-jokes",
        "id": "31089",
        "punchline": "Three blondes are standing at the edge of a riverthey want to get across so the first blonde says \"I want to be 10% smarter\" And turns in to a brunette and swims across the riverThe second blonde says \"I want to be 20% smarter\" and so she builds a boat and goes across the riverThe third blonde says ...Read More\"okay that's it I want to be 100% smarter and turns into a man and walks across the bridge Read Less"
    },
    "479": {
        "category": "funny-blonde-jokes",
        "id": "31862",
        "punchline": "How many blondes does it take to fail a math test?Only 1"
    },
    "480": {
        "category": "funny-blonde-jokes",
        "id": "5092",
        "punchline": "a guy asked a blonde if his blinkers were working and she replied\non,off,on,off"
    },
    "481": {
        "category": "funny-blonde-jokes",
        "id": "5553",
        "punchline": "A blond was taking a shower and her husband called in and asked \"did you find the new dry hair shampoo I picked up for you?\" And the blond replied \"yes but there's a problem I already got my hair wet\""
    },
    "482": {
        "category": "funny-blonde-jokes",
        "id": "5759",
        "punchline": "Two blonde chics are typing up their essays when one of them stopped suddenly, confused as shit. She turns to the other blonde girl and asks, \"how do we spell 'laugh?'\"\nThe blonde girl replies, \"duh! L-O-L... the 'F' is silent.\""
    },
    "483": {
        "category": "funny-blonde-jokes",
        "id": "6887",
        "punchline": "There was 3 women in the desert a redneck, brunette, and a blonde. They found a genie and he granted 1 wish to each one of them. The redneck wished for a fan so she wouldn't be hot. The burnette wished for a cantons full of water so she wouldn't be thirsty. The blonde wished for a car door so she ...Read Morecould tool down the window when it got hot. Read Less"
    },
    "484": {
        "category": "funny-blonde-jokes",
        "id": "20419",
        "punchline": "bob the builder was short on workers so he had to hire a blonde,he said you only need to do some hammering. a few hours later bob returns to see the entire work crew (blonde included) piss drunk he asks who is responsible for this. blonde says me but she also says why are you mad? I only did what you asked."
    },
    "485": {
        "category": "funny-blonde-jokes",
        "id": "499",
        "punchline": "A blonde just got a call from her boyfriend. He said i'll meet you at your house, so the blonde drove home, excited. Once the blonde got home her boyfriend was having sex with another girl. The blonde burst into tears and pulled out her gun then stuck it to her head. \" No dont do it!\" her boyfriend ...Read Moresaid!...... the blonde, not knowing what to do next said, \" Shut up you cheater you're next!\" Read Less"
    },
    "486": {
        "category": "funny-blonde-jokes",
        "id": "5023",
        "punchline": "Why did the blonde tip-toe past the medicine cabinet?\nShe was trying not to wake the sleeping tablets. -_-"
    },
    "487": {
        "category": "funny-blonde-jokes",
        "id": "5950",
        "punchline": "one day on friday the 13th a blonde and a brunette are on a boat leaning over the rails looking at the water. All of a sudden the brunette loses her balence and falls over the side of the boat. She is hanging onto the rail and the blonde is just standing there not helping. Eventually the brunette ...Read Moreloses her grip and drowns. Once the blonde dies of old age they run into each other in heavan. The brunette asks \"why didnt you save me\" the blonde says \"cause it was friday the 13th and your suposed to have bad luck,duh Read Less"
    },
    "488": {
        "category": "funny-blonde-jokes",
        "id": "9934",
        "punchline": "Why did the blonde die in a soccer game?Because she drowned in a Mexican wave!"
    },
    "489": {
        "category": "funny-blonde-jokes",
        "id": "18499",
        "punchline": "what does a blonde a screen door have in common the harder you slam em the looser they get "
    },
    "490": {
        "category": "funny-blonde-jokes",
        "id": "5678",
        "punchline": "A blonde guy in the 6th Grade got a ticket that said 'Free Dress Day.' He came back to school and wore a dress that said 'FREE!' on it."
    },
    "491": {
        "category": "funny-blonde-jokes",
        "id": "42299",
        "punchline": "What is the same between a twister and a blonde there a lot of sucking and blowing and your house is gone"
    },
    "492": {
        "category": "funny-blonde-jokes",
        "id": "17710",
        "punchline": "a blond and a brunet are on a building and both jump off which one hits the ground first A: the brunet the blond had to ask for directions "
    },
    "493": {
        "category": "funny-blonde-jokes",
        "id": "7916",
        "punchline": "Double heart attack message by a girlfriend to a boyfriend:1st Msg:\"Lets break up now,its all over..2nd Msg:\"Sorry, Sorry, Sorry!That was not for you....."
    },
    "494": {
        "category": "funny-blonde-jokes",
        "id": "6199",
        "punchline": "A blonde mechanic told one of his customers \" I couldn't fix your brakes, so I made your horn louder!\"\nLol"
    },
    "495": {
        "category": "funny-blonde-jokes",
        "id": "10292",
        "punchline": "There was once a blue-haired, a red-haired, and a blonde girl who were getting chased by cops. The girls then hid in three trash cans. The blue-haired girl hid and a cop was about to lift her lid, until the blue-haired yelled out \"Woof!\". The cop then says \" Oh...just a dog\" . Then he goes to lift ...Read Moreanother one, but the red-haired girl yelled \"Meow!\" 'Oh...just a cat.\" Then he goes to the final one and then the blonde girl yelled out \"Tomato!\" Read Less"
    },
    "496": {
        "category": "funny-blonde-jokes",
        "id": "21729",
        "punchline": "After robbing a bank, a blond, a brunette, and a redhead duck into an alley where they hide in potato sacks. The cops first go to the sack with the brunette in it and kick it. The brunette says, \"Meow.\" They go to the sack with the redhead and kick it. She says, \"Woof, woof.\" Last, they kick the ...Read Moresack with the blond, and she says, \"Po-ta-to.\" Read Less"
    },
    "497": {
        "category": "funny-blonde-jokes",
        "id": "30633",
        "punchline": "Blonds are so stupid when you punch them on the arm they say\"Ow my knee!!!\""
    },
    "498": {
        "category": "funny-blonde-jokes",
        "id": "23265",
        "punchline": "what do you call a blonde girl doing a handstand?a brunette with bad breath. "
    },
    "499": {
        "category": "funny-blonde-jokes",
        "id": "15756",
        "punchline": "A blonde and brunette and a red head are stuck out in the middle of a desert with no city or town in site. The Brunette says \"Well, I guess I will try and find up some food and water\" The Red Head says \"I guess I will build a shelter for us to live in for a bit. Then the Blonde says \"I will take ...Read Morethe car doors off so we can role down the windows when it gets hot\" Read Less"
    },
    "500": {
        "category": "funny-blonde-jokes",
        "id": "34236",
        "punchline": "when my girlfriend twerks it makes the whole world rumble"
    },
    "501": {
        "category": "funny-blonde-jokes",
        "id": "43274",
        "punchline": "Q: What do you call a blonde with a bowlcut?A: Louis"
    },
    "502": {
        "category": "funny-blonde-jokes",
        "id": "14673",
        "punchline": "Q: Why did the blonde have trouble in the ladies' room?A: She is not used to pulling her own pants down."
    },
    "503": {
        "category": "funny-blonde-jokes",
        "id": "14672",
        "punchline": "The easiest way to kill/permanently remove a blonde:take her outside and dare her to touch the roof."
    },
    "504": {
        "category": "funny-blonde-jokes",
        "id": "12347",
        "punchline": "*takes 50 selfies**deletes 49**stares at that one selfie till it turns ugly**deletes that too*"
    },
    "505": {
        "category": "funny-blonde-jokes",
        "id": "15907",
        "punchline": "Friend: What did the triangle say to the circle?Me: I dont know...Friend: OMG! Your so f*cking pointless.Me: That joke was pointless."
    },
    "506": {
        "category": "funny-blonde-jokes",
        "id": "19537",
        "punchline": "I have no idea how to post this...yes I am a blonde"
    },
    "507": {
        "category": "funny-blonde-jokes",
        "id": "43457",
        "punchline": "why are blondes stupid? There blonde!"
    }
}