{
    "1": {
        "id": "7c3dev",
        "premise": "By popular demand, we now have a discord server. Join this",
        "punchline": "Guaranteed reposts.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "2": {
        "id": "7ekt23",
        "premise": "Calm down about the Net Neutrality thing...",
        "punchline": "Paying additional money to access certain sites will give you a sense of pride and accomplishment.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "3": {
        "id": "7g0dxg",
        "premise": "(P+L)(A+N) = PA+PN+LA+LN",
        "punchline": "Ha! I just foiled your plan!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "4": {
        "id": "7fxqkc",
        "premise": "Hitler, Salin, and EA were having a debate",
        "punchline": "\"Who amongst us is the most hated?\" Hitler asked",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "5": {
        "id": "7fzowe",
        "premise": "Three men, John, Paul, and Bob live horrible lives and go to hell. When they arrive, a hideously ugly woman appears out of nowhere. Suddenly, a loud booming voice says,",
        "punchline": "\"John! You have sinned! In reparation for your atrocious lifestyle you are condemned to sleep with this woman.\" With a cry of dismay, John is a whisked away to endure this horrible penance. Suddenly, another even uglier more hideous woman comes forward.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "6": {
        "id": "7fv764",
        "premise": "A newlywed couple lay in bed one morning husband says: \"How about you go brew us some coffee?\"",
        "punchline": "Wife: \"That's your job.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "7": {
        "id": "7fupiz",
        "premise": "An engineer dies and...",
        "punchline": "An Engineer dies, and goes to Hell. Dissatisfied with the level of comfort down there, he starts designing and building improvements. After a while Hell has air conditioning, flush toilets and escalators. The engineer is a pretty popular guy. One day God rings down and asks Satan,\"So, how's it going down there?\" Satan says, \"Hey things are going great. We've got air conditioning and flush toilets and escalators, and there's no telling what this engineer is going to come up with next.\" God is horrified. \"What? You've got an engineer? That's a mistake - he should never have gone down there! You know all engineers go to Heaven. Send him back up here!\" Satan says, \"No way. I like having an engineer on the staff.. I'm keeping him\". God says, \"Send him back up here or I'll sue\". \"Yeah, right,\" Satan laughs, \"and where are you going to find a lawyer?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "8": {
        "id": "7fukkv",
        "premise": "I wish my college was run by EA",
        "punchline": "At least I’d get a sense of pride and accomplishment for my money",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "9": {
        "id": "7fv8vl",
        "premise": "Set your WiFi password to 2444666668888888",
        "punchline": "So when someone asks tell them it’s 12345678",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "10": {
        "id": "7g1dm6",
        "premise": "We're getting a divorce after 45 years..",
        "punchline": "An old man calls his son and says, \"Listen, your mother and I are getting divorced. Forty-five years of misery is enough.\" \"Dad, what are you talking about?\" the son screams. “We can't stand the sight of each other any longer,” he says. \"I'm sick of her face, and I'm sick of talking about this, so call your sister and tell her,\" and he hangs up. Now, the son is worried. He calls his sister. She says, \"Like hell they’re getting divorced!\" She calls their father immediately. \"You’re not getting divorced! Don't do another thing. The two of us are flying home tomorrow to talk about this. Until then, don't call a lawyer, don't file a paper. DO YOU HEAR ME?” She hangs up the phone. The old man turns to his wife and says, \"Okay, they’re both coming for Christmas and paying their own airfares",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "11": {
        "id": "7g242i",
        "premise": "The first rule about Thesaurus club is",
        "punchline": "that you do not talk, speak, prattle, whisper, chatter, mumble, rant, articulate, babble, describe, divulge, drone, confer, deliberate, squeal, or converse about Thesaurus Club.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "12": {
        "id": "7fyn18",
        "premise": "I'm 60 days clean now!",
        "punchline": "It's hard showering every day, but luckily i had heroin to help me through it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "13": {
        "id": "7fuie9",
        "premise": "What do you call a communist sniper?",
        "punchline": "A Marx-man",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "14": {
        "id": "7fwyg4",
        "premise": "After spending 20 minutes trying to take my girlfriend's bra off, I've decided to give up",
        "punchline": "I wish I'd never put it on now",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "15": {
        "id": "7fvkgv",
        "premise": "Why is suicide illegal?",
        "punchline": "destruction of government property.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "16": {
        "id": "7g0uhi",
        "premise": "What's worse than no nut November?",
        "punchline": "No net December. Defend net neutrality.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "17": {
        "id": "7fvltm",
        "premise": "My friend keeps telling me to cheer up these days...",
        "punchline": "My friend keeps telling me to cheer up these days. He says it could be a lot worse , I could be trapped inside an underground hole filled with water.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "18": {
        "id": "7fsdq0",
        "premise": "Thanks for explaining the word \"many\" to me.",
        "punchline": "It means a lot",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "19": {
        "id": "7g16fg",
        "premise": "It is the year 2200",
        "punchline": "In a small city lived a master fisherman. This fisherman was famous throughout the world for being able to catch numerous amounts of fish in any body of water. Now, fish these days have mutated and changed quite a bit, but this fisherman was able to catch them all with little to no effort.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "20": {
        "id": "7g0he3",
        "premise": "The new IT guy at my company is from Australia.",
        "punchline": "He comes from a LAN down under.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "21": {
        "id": "7fx293",
        "premise": "I'm pretty sure my F5 key isn't working anymore",
        "punchline": "I keep seeing the same jokes on here",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "22": {
        "id": "7fwv96",
        "premise": "Mickey goes to a lawyer.",
        "punchline": "Lawyer: so it says here that you want to divorce Minnie because she was... extremely silly?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "23": {
        "id": "7fyki3",
        "premise": "Dads favorite medical school joke.",
        "punchline": "Medical students were attending their 1st biochemistry class. They all gathered around the Lab table with a urine sample. The professor dip his finger in urine & tasted it in his own mouth.  Then he asked the students to do the same. The students hesitated for several minutes, but at last every one dipped their finger in urine sample & tasted it.... When everyone finished, the professor looked at them & said: “The most important quality is 'Observation'.  I dipped my MIDDLE Finger but tasted the INDEX Finger. Today you just learn, how to pay attention.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "24": {
        "id": "7fwa57",
        "premise": "Crazy Bob",
        "punchline": "Bob left work one Friday evening.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "25": {
        "id": "7g1pn7",
        "premise": "I wasn’t going to visit my family this December, but my mom promised to make me eggs Benedict.",
        "punchline": "So I’m going home for the hollandaise.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "26": {
        "id": "7fuwx3",
        "premise": "A warning to all.",
        "punchline": "Be careful about drink driving as we are getting near to Christmas and the police are out checking on people.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "27": {
        "id": "7g2mt4",
        "premise": "“Give it to me!” She yelled. \"I’m so fucking wet, give it to me now!\"",
        "punchline": "She could scream all she wanted.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "28": {
        "id": "7fzv1a",
        "premise": "An American walks into an Irish pub",
        "punchline": "An Irishman yells, \"Oi, Yank! Are you Catholic or are you Protestant?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "29": {
        "id": "7fqyr4",
        "premise": "Here's a tip! If your phone autocorrects \"fuck\" to \"duck\", don't bother correcting it...",
        "punchline": "It's still fowl language.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "30": {
        "id": "7ftwke",
        "premise": "I hate it when homeless people shake their cups of coins at me",
        "punchline": "I get that you have more money than me, no need to rub it in",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "31": {
        "id": "7g0ixn",
        "premise": "A boy is selling fish on a corner.",
        "punchline": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "32": {
        "id": "7fwvsj",
        "premise": "Kim Jung Un responds to why he doesn't let people leave North Korea.",
        "punchline": "Kim Jung Un has said \"The intent is to provide people with a sense of pride and accomplishment for escaping North Korea\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "33": {
        "id": "7fx3pj",
        "premise": "Man walks into a bar",
        "punchline": "and orders 10 shots of tequila. Bartender surprised by the order asks what's the occasion? The man says \"I just had my first blow job\". With cheer in his voice bartender says \"well if it's so, then I'll throw in 1 on the house\". the mans says \"if 10 shots can't wash that taste out of my mouth, I doubt 11 will\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "34": {
        "id": "7fxqq2",
        "premise": "Why are Americans so bad at League of Legends?",
        "punchline": "Because they cant defend the towers",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "35": {
        "id": "7g0we2",
        "premise": "I'm getting my wife a new prosthetic leg for Christmas.",
        "punchline": "It's not her main present, it's just a stocking filler.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "36": {
        "id": "7fz9nv",
        "premise": "My girlfriend sent me this email today: \"Helpmyspacebarisbrokencanyougivemeanalternative?\"",
        "punchline": "The hell's a ternative?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "37": {
        "id": "7g1tlc",
        "premise": "How do you inherit a flatulent vagina?",
        "punchline": "It's bequeefed to you.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "38": {
        "id": "7fyupq",
        "premise": "Why is 6 afraid of 7?",
        "punchline": "Because the difference between them is a negative one.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "39": {
        "id": "7g02w6",
        "premise": "A feminist asked me how I see lesbian relationships",
        "punchline": "\"In 1080p\" was apparently the wrong answer",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "40": {
        "id": "7fvnml",
        "premise": "im thinking about removing my spine...",
        "punchline": "i feel like its only holding me back",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "41": {
        "id": "7g2f00",
        "premise": "I used to be indecisive...",
        "punchline": "But now I’m not so sure.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "42": {
        "id": "7g23c6",
        "premise": "Getting old sucks.",
        "punchline": "But getting sucked never gets old.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "43": {
        "id": "7g27su",
        "premise": "Mom: \"Why don't you talk to John anymore, you used to be best friends?\"",
        "punchline": "Son: \"Well would you be friends with someone who was stupid, took drugs and was drunk all the time?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "44": {
        "id": "7fuh8k",
        "premise": "My new girlfriend reckons I'm no good in bed...",
        "punchline": "...but I don't see how she can make a judgement like that in less than a minute.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "45": {
        "id": "7fwvfh",
        "premise": "Cosmetic surgery used to be such a taboo subject.",
        "punchline": "Now when you talk about Botox no one raises an eyebrow",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "46": {
        "id": "7g2f7u",
        "premise": "I know a guy who thinks he's a peanut shell.",
        "punchline": "He's a real nutcase.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "47": {
        "id": "7fysjl",
        "premise": "One man's trash is another man's treasure",
        "punchline": "Maybe that wasn't the best way to tell my son he's adopted...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "48": {
        "id": "7funol",
        "premise": "Me: *washing car with son*",
        "punchline": "Son: “Dad, can’t you just use a sponge?”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "49": {
        "id": "7g23tc",
        "premise": "It's easy to talk to the dead.",
        "punchline": "The hard part is getting them to answer.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "50": {
        "id": "7g1pqh",
        "premise": "I left my job as a Concrete Worker.",
        "punchline": "It just seemed to get HARDER and HARDER.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "51": {
        "id": "7fyhgg",
        "premise": "These friars were behind on their belfry payments...",
        "punchline": "These friars were behind on their belfry payments, so they opened up a small florist shop to raise funds.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "52": {
        "id": "7g1rkr",
        "premise": "What’s the difference between a bank and a bank robber?",
        "punchline": "Give a man a gun and he can rob a bank, but give a man a bank and he can rob the whole world.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "53": {
        "id": "7g30n8",
        "premise": "Who stopped The criminals in The dinosaur age?",
        "punchline": "The triceracops",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "54": {
        "id": "7g1i6c",
        "premise": "A Small Village Church In Search of a New Employee",
        "punchline": "Sometime around the 1950’s, there was a small village in a remote region somewhere in the American South, and at the center of this village was a tall church.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "55": {
        "id": "7g0lgv",
        "premise": "A man's logic",
        "punchline": "A couple wants a divorce, but first they must decide who will be the main guardian of their child. The jury asks both the man and woman for a reason why they should be the one to keep the child. So the jury asks the woman first. She says, \"Well I carried this child for nine months and I had to go through a painful birth process, this is my child and apart of me.\" The jury is impressed and then turns to ask the man the same question. The man replies, \"OK, I take a coin and put it in the drink machine and a drink comes out, now tell me who does the drink belong to.....me or the machine\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "56": {
        "id": "7fugz2",
        "premise": "A woman complains to her husband about the blisters on her hands",
        "punchline": "\"I have so many blisters from using this broom\" says the wife \"well maybe use the car next time\" the husband replies.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "57": {
        "id": "7fuqz4",
        "premise": "Q: Why did Mozart kill all his chickens?",
        "punchline": "A: Because when he asked them who the best composer was, they'd all say: \"Bach, Bach, Bach.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "58": {
        "id": "7fycr6",
        "premise": "I once had my wallet stolen by a rodent who didn't know his father.",
        "punchline": "That rat bastard took all my money.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "59": {
        "id": "7g1qsd",
        "premise": "Im surprised that not many people know of Arthur the brown nosed reindeer",
        "punchline": "He's just as fast as Rudolf. He just has issues stopping in time.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "60": {
        "id": "7g2v2h",
        "premise": "I asked my art teacher how to draw people.",
        "punchline": "He suggested I work on my personality",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "61": {
        "id": "7fy5az",
        "premise": "A couple with a 9 year old son are in their home...",
        "punchline": "A couple with a 9 year old son are in their home when the doorbell rings. Surprise surprise its an old friend they haven't met in a loooong time. So the wife and son immediately begin to prepare dinner in the kitchen for the guest while her husband entertains him in the living room.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "62": {
        "id": "7fw865",
        "premise": "I farted in an Apple store",
        "punchline": "And everyone complained. Its not my fault they don't have Windows.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "63": {
        "id": "7fwpp2",
        "premise": "A blind man walks into a bar...",
        "punchline": "...and a table...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "64": {
        "id": "7fuv6k",
        "premise": "Being a comedian is really bad for my anxiety",
        "punchline": "Whenever I’m on stage people keep laughing at me",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "65": {
        "id": "7fwa3n",
        "premise": "What do you call a British sperm donor?",
        "punchline": "An investment wanker.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "66": {
        "id": "7g1hxi",
        "premise": "They say six is afraid of seven because seven ate nine. But why? Seven did the healthy thing.",
        "punchline": "...eat three squared meals a day.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "67": {
        "id": "7g3068",
        "premise": "I used to be Christian...",
        "punchline": "Her: I used to be Christian.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "68": {
        "id": "7fnms4",
        "premise": "Most people are shocked when they find out...",
        "punchline": "...how incompetent I am as an electrician.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "69": {
        "id": "7g2yw3",
        "premise": "Two squares crashed into each other,",
        "punchline": "it was a wreck-tangle.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "70": {
        "id": "7g2hoe",
        "premise": "Why didn't the astronaut come home to his wife?",
        "punchline": "He needed his space.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "71": {
        "id": "7g0vtd",
        "premise": "Did you hear about the corduroy pillows?",
        "punchline": "They're making headlines.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "72": {
        "id": "7fu7oo",
        "premise": "You ever tried to eat a clock?",
        "punchline": "It's very time consuming.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "73": {
        "id": "7fqbax",
        "premise": "If I had a dollar for every time someone over 40 told me my generation sucks...",
        "punchline": "Then I could afford a house in the economy they ruined",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "74": {
        "id": "7fsj89",
        "premise": "I was having intimate relations with a married woman.",
        "punchline": "A car pulled into the garage, and the woman said, \"Oh no it's my husband! Quick, use the back door!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "75": {
        "id": "7fth0q",
        "premise": "After my girlfriend got pregnant, everything changed....",
        "punchline": "My address, my job, my phone number...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "76": {
        "id": "7fwpay",
        "premise": "A communist joke isn’t funny",
        "punchline": "Unless everyone gets it",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "77": {
        "id": "7fz4ce",
        "premise": "What's a Russian's favorite clothing material?",
        "punchline": "Lenin",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "78": {
        "id": "7g2npb",
        "premise": "Fancy Strip Club",
        "punchline": "I found my self at a strip club one evening. Apparently it was a nice one because when I pulled out a dollar bill to tip one of the dancers she promptly told me \"sorry darling but we only take big bills here.\" without missing a beat I said \"no problem hun, all I have are big bills.\" i winked at her, reached inside my coat pocket and stuffed my electric bill in her G-string.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "79": {
        "id": "7g1rii",
        "premise": "A neo-nazi, a ghost, and a pilot walk into a bar.",
        "punchline": "The pilot says to the bartender, \"Give me a light drink. I need to be sober tomorrow.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "80": {
        "id": "7fwoxr",
        "premise": "A photon walks into a hotel",
        "punchline": "The hotel clerk asks, \"Do you have any luggage?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "81": {
        "id": "7g35u4",
        "premise": "A short fortune teller committed a crime, and the police put almost no effort into catching her",
        "punchline": "Headlines the next day read: Small medium largely ignored.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "82": {
        "id": "7g350e",
        "premise": "Did you hear about the guy who survived pepper spray and mustard gas?",
        "punchline": "He's a real seasoned veteran",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "83": {
        "id": "7g34iw",
        "premise": "I feel like an exotic rainforest",
        "punchline": "Only because I'm slowly dying",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "84": {
        "id": "7g0o89",
        "premise": "What happens if you give Donald Trump viagra?",
        "punchline": "He gets taller",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "85": {
        "id": "7g0xwt",
        "premise": "A lizard walks into the bar...",
        "punchline": "A lizard walks into a bar pushing a baby in a stroller. “What’s your kid’s name?” asks the bartender. “Tiny,” says the lizard. “Because he’s my newt.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "86": {
        "id": "7fxcb5",
        "premise": "What's worse than ants in your pants?",
        "punchline": "Uncles.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "87": {
        "id": "7g1gq9",
        "premise": "I once did a theatrical performance on puns...",
        "punchline": "It was a play on words.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "88": {
        "id": "7g2xct",
        "premise": "Three boys pass by an old mans house",
        "punchline": "Three boys pass by an old mans house while he’s on the porch carrying chicken wire.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "89": {
        "id": "7g29ey",
        "premise": "Checking your levels",
        "punchline": "A woman observes her husband as he enters the kitchen, opens the sugar box, looks inside and closes it. He does it again and again. So she asks him why?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "90": {
        "id": "7g2tgf",
        "premise": "What's the difference between Harambe and Harambe memes?",
        "punchline": "There's no difference, they're both still fucking dead.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "91": {
        "id": "7fz5bv",
        "premise": "What do you call someone who immigrates to Sweden?",
        "punchline": "Artificial Swedener",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "92": {
        "id": "7g2sgb",
        "premise": "A British doctor says",
        "punchline": "\"In Britain, medicine is so advanced that we cut off a man's liver, put it in another man, and in 6 weeks, he is looking for a job.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "93": {
        "id": "7fykag",
        "premise": "My true love was a math professor",
        "punchline": "She is now my x and I am left wondering y.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "94": {
        "id": "7g16cd",
        "premise": "What are two of the most unexpected words?",
        "punchline": "Spanish inquisition",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "95": {
        "id": "7g1j48",
        "premise": "Why can’t Jesus play hockey?",
        "punchline": "Because he always gets pinned against the boards.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "96": {
        "id": "7fyw77",
        "premise": "Whats the difference between a hooker and a drug dealer?",
        "punchline": "A hooker can wash her crack and resell it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "97": {
        "id": "7fz9mb",
        "premise": "Relationship",
        "punchline": "Relationships are just like algebra, ever looked at your X and wonder Y?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "98": {
        "id": "7g09j3",
        "premise": "There's actually very little demand for nihilist merchandise.",
        "punchline": "I guess it's a Nietzsche market.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "99": {
        "id": "7fwzj5",
        "premise": "\"Build it and they will come\"",
        "punchline": "thought the inventor of the dildo",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "100": {
        "id": "7g2lmj",
        "premise": "What is Hitler’s favourite drink?",
        "punchline": "Concentrated juice",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "101": {
        "id": "7fy7rb",
        "premise": "I'm Going To Open A New Furniture Shop",
        "punchline": "It's going to specialize in couches/sofas/chairs, etc...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "102": {
        "id": "7fw5wh",
        "premise": "Thank you for explaining to me the meaning of redundant.",
        "punchline": "No really, thank you for explaining the meaning of the word redundant.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "103": {
        "id": "7fw1w9",
        "premise": "Working on an airline, you receive free or reduced-priced flights.",
        "punchline": "Such was the case when Roger Gay took the opportunity of a free flight from London to Manchester. He boarded the flight some minutes before it was due to leave the terminal. The flight was filling up. Roger's allocated seat was already taken, so he sat in another, vacant seat.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "104": {
        "id": "7g1p94",
        "premise": "A man decides to get a pet for his wife for Christmas",
        "punchline": "He walks until the only pet store in town and begins to browse. He started to walk towards the dogs, but noticed the parrots next to the checkout. As he admires the birds, he notices that one of them was triple the price of the rest.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "105": {
        "id": "7fw0mw",
        "premise": "When people start bullying me about my weight, I cut myself.....",
        "punchline": "another piece of cake",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "106": {
        "id": "7fqddv",
        "premise": "We’ll we’ll we’ll",
        "punchline": "If it isn’t auto correct.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "107": {
        "id": "7fyuz1",
        "premise": "I once knew an axeman who was great at psychology",
        "punchline": "He could really get inside your head",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "108": {
        "id": "7g1o7t",
        "premise": "I went to an economist's convention",
        "punchline": "There was no free lunch",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "109": {
        "id": "7g13oc",
        "premise": "I'm not the tallest guy, so when I left university and applied for the job I wanted, I put down that I was a dwarf on my resume, hoping that being some type of minority would help me...",
        "punchline": "I didn't get the job though.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "110": {
        "id": "7g127n",
        "premise": "A Perfect Man",
        "punchline": "A Perfect Man",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "111": {
        "id": "7fwgzl",
        "premise": "I was walking along when I saw a drinks stand.",
        "punchline": "There was a sign that said: \"All drinks are £3\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "112": {
        "id": "7g2ag6",
        "premise": "A mathematician, a physicist, a engineer, and a computer programmer are asked to show all odd numbers greater than 1 are prime...",
        "punchline": "A mathematician, a physicist, an engineer, and a computer programmer are asked, after a few beers, to show that all odd numbers greater than 1 are prime.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "113": {
        "id": "7ftaln",
        "premise": "Nymphomaniac Convention",
        "punchline": "A man boarded an aircraft at London's Heathrow Airport for New York and taking his seat as he settled in, he noticed a very beautiful woman boarding the plane. He realised she was heading straight toward his seat and bingo - she took the seat right beside him. \"Hello\", he blurted out, \"Business trip or vacation?\" She turned, smiled enchantingly and said, \"Business. I'm going to the annual nymphomaniac convention in the United States ..\" He swallowed hard. Here was the most gorgeous woman he had ever seen sitting next to him, and she was going to a meeting for nymphomaniacs! Struggling to maintain his composure, he calmly asked, \"What's your business role at this convention?\" \"Lecturer,\" she responded,” I use my experience to debunk some of the popular myths about sexuality..\" \"Really\", he smiled, \"what myths are those?\" \"Well,\" she explained, \"one popular myth is that African-American men are the most well-endowed when, in fact, it's the Native American Indian who is most likely to possess that trait. Another popular myth is that French men are the best lovers, when actually it is the men of Greek descent. We have also found that the best potential lovers in all categories are the Irish.\" Suddenly the woman became uncomfortable and blushed. \"I'm sorry,\" she said. \"I really shouldn't be discussing this with you, I don't even know your name!\" \"Tonto,\" the man said. \"Tonto Papadopoulos, but my friends call me Paddy.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "114": {
        "id": "7fyt9g",
        "premise": "Why is North Korean music so bad?",
        "punchline": "They've got no Seoul.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "115": {
        "id": "7fwow6",
        "premise": "An octopus was killed in a shootout last week",
        "punchline": "Police say he was heavily armed",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "116": {
        "id": "7fzi44",
        "premise": "What do you get when you cross a fisherman with a jazz enthusiast?",
        "punchline": "An Anglo-Saxon I'm So Sorry",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "117": {
        "id": "7fxztk",
        "premise": "A mechanic, an electrician and a software developer were in a car.",
        "punchline": "The car stops working.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "118": {
        "id": "7fz5vw",
        "premise": "Nice try Scottish Power",
        "punchline": "The energy monitor they just installed draws electricity 24/7/365 - those fuckers are ruthless.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "119": {
        "id": "7g33ol",
        "premise": "Apparently, if you cut the trunk and count the rings, you can tell how old it was",
        "punchline": "The one I tried was only 2 years old.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "120": {
        "id": "7g21cp",
        "premise": "Cop: You’re under arrest",
        "punchline": "Cop: You’re under arrest Me: Let’s get a drink and talk this over, Attorney to Cop Cop: You’re an attorney? Me: No but I did pass a bar",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "121": {
        "id": "7fytf1",
        "premise": "What is a teddy bears favorite food...",
        "punchline": "Stuffing.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "122": {
        "id": "7fpw07",
        "premise": "On his deathbed, on old Jew tells his wife:",
        "punchline": "‘Oh, Sarah, when the shop burned down you were right beside me, no?’ - ‘ Sure I was, Moshe’",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "123": {
        "id": "7fx2rv",
        "premise": "What's the difference between a Necron and a Lawyer?",
        "punchline": "One is an emotionless robot with no respect for human life, the other is a faction in warhammer 40k",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "124": {
        "id": "7g0due",
        "premise": "I wanted to see if I was suitable for a job at the funnel factory",
        "punchline": "They said I wasn't funnely enough",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "125": {
        "id": "7frido",
        "premise": "I got a vasectomy but my wife still got pregnant",
        "punchline": "Apparently all it does is change the color of the baby",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "126": {
        "id": "7g2ts0",
        "premise": "What do you call a person who hasn't slept in 2 weeks?",
        "punchline": "A 2weeker",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "127": {
        "id": "7frgj5",
        "premise": "Two hillbillies are in a restaurant.",
        "punchline": "Two hillbillies walk into a restaurant. While having a bite to eat, they talk about their moonshine operation. Suddenly, a woman at a nearby table, who is eating a sandwich, begins to cough. After a minute or so, it becomes apparent that she is in real distress. One of the hillbillies looks at her and says, 'Kin ya swallar?' The woman shakes her head no. Then he asks, 'Kin ya breathe?' The woman begins to turn blue and shakes her head no. The hillbilly walks over to the woman, lifts up her dress, yanks down her drawers and quickly gives her right butt cheek a lick with his tongue. The woman is so shocked that she has a violent spasm and the obstruction flies out of her mouth. As she begins to breathe again, the Hillbilly walks slowly back to his table. His partner says, 'Ya know, I'd heerd of that there 'Hind Lick Maneuver' but I ain't niver seed nobody do it!'",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "128": {
        "id": "7fznu0",
        "premise": "I won a swordfight",
        "punchline": "I couldn't be rapier now",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "129": {
        "id": "7fpwm5",
        "premise": "I took my mother in law out today",
        "punchline": "I love being a sniper",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "130": {
        "id": "7fytuy",
        "premise": "What do you call a horse that was average in school?",
        "punchline": "A C horse",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "131": {
        "id": "7fy1zl",
        "premise": "I watched hockey before it was cool.",
        "punchline": "They were basically swimming",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "132": {
        "id": "7g1e4k",
        "premise": "Why was Frankenstein creature so ugly?",
        "punchline": "He never thought ahead",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "133": {
        "id": "7fumva",
        "premise": "This morning there was a tap on my door",
        "punchline": "My plumber has a weird sense of humor",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "134": {
        "id": "7g2kca",
        "premise": "Stupid ass physicist and engineers...",
        "punchline": "A physicist, an engineer and a programmer were in a car driving over a steep alpine pass when the brakes failed. The car was getting faster and faster, they were struggling to get round the corners and once or twice only the feeble crash barrier saved them from crashing down the side of the mountain. They were sure they were all going to die, when suddenly they spotted an escape lane. They pulled into the escape lane, and came safely to a halt.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "135": {
        "id": "7g0gp6",
        "premise": "I told my friend that his curly brown hair closely resembles wool.",
        "punchline": "He looked sheepish.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "136": {
        "id": "7g1bdn",
        "premise": "Did you hear about the kidnapping?",
        "punchline": "He woke up.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "137": {
        "id": "7g0g7c",
        "premise": "A group of adventurers walked into a bar.",
        "punchline": "\"You can't bring your weapons in here!\" the bartender yelled. \"Why would you want to, anyways?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "138": {
        "id": "7fzs47",
        "premise": "She came into the room and told me to take off bra and and panties and then she said",
        "punchline": "Stop wearing my clothes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "139": {
        "id": "7fpibe",
        "premise": "The year is 2064 and r/jokes is still going strong...",
        "punchline": "A new user gets on to r/jokes and sees the most upvoted joke just says \"28\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "140": {
        "id": "7g0djm",
        "premise": "It's weird. When you are a kid you want to be an adult, but then when you are an adult all you want to do is be with kids",
        "punchline": "I mean be a kid...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "141": {
        "id": "7fttsw",
        "premise": "All prostitutes...",
        "punchline": "starts off as noobstitutes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "142": {
        "id": "7g2gib",
        "premise": "JIF or GIF",
        "punchline": "Me:So how do you pronounce GIF as in graphic interchange format? Her:Well I'm in graphic design school they taught me to say GIF as in JIF the peanut butter? Me:Please tell me how you pronounce the first syllable in graphic Her:Guh Me:So you don't say Giraffe-ic Interchange Format but you say JIF That makes no sense Her:Well that's what I was taught Me:Well that's wrong Her:Well you can Jo fuck yourself",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "143": {
        "id": "7g2gf7",
        "premise": "It will not be long before a social warrior starts claiming",
        "punchline": "that physics is offensive. Like why is it called black hole? why not African American holes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "144": {
        "id": "7flrih",
        "premise": "A mormon was having an affair with a 15 year old girl who had lied about her age, when he learned the truth he broke it off and over the next few week guilt set in and he confessed to his wife. She screamed at him,",
        "punchline": "\"How could you cheat on me like that with an older woman!?!?!?\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "145": {
        "id": "7g2dwp",
        "premise": "Why was 6 afraid of 7 ?",
        "punchline": "... because they were playing craps and the point was set on 6!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "146": {
        "id": "7fzl6x",
        "premise": "(Q) why did hitler kill himself???",
        "punchline": "He looked at the gas bill...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "147": {
        "id": "7frs0a",
        "premise": "What goes up, and never comes down?",
        "punchline": "Your Comcast Bill.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "148": {
        "id": "7g12f8",
        "premise": "What do you get when you combine flour, eggs, sugar, fruit, and a man who thinks women are objects?",
        "punchline": "Crepe Culture.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "149": {
        "id": "7fzjjx",
        "premise": "3 drunk guys entered the taxi",
        "punchline": "The taxi driver knew that they were drunk so he started the engine & turned it off again. Then said, ''We have reached our destination''. The 1st guy gave him money & the 2nd guy said ''Thank you!.'' The 3rd guy slapped the driver. The driver was shocked thinking the 3rd guy knew what he did. But then he ask ''What was that for?''. The 3rd guy replied, Control your speed next time, you nearly killed us!''",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "150": {
        "id": "7fz0ve",
        "premise": "On my first day in prison, my cellmate said to me...",
        "punchline": "\"If you ever come close to me, I'll fucking skin you alive. When we're sleeping, you don't fucking touch me. You hear me? Don't ever talk to me, either.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "151": {
        "id": "7g2bh3",
        "premise": "Engineers",
        "punchline": "Four girls took lift in a car full of young engineers. Since the car was full, the girls had to sit on the laps of each guy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "152": {
        "id": "7fyydc",
        "premise": "What is the most frustrating math ?",
        "punchline": "Triggernometry",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "153": {
        "id": "7fzfty",
        "premise": "Donald Trump is visiting Queen Elizabeth.",
        "punchline": "Mr Trump turns to Queen Elizabeth and says \"I want to be a King.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "154": {
        "id": "7g29e2",
        "premise": "Why is everyone criticising Aji Pai?",
        "punchline": "I've only ever known Aji Pai as an American attorney as the Chairman of United States FCC who makes the best decisions. Aji Pai has always had my enjoyment as their primary concern and their community involvement is phenomenal.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "155": {
        "id": "7g0x8a",
        "premise": "I read recently that lion at the circus ate its tamer.",
        "punchline": "It was a true carnie-vore.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "156": {
        "id": "7fw4ly",
        "premise": "I tried to come up with an original joke",
        "punchline": "It ended up here",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "157": {
        "id": "7fvz78",
        "premise": "When a man says that he will do something, he will do it.",
        "punchline": "no need to remind him every 6 months",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "158": {
        "id": "7g26bm",
        "premise": "I used to be addicted to rolling around in pig shit",
        "punchline": "I've been clean for two years now.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "159": {
        "id": "7fz9n5",
        "premise": "How do you break the bad habit of procrastination?",
        "punchline": "...I'll tell you tomorrow.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "160": {
        "id": "7fypu1",
        "premise": "I was on hold with the IRS when an automated voice said, \"Please don't hang up. Your call is important to us.\"",
        "punchline": "That's all. That's the whole joke.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "161": {
        "id": "7fwytm",
        "premise": "Damn Amazon and their Black Friday deals",
        "punchline": "I ordered 4 Kindles and they sent me a 2 Ronnies DVD instead!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "162": {
        "id": "7fvkxz",
        "premise": "One day Donald Trump's nudes will leak...",
        "punchline": "And he'll do a press conference where he will announce: FAKE NUUUUDES",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "163": {
        "id": "7g24p6",
        "premise": "Why does time move slowly in the US?",
        "punchline": "Because their revolution's six years long.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "164": {
        "id": "7g2454",
        "premise": "If Hitler, Stalin, and EA were all in a room tied up and I had a gun with two bullets...",
        "punchline": "I'd shoot Toby twice.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "165": {
        "id": "7fyngx",
        "premise": "A classmate asked me if pears grow in America.",
        "punchline": "I told her to grow a pair and find out.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "166": {
        "id": "7fzt5j",
        "premise": "I can count on one hand how many times i have gone to Chernobyl",
        "punchline": "It's six",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "167": {
        "id": "7fvvgc",
        "premise": "Three Terrorists apply for ISIS ...",
        "punchline": "Q: Name?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "168": {
        "id": "7fv66m",
        "premise": "Why do Mormons get married on Black Friday?",
        "punchline": "Because they get 2 for 1.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "169": {
        "id": "7g0m4e",
        "premise": "Infinitely many people walk into a bar",
        "punchline": "The first person asks for a beer, the second person asks for two beers, the third asks for three and so on. The bartender gets 1/12 of a beer then everyone leaves.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "170": {
        "id": "7g1zfe",
        "premise": "As a mechanic, I learned to only date right handed girls",
        "punchline": "because righty tighty, lefty loosey.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "171": {
        "id": "7g1z57",
        "premise": "So I have two daughters...",
        "punchline": "One day my eldest daughter asked \"Dad why is my name Rose?\" \"Well when we were thinking of a name for you in the hospital a rose petal fell down and landed on your forehead, so we took it as a sign to call you Rose\" then my other daughter Fridge asked \"uhungh ungh uh uh uh AUGH?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "172": {
        "id": "7fy083",
        "premise": "Yesterday a couple of people came to my home and asked if I'd like to donate to the community pool…",
        "punchline": "I said \"sure, wait here.\" A minute later I came back from the sink with some water and said, \"just return the glass when you get a chance\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "173": {
        "id": "7fvmf4",
        "premise": "What Are You Here For?",
        "punchline": "Two kids are in hospital, in surgical gowns, sitting on their gurneys. “What are you here for?” asked the first child.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "174": {
        "id": "7fwpji",
        "premise": "As a kid I had a rare degenerative eye disease. Doctors couldn't help me so I got a second opinion from a donut.",
        "punchline": "To this day I still have a glazed look in my eyes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "175": {
        "id": "7g0jvq",
        "premise": "Jokes about communism aren't funny",
        "punchline": "Unless everyone gets them. (Credit: AdVenture Communist)",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "176": {
        "id": "7fwyvp",
        "premise": "If sex with animals is called beastiality...",
        "punchline": "Is sex with fat people called fatality?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "177": {
        "id": "7fyf1d",
        "premise": "There’s two mice chewing on a roll of film.",
        "punchline": "One of them says to the other, “I think the book was better”.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "178": {
        "id": "7frub1",
        "premise": "A man in is a golf course locker room when...",
        "punchline": "He hears a cell phone ringing and picks it up",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "179": {
        "id": "7g1vw6",
        "premise": "reddit is like a fence",
        "punchline": "the posts rot",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "180": {
        "id": "7fw6c3",
        "premise": "It's all binary",
        "punchline": "Wife: \"Honey, do you still find me attractive after all these years?\" Husband: \"You are a 10 in my book babe.\" Wife: \"You are so sweet.\" Husband: \"Not a thing dear, it's all binary to me.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "181": {
        "id": "7g1ule",
        "premise": "How does Lady Gaga like her steak?",
        "punchline": "Raw Raw, Raw Raw Raw!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "182": {
        "id": "7g1rrn",
        "premise": "What do you call a jew who can't mind their own business?",
        "punchline": "Nosy!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "183": {
        "id": "7g1ove",
        "premise": "I farted in a microsoft store",
        "punchline": "It's not my fault they don't have any macs",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "184": {
        "id": "7g2trb",
        "premise": "I want to write mystery novel",
        "punchline": "Or do I?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "185": {
        "id": "7fxmnf",
        "premise": "I've been searching...",
        "punchline": "...for almost 40 years for a toilet seat I don't fall through.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "186": {
        "id": "7fym16",
        "premise": "I loved dating a homeless girl",
        "punchline": "She let me drop her off anywhere",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "187": {
        "id": "7g1mv5",
        "premise": "Text my friend just sent",
        "punchline": "\"Be on alert for a possible hostile in your area by the name of Hu Mongous.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "188": {
        "id": "7fw0l6",
        "premise": "Man at a stop sign",
        "punchline": "So , a police officer is monitoring a road that has a stop sign and is known to be a problem for people who don't come to a full and complete stop.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "189": {
        "id": "7g1kbe",
        "premise": "Best jokes you've ever made up by yourself?",
        "punchline": "What do the patients at an ADHD/ADD doctor's office watch in the waiting room? ... ... ... Need for Speed",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "190": {
        "id": "7g0343",
        "premise": "My judge buddy told me about these two guys he had in his courtroom...",
        "punchline": "The two men were allegedly both involved in heinous crimes. The first man, Peter Phive, was accused of maliciously beating the second man, Willem Sephen. When questioned as to the motive of the attack, Mr. Phive claimed that Mr. Sephen murdered and consumed a dear friend of Mr. Phive's. The alleged victim was a Ms. Victoria Nighn.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "191": {
        "id": "7g1is1",
        "premise": "There was a conductor in North Korea...",
        "punchline": "There was a conductor in North Korea, known all through the country. One day, Kim Jong Un himself called the conductor and told him he was preforming for him next Wednesday. He got to work composing a new song immediately. By next Wednesday, his new composition was complete. His band was tuning their instruments and getting ready to preform. As his band started to play, they all played out of sync, to Kim's displeasure. So, not being the forgiving type, Kim sent him to be executed. When the conductor was asked what he'd like his last meal to be, he said \"a spicy curry, hot as can be!\" So he ate the curry, eyes tearing up. He was then taken to the electric chair to be executed. Kim turned on the chair. Sparks flew and smoke filled the room. The conductor was completely unharmed. Kim, being impressed by this, gave him another chance to preform. He started composing right away, this time, his masterpiece. The time comes for him to preform, and his band absolutely blows it. Kim, once again annoyed by this, sends him to be executed once again. When asked what he'd like his last meal to be, he said \"The spiciest curry on the planet!\" So he ate the curry, sweating and eyes tearing up. He was sent to the electric chair. Kim turned it on, Sparks flew and smoke filled the room. The conductor was once again unharmed. Kim, still being impressed by this, gave the conductor one final chance to prove himself. He started conducting his song, greater than the world's ever seen. His time came to preform, and his band played out of tune and out of sync. For the last time, he was sent to be executed. When he was asked what he wanted for his last meal, he said \"the spiciest curry ever made!\" Kim responded \"No! No more spicy curries! You go straight to the chair!\" They sent him off to the chair, and Kim pulled to switch. Sparks flew and smoke filled the room, but the conductor was still unharmed. Kim, astounded, said \"What! How is this possible? You had no curry. How did you survive?\" The conductor simply replied: \"Oh, it has nothing to do with the curry. In just a horrible conductor!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "192": {
        "id": "7ftc0j",
        "premise": "A woman arrives at the pearly gates and meets Peter....",
        "punchline": "Peter says right this way. As they start to go the woman hears a whizzing noise like a drill and a blood curdling scream. She looks terrified and says \"What's that?!\" Peter says \"it's ok that's just the lady before you. They're just drilling a hole in the back of her head to fit her halo. Don't worry it only hurts for a second.\" Not entirely comforted the woman continues walking. They hear the whizz and scream again. The blood drains from the woman's face \"What's that now?!\" Peter calmly replies \"No need for alarm, just a few more holes. That's just them drilling to fit her wings.\" The women is terrified and says \"ok, nope I'm done i want to go down there instead,\" gesturing to hell. Peter is shocked and says \"oh no you don't want to do that! They'll rape and sodomise you down there!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "193": {
        "id": "7fw37j",
        "premise": "Maybelline is for the weak,",
        "punchline": "Strong women use Canbelline.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "194": {
        "id": "7fq8gg",
        "premise": "10 years ago to this day, I cut myself with a stick of RAM",
        "punchline": "I guess you could say I have a pretty sharp memory.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "195": {
        "id": "7fp59q",
        "premise": "A man and a dog are playing chess",
        "punchline": "A woman walks in and says \"holy crap, your dog can play chess?! That's amazing! What a brilliant dog! \"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "196": {
        "id": "7fyyva",
        "premise": "What do you call an owl that loves to raise owlets?",
        "punchline": "A hoot-nanny!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "197": {
        "id": "7fyurw",
        "premise": "I like to spend every day as if its my last",
        "punchline": "Lying in a pool of my own urine and calling for a nurse to bring me more pudding",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "198": {
        "id": "7foape",
        "premise": "Imagine the guy who invented maple syrup...",
        "punchline": "Hey this tree tastes way better than the last 10 trees I sucked!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "199": {
        "id": "7fys27",
        "premise": "My favourite song to play is \"Welcome To The Jungle\".",
        "punchline": "Especially when I'm trimming my arse hair.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "200": {
        "id": "7g16cw",
        "premise": "I traded my wife in for a dump truck...",
        "punchline": "I wanted something with a smaller box",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "201": {
        "id": "7fznt7",
        "premise": "Two police officers crash their car into a tree...",
        "punchline": "After a moment of silence, one of them says, “Wow, that’s got to be the fastest we ever got to the accident site.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "202": {
        "id": "7g15ey",
        "premise": "Why couldn't Hitler pass his driver's test?",
        "punchline": "He kept stepping on the gas.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "203": {
        "id": "7fukkw",
        "premise": "Did you hear about all the kids who were shipped off to mime school?",
        "punchline": "They were never heard from again.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "204": {
        "id": "7g2dtx",
        "premise": "A man bets his friend that he can make a log cabin in 45 minutes",
        "punchline": "A man bets his friend that he can make a log cabin in 45 minutes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "205": {
        "id": "7fylex",
        "premise": "My friend was mad when i beat him at a round of golf.",
        "punchline": "I had told him i was subpar.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "206": {
        "id": "7fxag2",
        "premise": "What did the nut say when it was chasing the other nut?",
        "punchline": "I'm a cashew",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "207": {
        "id": "7g11cu",
        "premise": "Why did the tweaker cross the road?",
        "punchline": "Because he's pretty sure he saw something over there.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "208": {
        "id": "7g10ms",
        "premise": "The south of France.",
        "punchline": "I once knew a girl from the south of France",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "209": {
        "id": "7g0zau",
        "premise": "In the USA government, there is a newly emerging joke...",
        "punchline": "that all government officials holding high positions laugh at. “We the people”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "210": {
        "id": "7fw1ts",
        "premise": "I just saved a bunch of money on my car insurance....",
        "punchline": "by running away from the accident!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "211": {
        "id": "7fzgmw",
        "premise": "I tried to come out to my parents as omnipresent...",
        "punchline": "But it's kind of hard to come out of the closet when you're everywhere at once",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "212": {
        "id": "7fyg2n",
        "premise": "It’s inappropriate to make a ‘dad joke’ if you are not a dad.",
        "punchline": "It’s a faux pas.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "213": {
        "id": "7futo6",
        "premise": "Someone called me pretentious today.",
        "punchline": "I nearly choked on my honey-cardamom latte.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "214": {
        "id": "7fyb7j",
        "premise": "The perfect gift for somebody who is always complaining that they have no money to buy gifts for all their kids at Christmas...",
        "punchline": "A box of condoms.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "215": {
        "id": "7fwk0i",
        "premise": "My uncle died of asbestosis.",
        "punchline": "It took 3 weeks to cremate him.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "216": {
        "id": "7fsrkp",
        "premise": "I lost my watch in a party once.",
        "punchline": "An hour later I saw some guy stepping on it while he was harassing some woman at that party. Infuriated, I immediately went over there, punched him and broke his nose. No one does that to a woman, not on my watch.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "217": {
        "id": "7fxh8c",
        "premise": "Why did the gamete take its clothes off?",
        "punchline": "Because sex cells",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "218": {
        "id": "7g0oyr",
        "premise": "Kleptomaniac friend told me he found the cure for obesity.",
        "punchline": "Wouldn't say what it is, but he insists that it's easy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "219": {
        "id": "7fo9hm",
        "premise": "Men call short women \"petite\". What do women call short men?",
        "punchline": "Um, yeh, they don't call.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "220": {
        "id": "7fws2x",
        "premise": "Donald trump invite's kim jong un and a Trump supporter to go golfing",
        "punchline": "Donald Trump invite's kim Jong Un and a Trump supporter to go golfing. Donald Trump invited kim Jong Un to go golfing to discuss the politital situation between their countrys and also a Trump supporter to give his opinion on things. Donald Trump hit his golf ball and it smashs straght through someones window, All 3 of them go to the house to pay for the damaged window when they ring the door bell a butler answers \"how many I help you fine gentelmen\" Donald then said \"Hi I'd like to talk to the owner we accidentally broke your window\" but before Donald could finish his sentence the butler starts to scream and runs off, curios the 3 men walk inside to see what happend, they walk inside and see ghost like figure, it speeks to them you 3 have released me from my prison I am a genie and I was traped in the vase that you hit and broke with your golf ball for 300 years and for freeing me I will give each of you 1 wish. The trump supporter goes first \"I wish for infinate money\" The genie gave the Trump supporter a credit card and a piace of paper with bank informantion on it and said \"when ever you need money no matter how much you can withdrawal it from this bank account without ever paying tax, Then Kim Jong Un makes a wish \"I wish for a huge wall all around North Korea to protect us from danger and to make sure my people can't escape\" The genie then said \"there is now a wall all around North Korea to protect your people and make sure they can't escape\" Donald trumps eyes widen \"A wall? tell me more about this wall\" The genie then said \"this wall is 150 feet tall and 50 feet wide\" Donald trumps eyes widen even more \"Okay now fill it with water\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "221": {
        "id": "7fmdsg",
        "premise": "What's the difference between a female farmer and Hitler's girlfriend?",
        "punchline": "One bails her hay and the other heils her bae",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "222": {
        "id": "7g0lx3",
        "premise": "What's another name for an ice cream truck?",
        "punchline": "An a la mode of transportation",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "223": {
        "id": "7fp0jz",
        "premise": "I posted a Joke involving a cow, but it was a little offensive apparently so I'll take it down",
        "punchline": "[remooooved]",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "224": {
        "id": "7frw6q",
        "premise": "A woman is standing looking in the bedroom mirror…",
        "punchline": "She is not happy with what she sees and says to her husband, “I feel horrible;",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "225": {
        "id": "7fvxo0",
        "premise": "With Prince Harry and Meghan Markle getting engaged, it’s great to progress past old prejudices.",
        "punchline": "Fair play to her for agreeing to marry a ginger.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "226": {
        "id": "7fwnfb",
        "premise": "By far the best black friday deal of 2017...",
        "punchline": "My bank account, with a 100% balance discount.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "227": {
        "id": "7fxwfy",
        "premise": "What do you call a communist pop star?",
        "punchline": "John Lenin.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "228": {
        "id": "7ftypn",
        "premise": "A slightly overweight transgendered person walks into a health food store",
        "punchline": "the manager instantly runs up and tells her to leave the store, \"why?\" she asks confusedly, the manager points angrily at a sign on the door",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "229": {
        "id": "7fyvhw",
        "premise": "New dishwasher launched on the market...",
        "punchline": "5 wounded and 2 deaths.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "230": {
        "id": "7fsghh",
        "premise": "A recent survey found only 20% of parents were eating dinner with their children...",
        "punchline": "...the other 80% were using a knife and fork.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "231": {
        "id": "7fwj3p",
        "premise": "I started to learn sign language today.",
        "punchline": "You should too, it’s really handy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "232": {
        "id": "7fwhb1",
        "premise": "A man went to the doctor's, concerned about his liver...",
        "punchline": "The doctor asked: \"When do you typically drink?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "233": {
        "id": "7fp954",
        "premise": "What do you call a book club that’s been stuck on one book for years?",
        "punchline": "Church",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "234": {
        "id": "7fxr80",
        "premise": "What's a horses favorite pasta sauce?",
        "punchline": "Boloneighs",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "235": {
        "id": "7fyput",
        "premise": "How does Louis CK respond to a sexual proposal?",
        "punchline": "He says,\"Ive gotta hand it too you.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "236": {
        "id": "7fyo4x",
        "premise": "Why are German Cats Depressed?",
        "punchline": "They have Nein Lives",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "237": {
        "id": "7fvm8r",
        "premise": "I Have Your Aspirin",
        "punchline": "A husband emerged from the bathroom naked and was climbing into bed when his wife once again complained, \"I have a headache.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "238": {
        "id": "7fyn73",
        "premise": "Three guys are hiking in the woods when they find an old lamp.",
        "punchline": "One of them picks it up, rubs it, and out pops a Genie. It booms “You have finally freed me after all these years, so I’ll grant each one of you 3 wishes.” The first guy immediately blurts out “I want a billion dollars.” POOF, he’s holding a printout that shows his account balance is now in fact 1,000,000,003.50 The second man thinks for a bit, then says “I want to be the richest man alive.” POOF, he’s holding papers showing his net worth is now well over 100 billion. The third guy thinks even longer about his wish, then says “I want my left arm to rotate clockwise for the rest of my life.” POOF, his arm starts rotating. The Genie tells them it’s time for their second wish. First guy says: “I want to be married to the most beautiful woman on earth.” POOF, a stunning beauty wraps herself around his arm. Second guy says “I want to be good-looking and charismatic, so I can have every girl I want.” POOF, his looks change and the first guy’s wife immediately starts flirting with him. Third guy says “I want my right arm to rotate counter-clockwise until I die.” POOF, now both his arms are rotating, in opposite directions. The genie tells them to think very carefully about their third wish. First guy does, and after a while says “I never want to become sick or injured, I want to stay healthy until I die.” POOF, his complexion improves, his acne is gone and his knees don’t bother him any more. Second guy says “I never want to grow old. I want to stay 29 forever.” POOF, he looks younger already. Third guy smiles triumphantly and says “My last wish is for my head to nod back and forth.” POOF, he’s now nodding his head and still flailing his arms around. The genie wishes them good luck, disappears, and the men soon go their separate ways.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "239": {
        "id": "7g08nd",
        "premise": "Swear words have officially been banned.",
        "punchline": "Now people greet each other by saying \"howdy,\" power is generated by the giant pile of concrete in the river, and the U.S. is a large patch of land.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "240": {
        "id": "7fxl5q",
        "premise": "No Shave November",
        "punchline": "At first I didn't like the facial hair I had. But as I waited I started to like the beard more and more. One might say its...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "241": {
        "id": "7fwsov",
        "premise": "Oliver Twist steps up to the master and says...",
        "punchline": "\"Please Sir. I want some more.\" The master leans over the table and glowers down at the boy. \"Everyday you ask for more, and everyday you get a thrashing for it. Now tell me boy, is the gruel really that good?\" \"No Sir, but I love the thrashing.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "242": {
        "id": "7fyhir",
        "premise": "John Conyers, Al Franken, and Roy Moore walk into a bar",
        "punchline": "What happens next is subject to a mutually binding Non-Disclosure Agreement",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "243": {
        "id": "7fmxti",
        "premise": "The Catholic Church absolutely agrees on homosexuals getting married...",
        "punchline": "... As long as a gay marries a lesbian.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "244": {
        "id": "7fw5ru",
        "premise": "I attacked a man with a spliff yesterday...",
        "punchline": "I was charged with \"assault using a blunt instrument\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "245": {
        "id": "7g01zh",
        "premise": "What did one karma farmer say to the other karma farmer whilst making the love?",
        "punchline": "“You are doing that too much. Please try again in 10 minutes.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "246": {
        "id": "7fwo6o",
        "premise": "If I was dissing someone’s butt...",
        "punchline": "Would you call it a rump roast?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "247": {
        "id": "7g01fo",
        "premise": "Prince Harry and Meghan Markle",
        "punchline": "He's thinking of his offspring. The Royal Bloodline will finally have some melanin.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "248": {
        "id": "7fxcuj",
        "premise": "What kind of jeans does Mario wear?",
        "punchline": "Denim Denim Denim",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "249": {
        "id": "7fvm1l",
        "premise": "Thinking of becoming a cannibal.",
        "punchline": "If I had to resort to cannibalism, I would want the person I’m eating to be a vegetarian. I like irony and prefer grass-fed steak.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "250": {
        "id": "7fn0do",
        "premise": "Sometimes I tuck my knees into my chest and lean forward",
        "punchline": "That's just how I roll",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "251": {
        "id": "7fzwg2",
        "premise": "What do you call an electric elephant?",
        "punchline": "Elon Tusk",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "252": {
        "id": "7g1cy3",
        "premise": "My grandma fell and couldn't get up.",
        "punchline": "We tell everyone she moved to Floorida.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "253": {
        "id": "7fwglv",
        "premise": "Did you hear the one about the time traveling joke?",
        "punchline": "It was a repost.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "254": {
        "id": "7fq2y7",
        "premise": "A grasshopper walks into a bar",
        "punchline": "and the bartender says, \"Hey, we have a drink named after you!\" The grasshopper looks surprised and asks, \"You have a drink named Steve?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "255": {
        "id": "7g2j0m",
        "premise": "Why was a gay programmer assaulted on New Years 1999?",
        "punchline": "They thought it was Y2Gay.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "256": {
        "id": "7fzs7w",
        "premise": "Old chefs joke answer: Why did you become a chef?",
        "punchline": "The bad hours and I like to cut myself.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "257": {
        "id": "7frf2d",
        "premise": "If Caitlin Jenner was a super hero",
        "punchline": "Would she be an X-man or a Transformer?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "258": {
        "id": "7fuuhw",
        "premise": "A guy walks into an eletronics store",
        "punchline": "Employee: Hello Sir, how may I be of assistance",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "259": {
        "id": "7ftq8r",
        "premise": "What's the difference between Jesus and a photo of Jesus?",
        "punchline": "The photo needs only one nail to hang.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "260": {
        "id": "7fu828",
        "premise": "\"The elephant is vegetarian\" I smugly declared as I put on my scientist's hat.",
        "punchline": "\"Oh, and how would you know that?\" retorted my wife, as she often does when I make such sweeping assertions.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "261": {
        "id": "7fzjpf",
        "premise": "Porn really does not imitate real life.",
        "punchline": "Last time i broke into a woman's house and she caught me, she called the cops.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "262": {
        "id": "7fmg0z",
        "premise": "A kid asked his dad..",
        "punchline": "Kid: Dad, what is an alcoholic? Dad: You see these 4 cars, an alcoholic would see 8 cars. Kid: But there are only 2 cars.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "263": {
        "id": "7fuyq6",
        "premise": "I hate my anus...",
        "punchline": "Always on my ass, giving me shit.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "264": {
        "id": "7frbc4",
        "premise": "If I could have dinner with one person, alive or dead, I think I would probably choose...",
        "punchline": "alive.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "265": {
        "id": "7fzgyh",
        "premise": "What kinda gum?",
        "punchline": "Fugum'",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "266": {
        "id": "7fzfuk",
        "premise": "What do you call a British singer with a penchant for mysteries?",
        "punchline": "Sue Arthur Conan Boyle.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "267": {
        "id": "7g0xds",
        "premise": "Where is the best place to hide little boys in your house?",
        "punchline": "The Crawl Spacey",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "268": {
        "id": "7fzdjv",
        "premise": "I tried my first bull riding at my local rodeo and was instantly kicked off",
        "punchline": "That dirty bucker",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "269": {
        "id": "7fzc9d",
        "premise": "What did the pirates mates give him when he had his penis chopped off in battle?",
        "punchline": "A woodpecker.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "270": {
        "id": "7fzc5k",
        "premise": "The pen isnt mightier than the sword....",
        "punchline": "A Chicago Typewriter is.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "271": {
        "id": "7frwoe",
        "premise": "An elderly man and woman meet in a bar",
        "punchline": "An elderly man and woman meet in a bar and get to talking. They are enjoying their conversation so much that, when the bar closes, they decide to continue at the woman's apartment. After a time, things start getting pretty romantic and they wind up in bed. Afterward, they're both laying there, staring at the ceiling.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "272": {
        "id": "7fv1cf",
        "premise": "What’s the best thing you can do if you see a kidnapping?",
        "punchline": "You let them get their rest",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "273": {
        "id": "7fz7hp",
        "premise": "My friend told me that he liked the new Battlefront game...",
        "punchline": "God rest his soul",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "274": {
        "id": "7ftxic",
        "premise": "Never hit a man with glasses...",
        "punchline": "Hit him with a baseball bat.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "275": {
        "id": "7fz5fh",
        "premise": "How far into the ocean will Roadrunner go?",
        "punchline": "Knee deep.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "276": {
        "id": "7fxehk",
        "premise": "I met this beautiful girl that just made me blush uncontrollably today.",
        "punchline": "She pulled down my pants in the cafeteria and everyone laughed at my animal patterned underwear.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "277": {
        "id": "7fwdjc",
        "premise": "As I was walking down the street, I was going past a prison and heard alarms sounding and guards shouting.",
        "punchline": "I looked up to see a dwarf scaling down the wall. He got further down and saw me looking at him, and started shouting and swearing at me, and I couldn't help but think:",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "278": {
        "id": "7fqvxu",
        "premise": "What did the two tampons say to each other?",
        "punchline": "Nothing, they were both stuck up cunts.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "279": {
        "id": "7fxd62",
        "premise": "There is a ghost in my moms house",
        "punchline": "All the dirty plates dissapear and there's endless clean cutlery? Im like where does it all come from",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "280": {
        "id": "7frtcp",
        "premise": "I really don't trust stairs...",
        "punchline": "... they are always up to something.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "281": {
        "id": "7fz23r",
        "premise": "[OC]Hannibal goes to a convention",
        "punchline": "Hannibal goes to a convention dressed up as himself, and to his surprise no one there knows who he is. After scouring for hours, he decides to put on a name tag but still nothing. He then goes around and strikes up conversations but no one seems to recognize his name. He's furious and decides to give up. Later on he's invited into the stage for a q&a session, but when his turn comes up the room suddenly goes quiet. Even the announcers are flustered and start wondering why he was given stage access. To not make a big spectacle out of it, they start asking him about what he does to get a better idea of who he might be. He then explains what he is and what he does and some silent \"ohhhh\"s are heard in the crowd. After a few more seconds of silence, one guys stands up and says \"so..like that guy, Cannibal\"?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "282": {
        "id": "7fufmc",
        "premise": "Everyone and everything has great potential",
        "punchline": "For example, today I was circulating through a furniture shop and saw an unplugged lamp that looked like it could really light up a room if only it was given the opportunity to shine",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "283": {
        "id": "7g0itp",
        "premise": "What do you call a running backs retarded child?",
        "punchline": "First downs",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "284": {
        "id": "7g0im5",
        "premise": "Why do basic white girls only use odd numbers?",
        "punchline": "Because they \"can't even\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "285": {
        "id": "7fytw7",
        "premise": "At first I was really worried about developing back hair.",
        "punchline": "But now it's growing on me.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "286": {
        "id": "7fmv5t",
        "premise": "Is it wrong to hate a specific race?",
        "punchline": "Because I really hate marathons",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "287": {
        "id": "7fymc1",
        "premise": "Why was the beach wet and smelly?",
        "punchline": "The sea weed",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "288": {
        "id": "7fn252",
        "premise": "Martians arrive on earth",
        "punchline": "They're peaceful and happy and everyone loves them. Obviously humanity has tons of questions they'd like to ask them so the U.N. decides to arrange a conference. All the world leaders, public intellectuals and religious heads are in attendance to ask their most burning questions. Finally it is the pope's turn to ask a question... \"I was wondering...have you ever heard of our lord and savior Jesus Christ\" the pope asks. \"Jesus? Yes of course! He stops by our planet every couple of years and we all have a big party\" the aliens respond The pope looks baffled and says \"You must be mistaken...Jesus Christ was here about two thousand years ago but he left and we've been waiting for his return ever since...why would he visit you so often?\" \"well...\" they look at each other \"...maybe your chocolate wasn't good\" the aliens offer \"Pardon me?\" the pope asks \"Well, when Jesus first showed up on our planet we gave him really great chocolate...what did you guys do?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "289": {
        "id": "7fylqq",
        "premise": "Hey, I heard that the children that Donald Trump illegitimately fathered with daughter Ivanka are now allowed to join the family at the table for all meals, not just the morning meal...",
        "punchline": "Orange Jews - not just for breakfast anymore!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "290": {
        "id": "7g1n64",
        "premise": "Is Food or Water More Important?",
        "punchline": "Heroin",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "291": {
        "id": "7g1228",
        "premise": "Whta did the poop say to the asshole?",
        "punchline": "We've been THROUGH a lot together!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "292": {
        "id": "7fwu6i",
        "premise": "Where do populists go to worship?",
        "punchline": "... the demagogue.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "293": {
        "id": "7fyixt",
        "premise": "Sinusoidal functions",
        "punchline": "Depressed functions that are feeling sinusoidal kill themselves with a hypotenuse.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "294": {
        "id": "7ftakg",
        "premise": "Agnes married and had 13 children...",
        "punchline": "Agnes married and had 13 children. When her husband died, she married again and had 7 more children. Again, her husband died. So Agnes remarried and this time had 5 more children. Alas, she finally died. Standing before her coffin, the preacher prayed for her. He thanked the Lord for this very loving woman and said, Lord, theyre finally together. One mourner leaned over and quietly asked her friend, \"Do you think he means her first, second or third husband?\" The friend replied, \"I think he means her legs.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "295": {
        "id": "7fyemj",
        "premise": "How does a communist start a race?",
        "punchline": "On your marx...get set...GO!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "296": {
        "id": "7fydzo",
        "premise": "I don't understand why people are so scared of no net neutrality",
        "punchline": "All you need is access to Google",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "297": {
        "id": "7fydud",
        "premise": "What did the procrastinator say to his math homework?",
        "punchline": "I’ll calc you later!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "298": {
        "id": "7fqyf2",
        "premise": "After Beethoven died and they buried him, you could hear his symphonies from the grave in the descending order, first his symphony No. 9, then No. 8 etc.",
        "punchline": "He was just decomposing.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "299": {
        "id": "7fycqv",
        "premise": "Violent killer whales really get me off",
        "punchline": "I like to watch tilikum",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "300": {
        "id": "7fyarw",
        "premise": "Why doesn't the law permit a man to marry a second woman?",
        "punchline": "Because the law says you cannot be punished twice for the same offense.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "301": {
        "id": "7fvmn9",
        "premise": "If someone can give me advice about hinges",
        "punchline": "My door is always open.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "302": {
        "id": "7fs4jm",
        "premise": "What dating app do Catholic Priests use?",
        "punchline": "Amber Alerts.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "303": {
        "id": "7fy7fv",
        "premise": "Just got through a nasty divorce with my wife of fifteen years.",
        "punchline": "She's a tightrope walker.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "304": {
        "id": "7fy6mq",
        "premise": "Why did the uptight asian father send his kid to a different dentist?",
        "punchline": "Because they recommended for his son to use Oral B.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "305": {
        "id": "7fuz0z",
        "premise": "Ever since I was a child, I’ve always had a fear of someone under my bed at night.",
        "punchline": "So I went to a Psychiatrist and told him I’ve got problems.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "306": {
        "id": "7fy5g5",
        "premise": "Why don't pimps repeat themselves",
        "punchline": "That's just beating dead whores",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "307": {
        "id": "7fy4n4",
        "premise": "An UPDATE to the 'an engineer dies' joke",
        "punchline": "An Engineer dies, and goes to Hell. Dissatisfied with the level of comfort down there, he starts designing and building improvements. After a while Hell has air conditioning, flush toilets and escalators. The engineer is a pretty popular guy. One day God rings down and asks Satan,\"So, how's it going down there?\" Satan says, \"Hey things are going great. We've got air conditioning and flush toilets and escalators, and there's no telling what this engineer is going to come up with next.\" God is horrified. \"What? You've got an engineer? That's a mistake - he should never have gone down there! You know all engineers go to Heaven. Send him back up here!\" Satan says, \"No way. I like having an engineer on the staff.. I'm keeping him\". God says, \"Send him back up here or I'll see that a law is passed saying what you're doing is illegal\". \"Yeah, right,\" Satan laughs, \"and where are you going to find a politician ?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "308": {
        "id": "7fwc37",
        "premise": "'The head of the Catholic Church is far superior to the head of the Church of England'",
        "punchline": "... said Sean, the promiscuous, and disloyal Altar Boy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "309": {
        "id": "7fy2el",
        "premise": "The last time I won a race...",
        "punchline": "My mom got pregnant.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "310": {
        "id": "7fy1os",
        "premise": "My girlfriend broke up with me.",
        "punchline": "I wrote in a diary of all the things that showed my passionate love for her. The roses and her favourite chocolates, Lindor, she loved them. The worst thing that hit the deep abyss of my feelings and crushed emotions was that she left the day after...let me describe it to you. Day 1. We went into Central London and it was the greatest day of my life. This is the before we broke up with me by the way. We were on a high street and I bought her a Gucci tracksuit. She loved me forever from that point or so I thought. Day 2. We went to wagamamas, the lovely noodle place, and we enjoyed our time. I loved her and my everlasting fire for her blazed. I bought her a Versace necklace. Day 3. We had a bitta.. Netflix 'n' chill. That night our love grew so far. Our bond was stronger than Satan's hate against Jesus and God's will. It was nothing like I've ever felt before.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "311": {
        "id": "7fwace",
        "premise": "What is the favorite ice cream of a Nigerian prince?",
        "punchline": "Ben & Jerry’s Phish Food",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "312": {
        "id": "7fm43n",
        "premise": "Grandpa & grandson",
        "punchline": "A woman in a supermarket is following a grandfather and his badly-behaved grandson. He has his hands full with the child screaming for candy, cookies, all sorts of things.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "313": {
        "id": "7fuv0n",
        "premise": "I remember the first time I ever saw a Universal Remote Control",
        "punchline": "I thought 'well, this changes everything'.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "314": {
        "id": "7fxycu",
        "premise": "When my sister was young and on crutches...",
        "punchline": "...She was getting into the car and was telling our mom about an insect she saw - that she swore wasn't a spider, yet had eight legs. \"It can't be an insect, because insects only have six legs.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "315": {
        "id": "7fzmt1",
        "premise": "Irl: As I lay in bed with my wife in a loving embrace she says \"I don't know what I'd be doing without you\"",
        "punchline": "I reply \"Probably lots of drugs\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "316": {
        "id": "7fxy8x",
        "premise": "I got a sweater for Christmas...",
        "punchline": "I was hoping for a moaner or a screamer.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "317": {
        "id": "7fq2pi",
        "premise": "What’s the worst part about locking your keys in your car outside an abortion clinic?",
        "punchline": "Having to go inside and ask for a coat hanger.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "318": {
        "id": "7fxu3d",
        "premise": "Today a classmate threw a tippex at me.",
        "punchline": "It was a white weapon attack.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "319": {
        "id": "7fw3l3",
        "premise": "What is a Kansas pirate’s favorite state?",
        "punchline": "Arrrrkansas",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "320": {
        "id": "7fspzm",
        "premise": "I was wondering why it was so dark outside...",
        "punchline": "Then it dawned on me",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "321": {
        "id": "7fuqd4",
        "premise": "Best lock in the world.",
        "punchline": "Wedlock.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "322": {
        "id": "7fw2gq",
        "premise": "Yearbook doesn't take time,",
        "punchline": "It takes pictures.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "323": {
        "id": "7fv6eg",
        "premise": "I used to get disgusted by people with skin yeast infections..",
        "punchline": "But now it's kinda growing on me.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "324": {
        "id": "7fxp6c",
        "premise": "Two old men were talking about computers the other day....",
        "punchline": "As they were talking about them, they got to mentioning all their great features that have come through the years. The men talked about touch screens, faster computers, and last of all memory.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "325": {
        "id": "7frqr0",
        "premise": "What's black and stuck to the wall?",
        "punchline": "A bad electrician.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "326": {
        "id": "7fov6g",
        "premise": "Hitler went to a fortune teller and asked her, \"On what day will I die?\"",
        "punchline": "The fortune teller assured him that he would die on a Jewish holiday. \"Why are you sure of that?\" demanded Hitler.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "327": {
        "id": "7fmfe5",
        "premise": "Harry Potter can't tell the difference between his cooking pot and his best mate.",
        "punchline": "They're both cauldron.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "328": {
        "id": "7fxiyo",
        "premise": "If white people can't handle spicy food...",
        "punchline": "Then tell me how I just ate a PB&J sandwich without crying.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "329": {
        "id": "7frgoy",
        "premise": "A Roman walks into a bar...",
        "punchline": "A Roman walks into a bar. He holds up two fingers and says to the bartender, “I’ll have five beers please.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "330": {
        "id": "7fns74",
        "premise": "Tip for when you are attacked by a bear",
        "punchline": "Play dead.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "331": {
        "id": "7fxdu5",
        "premise": "I never get jokes about planes",
        "punchline": "They always go over my head!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "332": {
        "id": "7fqrmg",
        "premise": "My dad taught me everything I know about passing gas.",
        "punchline": "I've been under his tootelage my whole life.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "333": {
        "id": "7fssgu",
        "premise": "Little Johnny returns to school after Thanksgiving break,..",
        "punchline": "and the teacher asks the class if anyone had an experience they learned from over the vacation. The first child raises their hand and says, \"I spilled my milk at dinner and I learned not to cry over spilled milk.\" The teacher says very good and calls on Little Johnny next. Johnny launches into a story, \" One time in Vietnam my uncle was trapped behind enemy lines with nothing but a bottle of whiskey, an M16 with 30 bullets and a bayonet surrounded by 50 enemy troops. First he drank the whole bottle then shot 30 men then stabbed the last 20 with his bayonet and walked back to his camp.\" The whole class was stunned into silence. Finally the teacher gets her wits about her and says to Johnny, \"That was an amazing story, but what lesson did you learn from that?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "334": {
        "id": "7fvo39",
        "premise": "Where do triumphant water fowl get their underwear?",
        "punchline": "Victorious egret",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "335": {
        "id": "7fx5p0",
        "premise": "There's this girl who has been picked up so many times",
        "punchline": "She's starting to grow a handle.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "336": {
        "id": "7focfu",
        "premise": "Having sex is like playing bridge...",
        "punchline": "If you don't have a good partner, you'd better have a good hand.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "337": {
        "id": "7frgoi",
        "premise": "An old man and a child walk into the woods",
        "punchline": "The child says “Why are we here, I’m scared.” The old man replies: “You’re scared?!?! I’m gonna have to walk back out alone.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "338": {
        "id": "7fwwg8",
        "premise": "Did you hear about the optician who died last week?",
        "punchline": "He fell into his lens grinder and made a spectacle of himself.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "339": {
        "id": "7fn09s",
        "premise": "Two deaf-mute kids were arguing.",
        "punchline": "The mother came and turned off the light.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "340": {
        "id": "7fv8he",
        "premise": "Rusi & Jeroo",
        "punchline": "At 85 years of age, Rusi married Jeroo, a lovely 25 year old. Since her new husband is so old, Jeroo decides that after their wedding she and Rusi should have separate bedrooms, because she is concerned that her new but aged husband may overexert himself if they spend the entire night together.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "341": {
        "id": "7frsqt",
        "premise": "Heard someone say this and it made me smile",
        "punchline": "‘Thank God I’m an atheist’",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "342": {
        "id": "7fwpd2",
        "premise": "What’s the difference between alkalinity and pOH?",
        "punchline": "They’re basically the same.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "343": {
        "id": "7fwpc4",
        "premise": "What’s a Klan member’s favourite Christmas song?",
        "punchline": "White Christmas",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "344": {
        "id": "7fwnue",
        "premise": "Me: [licking lips in anticipation] I'm nervous. I've never done a bungee jump before.",
        "punchline": "Instructor: That is okay but do not lick my lips again.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "345": {
        "id": "7fwn8l",
        "premise": "A man walks into a bar and orders 10 shots of whiskey.",
        "punchline": "The bartender pours them and the guy starts downing them.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "346": {
        "id": "7fp3gy",
        "premise": "A guy enters the pharmacy...",
        "punchline": "Guy: 5 packs of condoms please.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "347": {
        "id": "7fwjxy",
        "premise": "Canada",
        "punchline": "I'm sorry...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "348": {
        "id": "7frj0b",
        "premise": "Jack had been a compulsive worrier for years",
        "punchline": "to the point it was ruining his life. He saw a psychologist who recommended a specialist who could help him. His friend, Bob, noticed a dramatic change and asked, \"What happened? Nothing seems to worry you anymore.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "349": {
        "id": "7fs1qc",
        "premise": "Why don’t blind people go skydiving?",
        "punchline": "Because it scares their service dogs too much",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "350": {
        "id": "7fweet",
        "premise": "\"Thank you for the Gold kind stranger\"",
        "punchline": "said the robber as he stole my necklace, \"This will last me a year\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "351": {
        "id": "7fprrz",
        "premise": "First bird gets the worm, second mouse gets the cheese but the third wife gets",
        "punchline": "The White House",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "352": {
        "id": "7fmugp",
        "premise": "Translated Chinese joke",
        "punchline": "Good news: Today is the little Johnny's first time flying!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "353": {
        "id": "7fttf5",
        "premise": "Nymphomaniac Convention",
        "punchline": "A man boarded an aircraft at London's Heathrow Airport for New York and taking his seat as he settled in, he noticed a very beautiful woman boarding the plane.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "354": {
        "id": "7fgbs0",
        "premise": "A worldwide survey was conducted by the UN...",
        "punchline": "The only question asked was: \"Would you please give your honest opinion about solutions to the food shortage in the rest of the world?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "355": {
        "id": "7finye",
        "premise": "My drug dealer started dressing up as a Jehovah's Witness so he wouldn't arouse suspicion.",
        "punchline": "He eventually got arrested after the police saw that people let him in",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "356": {
        "id": "7fgvx6",
        "premise": "Statistics show that the average person has sex 89 times per year.",
        "punchline": "Looks like I'm in for a pretty wild December.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "357": {
        "id": "7frtop",
        "premise": "I’m a big country fan",
        "punchline": "China is one of my favourites",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "358": {
        "id": "7fvz00",
        "premise": "Why won't the heat death of the universe be so bad?",
        "punchline": "Because everything is going to be 0K",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "359": {
        "id": "7fpjzy",
        "premise": "some people think dick and balls are all one system",
        "punchline": "however, theres a vas deferens between the two",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "360": {
        "id": "7fl3c7",
        "premise": "Bob and the nudist colony",
        "punchline": "Bob joins a very exclusive nudist colony.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "361": {
        "id": "7fxipw",
        "premise": "What did Obi-Wan say to the Jedi who was eating with his hands?",
        "punchline": "Use the fork, Luke.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "362": {
        "id": "7fxfbu",
        "premise": "These jokes are the best way to get some peace and quiet from others.",
        "punchline": "Because now my friends left",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "363": {
        "id": "7fr80t",
        "premise": "The Specialists",
        "punchline": "What is the difference between a genealogist and a gynecologist? One specialist looks up your family tree and the other looks up your family bush.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "364": {
        "id": "7fvpj4",
        "premise": "What do you call a workplace for an aquatic animal?",
        "punchline": "An of-fish",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "365": {
        "id": "7fvp38",
        "premise": "What is a wock?",
        "punchline": "Something you thwow at wabbits.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "366": {
        "id": "7fkim0",
        "premise": "Did you hear the one about the giraffe who learned Karate?",
        "punchline": "He looked like a fucking idiot.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "367": {
        "id": "7ftgxz",
        "premise": "I told my psychologist I thought I was turning into snooker ball",
        "punchline": "She sent me to the end of the queue",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "368": {
        "id": "7fugn0",
        "premise": "My doctor told me that I was obese",
        "punchline": "\"Oh yeah, it runs in the family,\" I said.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "369": {
        "id": "7fnace",
        "premise": "What's the difference between Switzerland and Columbia?",
        "punchline": "In Switzerland, snow is measured in meters, in Columbia in kilograms.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "370": {
        "id": "7fozve",
        "premise": "What do indecisive people enjoy doing?",
        "punchline": "I don't know.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "371": {
        "id": "7fszmg",
        "premise": "Pirates love to knit. In fact...",
        "punchline": "They love to use yarrrrn!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "372": {
        "id": "7frh30",
        "premise": "How do you get a snowboarder off your front porch!?",
        "punchline": "Pay for the pizza...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "373": {
        "id": "7fvhas",
        "premise": "Did you hear the score of the Egypt vs Ethiopia soccer game?",
        "punchline": "Egypt 8, Ethiopia didn't.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "374": {
        "id": "7fmnwy",
        "premise": "A bartender who just went broke decides to open a medical clinic.",
        "punchline": "He puts a sign outside the clinic-\" I will cure anything for the price of $20, and I'll pay you back $50 if I fail.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "375": {
        "id": "7fr3q8",
        "premise": "A limbo champion and an equestrian walked in to a bar",
        "punchline": "And both were immediately disqualified",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "376": {
        "id": "7fr3f3",
        "premise": "I have the hardest time with numbers divisible by 2.",
        "punchline": "I can't even.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "377": {
        "id": "7fvgcq",
        "premise": "What do you call a row of rabbits replanting a garden?",
        "punchline": "A re-seeding hare line.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "378": {
        "id": "7ftpfj",
        "premise": "What's at the bottom of the ocean?",
        "punchline": "What's at the bottom of the ocean and shivers?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "379": {
        "id": "7fvfjw",
        "premise": "My dwarf girlfriend has been feeling down recently because of remarks about her size..",
        "punchline": "So to cheer her up after she gets home, I have got her flowers, chocolates, wine and I'm going to run her nice hot sink.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "380": {
        "id": "7fp4rg",
        "premise": "How do you make a cat go woof",
        "punchline": "Pour petrol on it and set it on fire",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "381": {
        "id": "7fu9dp",
        "premise": "What do you call a person who talks about donating money to charities but is always too lazy to actually do it?",
        "punchline": "A chillanthropist",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "382": {
        "id": "7fstcv",
        "premise": "I will come back and haunt you for the rest of your life",
        "punchline": "A lawyer & wife were always fighting with each other. When they had a confrontation, screaming and yelling could be heard deep into the night.The woman would shout - 'When I die, I will dig my way up, out of the grave and come back and haunt you for the rest of your life..'",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "383": {
        "id": "7fsfyp",
        "premise": "I always hope to die peacefully in my sleep like my Grandfather",
        "punchline": "Not screaming in terror like his passengers.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "384": {
        "id": "7fva0x",
        "premise": "What does Ed Sullivan use to kill a giant wasp? [OC]",
        "punchline": "A really big shoe.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "385": {
        "id": "7fs2wx",
        "premise": "So what if I don't know the meaning of the word 'apocalypse'?",
        "punchline": "It's not the end of the world !",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "386": {
        "id": "7fu3dv",
        "premise": "Why didn't the hermit crab want to share his home?",
        "punchline": "Because he was a little shellfish...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "387": {
        "id": "7fv58d",
        "premise": "Why was the Red Baron so good at hiding?",
        "punchline": "He was the master of de skies...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "388": {
        "id": "7fu1ml",
        "premise": "What's the difference between a baked bean and a chickpea",
        "punchline": "Donald trump doesn't pay for baked beans.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "389": {
        "id": "7fv3td",
        "premise": "Did you hear about the mother who gave birth to a baby in a plane?",
        "punchline": "I guess yiu could say the baby was airborne...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "390": {
        "id": "7frxh1",
        "premise": "Sleep",
        "punchline": "It weird how everyone sleeps differently. I happen to sleep on my side while my friend sleeps on her back. While my Ex sleeps with everyone. Pretty weird you know?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "391": {
        "id": "7fqtnr",
        "premise": "My girlfriend asked me if I had sex with anyone before we met.",
        "punchline": "I said, \"No, not today.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "392": {
        "id": "7fpsbv",
        "premise": "ISIS and Al-Qaeda go to war with each other. Who wins?",
        "punchline": "Everyone else",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "393": {
        "id": "7fv0l3",
        "premise": "A native American goes to a psychologist ...",
        "punchline": "A native American goes to a psychologist. He says, \"Doctor, I have these recurring dreams. First, I'll dream that I am a wigwam. Then I'll dream I am a teepee. Then, I'll have the wigwam dream again, followed by the one where I'm a teepee...\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "394": {
        "id": "7fuze8",
        "premise": "What did the tree say to the shape?",
        "punchline": "Gee, I'm a tree",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "395": {
        "id": "7fnmpq",
        "premise": "Why was the tomato red?",
        "punchline": "He was blushing because he saw the salad dressing!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "396": {
        "id": "7fmzpu",
        "premise": "PSA: Vegans and Vegetarians should stop eating brown sugar immediately!",
        "punchline": "It's made out of mole asses",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "397": {
        "id": "7frr9g",
        "premise": "What do Stanford and UCLA graduates have in common?",
        "punchline": "They applied to Stanford.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "398": {
        "id": "7ftukl",
        "premise": "A skeleton's sexuality is his biggest secret...",
        "punchline": ".... you could say he's a skeleton in the closet.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "399": {
        "id": "7fgtuj",
        "premise": "The only thing that flat earthers fear...",
        "punchline": "is sphere itself.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "400": {
        "id": "7fuuy2",
        "premise": "Why can't you hear a pterodactyl go to the bathroom?",
        "punchline": "Because the pee is silent.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "401": {
        "id": "7fspfp",
        "premise": "[Long] A man gets a call that his wife has been in a horrible accident...",
        "punchline": "When he arrives at the hospital, the doctor meets him at the nurses station. The doctor says \"well sir, I have some good news, and I have some bad news\". The man was very distraught and couldn't think clearly, so he told the doctor \"doctor, I can't decide, you pick\". The Dr. nodded and motioned for the man to sit down. The doctor then said \"Sir I'm afraid your wife will never be able to speak again...\" The man nods, and lets out a deep sigh. He then says \"ok doctor... now, what's the bad news?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "402": {
        "id": "7ftsmy",
        "premise": "I hate it when people think it's so easy to get a body like mine",
        "punchline": "Do you how many Big Mac's it took?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "403": {
        "id": "7fygrf",
        "premise": "Why can't jesus cross the road?",
        "punchline": "He has two holes hands.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "404": {
        "id": "7fog97",
        "premise": "Did you know the first French fries weren't cooked in France?",
        "punchline": "They were actually cooked in Greece.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "405": {
        "id": "7fqp6q",
        "premise": "Christmas",
        "punchline": "It's only 29 days to Christmas.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "406": {
        "id": "7fnxaf",
        "premise": "There was an accident on the highway today.",
        "punchline": "I tried to help the victims, but there was so much blood that I felt sick and had to leave.\nI'm sure they'll be okay until a different ambulance gets there.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "407": {
        "id": "7fum0v",
        "premise": "I forgot to wear pants at the blind convention yesterday...",
        "punchline": "No one blinked an eye",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "408": {
        "id": "7fpo15",
        "premise": "What's Leatherface's favourite social media?",
        "punchline": "Facebook.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "409": {
        "id": "7fnuiv",
        "premise": "I have a huge problem with self-esteem",
        "punchline": "But I can only blame myself for that.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "410": {
        "id": "7fqrib",
        "premise": "How would you describe the smell of a horse's fart?",
        "punchline": "Hayness.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "411": {
        "id": "7fsw21",
        "premise": "What does a physicist say when he wakes up in the morning?",
        "punchline": "Up an atom!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "412": {
        "id": "7fqptz",
        "premise": "My girlfriend and I used a corduroy condom for the first time last night...",
        "punchline": "It was a groovy kind of love...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "413": {
        "id": "7fsc23",
        "premise": "How do you tell you're kissing a french horn player?",
        "punchline": "They keep trying to stick their fist up your ass.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "414": {
        "id": "7foxar",
        "premise": "\"Doctor, I have heard lots of voices that are making me want to kill my family\"",
        "punchline": "Doctor - \"Yeah that is just Thanksgiving Dinner\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "415": {
        "id": "7fxedj",
        "premise": "If you drop a handful of nuts over a United States map...",
        "punchline": "they all tend to roll to San Francisco",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "416": {
        "id": "7fuhsh",
        "premise": "Some of these Christmas songs keep mentioning it’s sleighing season",
        "punchline": "But for the life of me, I don’t know how Christmas equates to hunting season!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "417": {
        "id": "7fhezn",
        "premise": "6 was scared of 7 because 7, 8 ,9 but why did 7 eat 9?",
        "punchline": "Because you’re supposed to eat 3 squared meals a day.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "418": {
        "id": "7fssgp",
        "premise": "What happened when the cow jumped over the barbed wire fence?",
        "punchline": "IT WAS UDDER DESTRUCTION!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "419": {
        "id": "7fkowi",
        "premise": "I feel bad for eating all the Thanksgiving leftovers that were in the fridge...",
        "punchline": "but it's hard to quit cold turkey.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "420": {
        "id": "7fhaz1",
        "premise": "Did anybody hear what happened to that guy on the highway?",
        "punchline": "He pulled up to a gas station to fill up his tank, i guess they were doing maintenance on the pumps and didnt put one back together right, so while he was pumping, the hose popped off the nozzle and started spraying gas all up his arm.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "421": {
        "id": "7fr1l6",
        "premise": "The principal was visiting the 5th grade class, so the teacher told the girls if anyone says anything inappropriate they should run away from the classroom. The principal comes in and listens to the class and at one point a boy says \"Did you see that whorehouse they are building down the street?\".",
        "punchline": "The girls start covering their ears and running away.The boy says \"Where are you running sluts, they only laid the foundations!\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "422": {
        "id": "7frcuk",
        "premise": "Why was the cellphone wearing his glasses?",
        "punchline": "He lost all of his contacts",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "423": {
        "id": "7filmu",
        "premise": "I've been clean for 45 days now",
        "punchline": "It's been tough taking a shower everyday, but at least I have the heroin to help me get throught it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "424": {
        "id": "7fsohz",
        "premise": "I don’t understand why people use dull pencils",
        "punchline": "It’s pointless",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "425": {
        "id": "7fpo3f",
        "premise": "A dog walks into a bar.",
        "punchline": "A dog walks into a bar and hops up on a stool. He looks the bartender in the eye and says, \"Hey, guess what? I can talk. Have you ever seen a talking dog before? How about a drink?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "426": {
        "id": "7fmpt9",
        "premise": "I once picked up a grenade in a gun sale, they had knocked off 90% because it was missing a pin or something.",
        "punchline": "It blew my mind.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "427": {
        "id": "7fqo0o",
        "premise": "A man goes to see a psychiatrist wearing nothing but plastic shrink wrap for clothes.",
        "punchline": "The doctor looks at him and says, “Well, I can clearly see your nuts!”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "428": {
        "id": "7fsag4",
        "premise": "I finally bought something today I’ve wanted since 1998...",
        "punchline": "A 1998 Cadillac.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "429": {
        "id": "7fv465",
        "premise": "Be like a dog:",
        "punchline": "if you can't eat it or fuck it, then piss on it and walk away.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "430": {
        "id": "7frg2c",
        "premise": "A man gets pulled over for rolling a stop sign",
        "punchline": "The officer tells him, “You didn’t stop. You just slowed down and kept going.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "431": {
        "id": "7fredk",
        "premise": "Miss Universe is rigged and I always know who’s going to win before it even starts",
        "punchline": "The winner has always been a contestant from planet Earth",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "432": {
        "id": "7ftszm",
        "premise": "What do you call a happy roman?",
        "punchline": "A glad-iaotor",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "433": {
        "id": "7fe8th",
        "premise": "I had a dream where I weighed less than a thousandth of a gram.",
        "punchline": "I was like 0mg",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "434": {
        "id": "7fqw2k",
        "premise": "Whats the difference between a baked bean and a chickpea?",
        "punchline": "I wouldn't pay to have a baked bean on my face.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "435": {
        "id": "7fts7q",
        "premise": "My girlfriend wants to break up with me because I always talk about things that disappointed me",
        "punchline": "I really don't think it's a good reason fallout four.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "436": {
        "id": "7frb90",
        "premise": "How does a cat make whipped cream?",
        "punchline": "With it's whiskers.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "437": {
        "id": "7frau3",
        "premise": "A man wakes up in the hospital...",
        "punchline": "He says to the doctor, \"Doctor, doctor! I can't feel my legs.\" The doctor replies, \"I know, I amputated your arms.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "438": {
        "id": "7ftqww",
        "premise": "It’s been 4 years and people still talk about Frozen.",
        "punchline": "I wish they’d let it go.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "439": {
        "id": "7fq30j",
        "premise": "I was walking through the woods yesterday and came up to a river…",
        "punchline": "I was hoping to find a bridge, but I’ll get over it",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "440": {
        "id": "7fkpk5",
        "premise": "Gotta take a shit",
        "punchline": "Bob and Jim are chilling in the park when Bob has to take a shit. With no bathroom close Jim tells Bob go ahead I will be lookout. Bobs starts his business when Jim yells \"COP\". So Bob throws his hat over the pile of shit.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "441": {
        "id": "7ftny0",
        "premise": "Why is your poop tapered at the end?",
        "punchline": "So your butthole doesn't slam shut",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "442": {
        "id": "7fqbfr",
        "premise": "How does Trump supporters like their steaks?",
        "punchline": "Overcucked.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "443": {
        "id": "7ftn0n",
        "premise": "Why did the kid drop his ice cream on the road",
        "punchline": "Because he got run over by a truck",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "444": {
        "id": "7ftmi6",
        "premise": "A local joke I heard: An Arkansan and an Oklahoman go to the store..",
        "punchline": "The Arkansan walks up to the clerk and says, “I’d like some ‘maters, some taters, and some punkin pie.”***",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "445": {
        "id": "7fr22j",
        "premise": "Once I was commissioned to write an article about carrying rocks around in wet paper bags",
        "punchline": "In the end it all fell through",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "446": {
        "id": "7fpjzu",
        "premise": "When people ask me how I get to work, I always say in a $200,000 vehicle",
        "punchline": "I love the bus",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "447": {
        "id": "7fpab2",
        "premise": "Can you speak into my good ear? Doh!",
        "punchline": "A man goes to the doctor and tells the doctor he is having trouble hearing. the doctor asks him to describe the symptoms. The man replies \"Homer is the fat guy and his wife is marge with the blue hair...\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "448": {
        "id": "7ftjo9",
        "premise": "Which dog is the best poet?",
        "punchline": "A Weimar-rhymer.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "449": {
        "id": "7frl5l",
        "premise": "My Israeli tenant doesn't want to rent from me anymore",
        "punchline": "He's annoyed that I address all correspondence to 'The Occupier'",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "450": {
        "id": "7ftgpx",
        "premise": "Why do chicken coops have 2 doors?",
        "punchline": "Because if it had 4, it would be a chicken sedan.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "451": {
        "id": "7frggm",
        "premise": "A religious awakening",
        "punchline": "Is what happens when the preacher gets through preaching.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "452": {
        "id": "7fqtuw",
        "premise": "People keep asking me what my birthday wish was...",
        "punchline": "I wished for cancer so i can make a real wish",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "453": {
        "id": "7fs7k3",
        "premise": "What is a yodeler's favourite kitchen utensil?",
        "punchline": "A LADLE AY HEE OOH",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "454": {
        "id": "7fpwqt",
        "premise": "child asked?",
        "punchline": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "455": {
        "id": "7frd57",
        "premise": "A camel walks into a bar.",
        "punchline": "Bartender: What can I get you?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "456": {
        "id": "7fn71a",
        "premise": "Guess who didn’t eat on thanksgiving?",
        "punchline": "The turkey! It was already stuffed...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "457": {
        "id": "7fjq4a",
        "premise": "My doctor just told me I'm colorblind.",
        "punchline": "The diagnosis came completely out of the purple.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "458": {
        "id": "7fptpa",
        "premise": "Twins",
        "punchline": "One day a man named Joe gets a phone call from his pal Rick.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "459": {
        "id": "7fqnwg",
        "premise": "Men are like Christmas lights",
        "punchline": "We all wish we were hung better.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "460": {
        "id": "7ftacb",
        "premise": "What do you call a dumb secret agent?",
        "punchline": "Blonde, James Blonde.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "461": {
        "id": "7fs20b",
        "premise": "I need a lawyer!",
        "punchline": "I'm legally blind.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "462": {
        "id": "7fp3pk",
        "premise": "Did you hear about the pig that learned karate?",
        "punchline": "I heard all his friends now call him pork chop.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "463": {
        "id": "7ft9oi",
        "premise": "Why do feminists hate math?",
        "punchline": "It's called triggernometry for a reason...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "464": {
        "id": "7fexcw",
        "premise": "Why do Bald Men have holes in their pockets?",
        "punchline": "So they can run their fingers through their hair.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "465": {
        "id": "7fko3n",
        "premise": "When I was a young boy",
        "punchline": "My father would always tell me \"whatever you do you must never open that cellar door\" being a young kid I always followed his advice for years. Eventually I couldn't take it anymore so one day when he was gone I walked up to the door and with nervous hands I pushed it open. I was astonished to see a clear blue sky, green grass and children laughing and playing just outside.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "466": {
        "id": "7ft96z",
        "premise": "How do you catch a unique rabbit?",
        "punchline": "Unique up on him. How do you catch a tame rabiit? Tame way.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "467": {
        "id": "7fq3zt",
        "premise": "A grill master wanted to load up the grill with more BBQ, but he was running low on hot coals ...",
        "punchline": "So, he decided not to brisket.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "468": {
        "id": "7fs00x",
        "premise": "What crab is the best at acting?",
        "punchline": "Imitation crab",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "469": {
        "id": "7fnb0p",
        "premise": "A garbage man is doing his collections....",
        "punchline": "..... he sees that one house has not put their bin out front. He checks down the side of the house, it's not there, so he knocks at the front door. No answer, so he rings the bell, still no answer. He knocks one last time, waits and finally starts walking back down the path towards the street. But then the door opens and a Chinese man is standing there in his dressing gown, 'what you want?', he says. 'Where's your bin?', the garbage man replies. 'I been upstairs washing my hair!', says the Chinaman. 'No, where's your BIN?', says the garbage man. 'I tell you already, I been upstairs, washing my hair', says the Chinaman. 'NO NO NO, WHERE IS YOUR WHEELIE BIN?', says the frustrated garbage man.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "470": {
        "id": "7fryqe",
        "premise": "Ever wonder about the guy who discovered milk?",
        "punchline": "\"Ooh this animal's tits taste better than the last twenty I sucked!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "471": {
        "id": "7ft5sn",
        "premise": "Just wait until you guys hear my new joke about fastening metal.",
        "punchline": "It’s riveting.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "472": {
        "id": "7fpkui",
        "premise": "Why did the cowboy adopt a dachshund?",
        "punchline": "To get a long little doggy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "473": {
        "id": "7frsqh",
        "premise": "what's a good hair product that can change someone's sexuality?",
        "punchline": "a hair straightener",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "474": {
        "id": "7ft1d5",
        "premise": "- Do you know that walking barefoot is very good for your health?",
        "punchline": "Oh, yeah! I have a terrible headache if I wake up with my shoes on in the morning.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "475": {
        "id": "7fmbrl",
        "premise": "What is Hitler's favourite dice game?",
        "punchline": "Nahtzee",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "476": {
        "id": "7frprf",
        "premise": "What do you call it when an amphibian has inflamed joints?",
        "punchline": "Rheumatoad arthritis",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "477": {
        "id": "7fof4y",
        "premise": "An old man in Brooklyn gets a phone call that his cheese shop blew up.",
        "punchline": "“Oh, no! I’d better get down there right away!”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "478": {
        "id": "7fu09i",
        "premise": "up at 4 am watching 4k picture slideshows eating cereal",
        "punchline": "9 minutes in i realized it was playing 240",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "479": {
        "id": "7fsy6r",
        "premise": "If you are what you eat...",
        "punchline": "...then I guess I really am an asshole.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "480": {
        "id": "7floq4",
        "premise": "Politicians and diapers have one thing in common.",
        "punchline": "They should both be changed regularly, and for the same reason.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "481": {
        "id": "7frm64",
        "premise": "What do you call a Mexican man who ran out of Chinese money?",
        "punchline": "No Yuan Juan",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "482": {
        "id": "7frlqh",
        "premise": "Rumored next year’s updated iPhone SE would have borderless touchscreen...",
        "punchline": "You gonna have the best iPhone SE X so far.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "483": {
        "id": "7fp8l8",
        "premise": "What do you call a camel during a drought?",
        "punchline": "A dry humper.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "484": {
        "id": "7fn5kk",
        "premise": "People who eat ass",
        "punchline": "Are such bottom feeders.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "485": {
        "id": "7frk0k",
        "premise": "You've heard of rapper Post Malone.",
        "punchline": "But have you heard of his brother Leavi Malone?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "486": {
        "id": "7frjf1",
        "premise": "what do you call a person that sells themself for spaghetti?",
        "punchline": "a pastatute!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "487": {
        "id": "7fn0dq",
        "premise": "A pious man walks through the woods",
        "punchline": "And stumbles into a bog. Slowly sinking he can't get out by himself and starts to pray: \"Dear Lord, stand by me and deliver me from my danger\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "488": {
        "id": "7fuehm",
        "premise": "Hitler was a really bad person...",
        "punchline": "But the holocaust really turned his life around.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "489": {
        "id": "7frdv1",
        "premise": "What's the difference between a Cockerel and a prostitute",
        "punchline": "One says Cock-a-doodle-do and the other says Any-cock'll-do",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "490": {
        "id": "7ffd8n",
        "premise": "Why are Catholic priests called \"Father?\"",
        "punchline": "Because \"Daddy\" would be too suspicious.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "491": {
        "id": "7fl8em",
        "premise": "A couple is waiting",
        "punchline": "A couple is waiting in line outside a government welfare office. One hour goes by, another hour goes by, and then a third.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "492": {
        "id": "7fso99",
        "premise": "Beethoven died.",
        "punchline": "When I was at his funeral, I expressed my greatest symphonies.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "493": {
        "id": "7fngn7",
        "premise": "The doctor diagnosed me with anxiety and constipation.",
        "punchline": "I was worried shitless.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "494": {
        "id": "7fqhf7",
        "premise": "What did Cinderella do when she got to the ball?",
        "punchline": "gag...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "495": {
        "id": "7fl9ws",
        "premise": "An engineering student is walking along when a fellow student arrives on a new bicycle",
        "punchline": "Impressed, he asks, \"Where did you got this beautiful bicycle?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "496": {
        "id": "7fsmoe",
        "premise": "Have you heard about the new pope?",
        "punchline": "He's making a lot of changes atound the Vatican and sone of the cardinals are very worried.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "497": {
        "id": "7fqf39",
        "premise": "German History class",
        "punchline": "During history class in a German school, a young boy raises his hand and asks:",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "498": {
        "id": "7flct6",
        "premise": "My son used to be horrible at graphing trig functions.",
        "punchline": "Luckily he's made excellent sines of improvement.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "499": {
        "id": "7fsk7e",
        "premise": "Where did the police officer go when he saw his wife cheating on him?",
        "punchline": "Internal affairs.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "500": {
        "id": "7fppfj",
        "premise": "What did Ajit Pai have for dessert on Thanksgiving?",
        "punchline": "Ashit Pie.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "501": {
        "id": "7ftnr8",
        "premise": "Breaking News: Bill Gates has agreed to pay for Trump's wall",
        "punchline": "On the condition he gets to install windows.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "502": {
        "id": "7fm2jm",
        "premise": "4 Catholic men and a women were having coffee in St. Francis Square",
        "punchline": "The first man, strikes the conversation with \"My son is a priest. When he walks into the room, people call him \"Father\"\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "503": {
        "id": "7fr5t1",
        "premise": "The Miss Universe pageant is tonight...",
        "punchline": "I wonder which planet will win.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "504": {
        "id": "7fmtaq",
        "premise": "Ben has 911 candies. He eats 420. What does he have now?",
        "punchline": "Diabetes. Ben has diabetes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "505": {
        "id": "7fochx",
        "premise": "I read that 30% of the internet is pornography and that really makes me disappointed in humanity...",
        "punchline": "that the other 70% of the internet is being wasted",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "506": {
        "id": "7fq5q1",
        "premise": "Has the harsh winter turned you into a snow beast?",
        "punchline": "Not Yeti.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "507": {
        "id": "7ftjmn",
        "premise": "I got a vasectomy but my wife still got pregnant...",
        "punchline": "Apparently you're supposed to do the vasectomy first.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "508": {
        "id": "7fi1b8",
        "premise": "My wife and I were watching Who Wants To Be A Millionaire while we were in bed",
        "punchline": "My wife and I were watching Who Wants To Be A Millionaire while we were in bed. I turned to her and said, 'Do you want to have Sex?' 'No,' she answered. I then said, 'Is that your final answer?' She didn't even look at me this time, simply saying, 'Yes..' So I said, \"Then I'd like to phone a friend.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "509": {
        "id": "7ftiic",
        "premise": "Old people at weddings always poke me and say,\"you're next.\"",
        "punchline": "So, I started doing the same thing to them at funerals...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "510": {
        "id": "7fs9lf",
        "premise": "I auditioned for the joker role for a Batman movie ..",
        "punchline": "I did not get it because they thought I was too funny.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "511": {
        "id": "7fq06m",
        "premise": "A man runs into a KGB office, looking terrified...",
        "punchline": "He goes over to the main desk, and tells the receptionist “I have something urgent to report!”.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "512": {
        "id": "7fs638",
        "premise": "The Irish have completely solved their own fuel problems",
        "punchline": "They imported 50 million tons of sand from the Arabs so they can drill for their own oil.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "513": {
        "id": "7fh9ni",
        "premise": "What is Harry Potter's favorite method of getting down a hill?",
        "punchline": "Walking....",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "514": {
        "id": "7fff9i",
        "premise": "A guy stuck his head into a barbershop and asked",
        "punchline": "A guy stuck his head into a barbershop and asked, \"How long before I can get a haircut?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "515": {
        "id": "7foq5l",
        "premise": "Don't blame the holidays,",
        "punchline": "you were fat in August.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "516": {
        "id": "7fqrbf",
        "premise": "Why do Australians greet each other with \"mate\"?",
        "punchline": "Because everyone used to be an inmate.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "517": {
        "id": "7fs47s",
        "premise": "A middle aged man went to a gym to get a membership.",
        "punchline": "He asked the manager which machine should he work out on to attract a woman the fastest.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "518": {
        "id": "7fs3mg",
        "premise": "When I was little my Dad thought I was Bright...",
        "punchline": "So he called me Sun",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "519": {
        "id": "7fqp6j",
        "premise": "In my opinion all weddings should be held in the nude...",
        "punchline": "That way we really know who the best man is.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "520": {
        "id": "7fs3jl",
        "premise": "Why did the toilet paper stop in the middle of the road?",
        "punchline": "It got stuck in a crack.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "521": {
        "id": "7fpstj",
        "premise": "What did the rower say to his glute-strengthening apparatus after he found his missing rowing instrument?",
        "punchline": "Butt weight, there's m'oar!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "522": {
        "id": "7fs30y",
        "premise": "What do you call a three-humped camel?",
        "punchline": "Cancerous.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "523": {
        "id": "7fs2hv",
        "premise": "They say carrots are good for your eyes",
        "punchline": "But beer will make you see double.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "524": {
        "id": "7fp473",
        "premise": "Today my mentor told me if I want to achieve great things I'd have to make sacrifices.",
        "punchline": "Anyone know where to buy live chickens for cheap?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "525": {
        "id": "7fmrut",
        "premise": "What did Santa Claus say when he heard Mrs Claus had been cheating on him?",
        "punchline": "Hoe hoe hoe",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "526": {
        "id": "7fnd55",
        "premise": "Where can you go to learn about the history of masturbation?",
        "punchline": "The “whacks” museum",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "527": {
        "id": "7fqkve",
        "premise": "My brother in law just threw this one at me - an original. How do Vulcans keep from getting injured?",
        "punchline": "Spock absorbers.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "528": {
        "id": "7fnipm",
        "premise": "What do you call a promising virgin?",
        "punchline": "Untapped potential.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "529": {
        "id": "7fpnvl",
        "premise": "I used to be a mechanic...",
        "punchline": "but I quit because it was exhausting work.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "530": {
        "id": "7fih1q",
        "premise": "Homosexuality is found in over 450 species. Homophobia is only found in two.",
        "punchline": "Help us get rid of the Ecuadorian fag-hating spider :(",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "531": {
        "id": "7fpn09",
        "premise": "What do you call a joke that isn't funny?",
        "punchline": "Sexual harassment!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "532": {
        "id": "7fpmmp",
        "premise": "How does an Apple Watch owner know that it's midday?",
        "punchline": "It's already run out of battery.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "533": {
        "id": "7fhocv",
        "premise": "Where is the capital of Zimbabwe?",
        "punchline": "In a Swiss bank account.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "534": {
        "id": "7fnhar",
        "premise": "I think it's funny how Ajit Pai",
        "punchline": "Has a name that's easily mispronounced as \"a shit pie\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "535": {
        "id": "7fiy6b",
        "premise": "A shark is teaching his son how to hunt humans",
        "punchline": "Alright son, you start with circling your pray. Every once in a while you take a nibble out of them. And then after a few rounds you finally attack and eat them.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "536": {
        "id": "7fqff2",
        "premise": "A blond and her husband go to the beach. She catches a pretty bad sunburn and asks her husband to go to the store for fresh milk and oatmeal to help it feel better.",
        "punchline": "Her husband says “sure, but do you want it pasteurized?” She says “no because I won’t be able to breathe. To my tits is fine.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "537": {
        "id": "7fiwda",
        "premise": "I got banned from donating clothes to the local orphanage",
        "punchline": "Apparently they don't appreciate Batman costumes......",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "538": {
        "id": "7feiuh",
        "premise": "If I see one more fucking post about Net Neutrality",
        "punchline": "I'll have to pay for it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "539": {
        "id": "7fncgr",
        "premise": "A Engineer, a Chemist and an Economist get stranded on a island.",
        "punchline": "From the ship that crashed, some canned food washed ashore.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "540": {
        "id": "7fi620",
        "premise": "Heaven was running out of spots for new souls",
        "punchline": "So St. Peter was instructed by God to only let in people, who, apart from having lived honorable lives, had also suffered a terribly traumatic last moment, and needed consolation for that.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "541": {
        "id": "7fnvzz",
        "premise": "What do they serve at a party for cannibals?",
        "punchline": "Refleshments",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "542": {
        "id": "7fo7bq",
        "premise": "I don’t get why people don’t see being a hitman as a valid job,",
        "punchline": "I mean, they make a killing off of it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "543": {
        "id": "7fltqs",
        "premise": "The Prince and the Apple Salesman",
        "punchline": "A young boy is sent out by his mother to fetch some apples at the local market. Once he arrives, however, he sees a well-dressed nobleman furiously berating the poor apple salesman, his fine clothes a strong contrast to the salesman's own peasant garb.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "544": {
        "id": "7fnsje",
        "premise": "Did you hear about the cashier who did tricks with the barcode machine, but still charged full price?",
        "punchline": "She was a scan artist.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "545": {
        "id": "7fjrj3",
        "premise": "Where did sally go when her village was bombed?",
        "punchline": "Everywhere",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "546": {
        "id": "7fjytn",
        "premise": "A couple's car gets stuck in the mud...",
        "punchline": "The boyfriend tries to gun the engine, but the rear tire keeps sinking. He thinks maybe he can get traction, so he asks his girlfriend to take off her shirt.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "547": {
        "id": "7frn84",
        "premise": "I find it difficult trying to give buskers money...",
        "punchline": "They’re always making a song and dance over it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "548": {
        "id": "7fuaqc",
        "premise": "This is a long one",
        "punchline": "A couple desides to buy an island. They didn’t come up with a name for the island so they desided to name it the first word they hear. A motorboat goes by and the boat gets a hole and the man in the boat yells A HOLE A HOLE! Now the island is called hole. After this the couple get a cow. They deside to name it the same way as they named the island. Another boat goes by and it also has a hole. Now the man yells CAMELS ASS! Now the cow is called camels ass. After a while the cow goes missing. The couple goes to the police and they tell them WE SEARCHED ALL OF CAMELS ASS BUT WE DIDNT FIND THE HOLE",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "549": {
        "id": "7fjzie",
        "premise": "If at first you don't succeed...",
        "punchline": "...skydiving isn't for you.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "550": {
        "id": "7fnnd9",
        "premise": "I’ve heard if you don’t go to the bathroom for a week, you become all knowing",
        "punchline": "But then again, most people will think you’re full of shit.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "551": {
        "id": "7ftfz8",
        "premise": "What is the worst type of Jew?",
        "punchline": "Ashk a Nazi.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "552": {
        "id": "7fpz47",
        "premise": "I just went through airport security and at the Rapiscan I was told to “widen my stance and pull up my pants”",
        "punchline": "I guess the TSA is afraid of bat wings and sagging",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "553": {
        "id": "7fozpl",
        "premise": "My friend completely destroyed my liquor cabinet yesterday.",
        "punchline": "edit: RIP my ginbox",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "554": {
        "id": "7frdmc",
        "premise": "A Rabbi & a Priest...",
        "punchline": "...attend a boxing match. They watch as the two boxers enter the ring. The Rabbi sees one of the boxers cross himself, so he turns to the Priest and asks:",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "555": {
        "id": "7fsop1",
        "premise": "Stranger Things is so good",
        "punchline": "I give it an Eleven out of ten.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "556": {
        "id": "7fngoq",
        "premise": "Another genie joke",
        "punchline": "So a man walks into a bar with a burlap sack. He pulls out a small piano, bench, and a tiny piano player, who begins to play songs on the miniature piano. The Bartender, intrigued, asks the man where he got it. The man proceeds to show the bartender an old genie bottle. Out pops an old, dusty genie. The man tells the bartender to make a wish. The Bartender wishes for 1 million bucks. All of a sudden, Ducks begin shooting out of the top of the bottle. Frustrated the bartender yells to the man \"I wished for a million BUCKS not a Million DUCKS!\" To this the man replied, \"Yea, and i didn't wish for a 12-inch Pianist Either.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "557": {
        "id": "7fptos",
        "premise": "Why was the scion driver a dumbass?",
        "punchline": "He lowered his iq.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "558": {
        "id": "7ff9cv",
        "premise": "Doctor: So your child was born without eyelids.",
        "punchline": "Mother: Well isn't there anything you can do?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "559": {
        "id": "7fovfa",
        "premise": "What did the shower say to the shampoo?",
        "punchline": "GET OUTTA HAIR!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "560": {
        "id": "7fslib",
        "premise": "If genius is 1% inspiration and 99% perspiration...",
        "punchline": "... fat people must be fucking brilliant.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "561": {
        "id": "7fr8cf",
        "premise": "What's the difference between LIGO & Mar-a-Lago",
        "punchline": "Former witnessed collision between massive blackholes & latter witnessed collusion between massive assholes (allegedly)",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "562": {
        "id": "7fmja9",
        "premise": "Sarah is a girl who was born with no body. No arms, no legs, not even a torso. Nothing below her neck.",
        "punchline": "In a major medical accomplishment, doctors develop a set of very small devices to function as her internal organs and install them in her neck. These keep her fully functional with exception of being able to walk or manipulate objects as if she had arms or legs.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "563": {
        "id": "7for5b",
        "premise": "Last night at the pub I was talking to a drawbridge operator about his job.",
        "punchline": "I asked him if he liked it. . . . . . . He said it has its ups and downs.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "564": {
        "id": "7ffg5u",
        "premise": "It's good that Apple released only 3 phones this year...",
        "punchline": "Another one would have been an XS",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "565": {
        "id": "7fijn6",
        "premise": "What do you call kids in the military?",
        "punchline": "Infantry",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "566": {
        "id": "7fksmb",
        "premise": "An Atheist is walking through the woods...",
        "punchline": "and when as he rounds a corner, he sees a huge bear. He turns and runs, and the bear starts to chase him. All of a sudden, he trips and falls. The man turns over to see the bear looming over him, and he screams, \"Oh God!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "567": {
        "id": "7fr4j2",
        "premise": "At the hospital, a man was asked \"How tall are you?\" \"I'm 6'2, why do you ask doc?\".",
        "punchline": "\"I'm not a doctor, I am a carpenter\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "568": {
        "id": "7fr44m",
        "premise": "I know lots of jokes that will make your eyes water...",
        "punchline": "Guess I like aqueous humour",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "569": {
        "id": "7fpm3h",
        "premise": "Love is like an open door...",
        "punchline": "People walk out of it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "570": {
        "id": "7fplvt",
        "premise": "\"So hare lost, slow and steady tortoise won the first animal Olympic race. But class what's better than slow and steady. Fast and steady. So who won at the second Olympics?\" Teacher asked",
        "punchline": "Still Tortoise. Average life of hare is only 3 years Miss.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "571": {
        "id": "7fr3vj",
        "premise": "Life is like a box of chocolates...",
        "punchline": "You have a vague assumption of what you're going to get but in the end you're always dissapointed.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "572": {
        "id": "7fr3la",
        "premise": "I don't understand angles.",
        "punchline": "It's all greek to me.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "573": {
        "id": "7fr39f",
        "premise": "Today I gave my up my seat to an old blind lady",
        "punchline": "Thats how I lost my job as a bus driver",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "574": {
        "id": "7fqz4l",
        "premise": "Baby Whale to Papa Whale, \"where did i come from?\" Papa, \"my penis\"....baby...\"Uhhh...thanks???\"",
        "punchline": "Papa \"you're whalecum..\"\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "575": {
        "id": "7fqxpo",
        "premise": "Did you hear about the pizza with no toppings?",
        "punchline": "There was much room for improvement.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "576": {
        "id": "7fpbjv",
        "premise": "I was visiting a wastewater plant with my class when my ex fell into the sewage tank, yelling \"Chad, come here and help me out!\"",
        "punchline": "\"You'll go to any length to drag me into the shit again, won't you!!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "577": {
        "id": "7fqtoc",
        "premise": "If you're really a member of the resistance, you'd know the password:",
        "punchline": "Ohmmmmmmmmmmm",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "578": {
        "id": "7fs7q4",
        "premise": "Do you exercise?",
        "punchline": "I run my mouth a lot.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "579": {
        "id": "7fga7q",
        "premise": "Always love a women for her personality",
        "punchline": "They have like 10, so you can choose.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "580": {
        "id": "7fmy6e",
        "premise": "I heard Lemony Snicket donated $1 million to Planned Parent hood.",
        "punchline": "I guess he is trying to finish off a series of unfortunate events.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "581": {
        "id": "7fn8zz",
        "premise": "A programmer starts coding something...",
        "punchline": "And it works first try",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "582": {
        "id": "7fp30z",
        "premise": "Why don't hillbillies do the reverse cowgirl",
        "punchline": "Because they never turn their backs on family",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "583": {
        "id": "7fp2j3",
        "premise": "What's the difference between poo and feces?",
        "punchline": "It's the same shit!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "584": {
        "id": "7fqlq8",
        "premise": "What can Eminem be found doing during Christmas?",
        "punchline": "Rapping paper",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "585": {
        "id": "7fmuu2",
        "premise": "What animal cannot be trusted?",
        "punchline": "A Cheetah.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "586": {
        "id": "7fn4qz",
        "premise": "I was once a medicine salesman, but I was soon fired.",
        "punchline": "I lost my job for not selling drugs.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "587": {
        "id": "7fqjhb",
        "premise": "Why did the Jurassic World geneticists 'cross' the road?",
        "punchline": "Because they wanted resulting Indominous Rex to be able to 'go up and down but not move'",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "588": {
        "id": "7flxjj",
        "premise": "I remember the Christmas I found out Santa wasn't real",
        "punchline": "I wish my parents has warned me because my kids were really disappointed christmas morning",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "589": {
        "id": "7fgz85",
        "premise": "Great sex can make your day",
        "punchline": "But anal sex can make your hole weak",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "590": {
        "id": "7fqetz",
        "premise": "Legs getting tired? Take some Tryactin!",
        "punchline": "Try acting like a man!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "591": {
        "id": "7fqdq6",
        "premise": "I’m trying to think of an incest joke...",
        "punchline": "Too bad they’re all too family-friendly...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "592": {
        "id": "7fnwxb",
        "premise": "A priest and a rabbi are traveling in an airplane full of kids...",
        "punchline": "...Suddenly the engine explodes. They both rush to don the only 2 emergency parachutes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "593": {
        "id": "7fj7ex",
        "premise": "My pregnant girlfriend is tired of me joking about giving her an abortion...",
        "punchline": "So I told her I'd cut it out.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "594": {
        "id": "7fmvf8",
        "premise": "Husband said to wife",
        "punchline": "I had a dream about us yesterday",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "595": {
        "id": "7fom8g",
        "premise": "I setup a threesome last night...",
        "punchline": "but there were a couple of no-shows.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "596": {
        "id": "7fq5gt",
        "premise": "Did you know Its impossible to hum while holding your nose closed?",
        "punchline": "I told you! You can let go of your nose now.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "597": {
        "id": "7fb1x3",
        "premise": "Doctor: Well, it looks like you're pregnant.",
        "punchline": "Woman: Oh my God, I'm pregnant?!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "598": {
        "id": "7fpz3e",
        "premise": "My electrician is amazing. He wired my whole house single-handedly.",
        "punchline": "It's like switchcraft!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "599": {
        "id": "7foefk",
        "premise": "Two Mexicans have been lost in the desert for weeks.",
        "punchline": "Two Mexicans have been lost in the desert for weeks. At death's door, they see a tree in the distance. As they get nearer, they see that it's draped with rasher upon rasher of bacon; crispy bacon; life giving, nearly raw, juicy bacon. \"Hey Pepe', says the first Mexican, 'ees a bacon tree! We're saved!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "600": {
        "id": "7fn04y",
        "premise": "How do you view gay relationships?",
        "punchline": "In full HD",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "601": {
        "id": "7fpwpn",
        "premise": "If I was going to write a book it would be about suicide but..",
        "punchline": "I know it would just end on a cliffhanger.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "602": {
        "id": "7fnh0b",
        "premise": "We can stop this shit together...",
        "punchline": "Said one butt cheek to another.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "603": {
        "id": "7ffn2p",
        "premise": "Before going to Europe on business, a man drove his Rolls Royce to a downtown NY City bank and went in to ask for an immediate loan of $5,000.",
        "punchline": "The loan officer was quite taken a back, and requested collateral.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "604": {
        "id": "7fppor",
        "premise": "Did you see Stevie Wonders's wife on t.v. last night?",
        "punchline": "It's ok if you didn't, he didn't either.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "605": {
        "id": "7fo191",
        "premise": "The Fence at the White House",
        "punchline": "The fence at the White House was broken and this needed to be fixed ASAP. The government decided to bring in three contractors to take some measurements and get some estimates.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "606": {
        "id": "7fpjun",
        "premise": "What do you call an Asian person with sleep in their eyes?",
        "punchline": "A crust-asian",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "607": {
        "id": "7flqno",
        "premise": "I have been having terrible dreams lately. Last night I dreamt I ate a giant marshmallow.",
        "punchline": "When I woke up, my pillow was gone.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "608": {
        "id": "7fpjio",
        "premise": "What do parents fish give to their young when they are ill",
        "punchline": "Kelpol",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "609": {
        "id": "7fl0k6",
        "premise": "What do you call an empty container of Cheese Whiz?",
        "punchline": "Cheese Was",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "610": {
        "id": "7fphdy",
        "premise": "Did you hear about the homeless person who broke into someone's home and slept in their bed.",
        "punchline": "The police like to say he's under house arrest.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "611": {
        "id": "7fpech",
        "premise": "Teenagers are incredibly agile.",
        "punchline": "They can turn on their parents in an instant.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "612": {
        "id": "7flxgm",
        "premise": "The FCC has just made a formal announcement",
        "punchline": "If anyone keeps complaining about Net Neutrality they'll pay for it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "613": {
        "id": "7fnssl",
        "premise": "Why is Santa always shouting \"Ho! Ho! Ho!\"?",
        "punchline": "He is homesick.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "614": {
        "id": "7fn1jt",
        "premise": "What comes after 69?",
        "punchline": "..Mouthwash",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "615": {
        "id": "7fpbal",
        "premise": "How many mosquitoes does it take to screw in a lightbulb?",
        "punchline": "At least two",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "616": {
        "id": "7fht95",
        "premise": "What do you give a stoned communist who did well on a test?",
        "punchline": "High Marx.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "617": {
        "id": "7fqqzm",
        "premise": "Before I commit suicide I'm gonna go visit Prague",
        "punchline": "So I can Czech myself before I wreck myself",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "618": {
        "id": "7fitsh",
        "premise": "I want to die peacefully in my sleep, like my grandfather...",
        "punchline": "Not screaming and yelling like the passengers in his car.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "619": {
        "id": "7fj7to",
        "premise": "Want more jokes about Russia?",
        "punchline": "then Soviet",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "620": {
        "id": "7fp6zz",
        "premise": "Dog pun run [long]",
        "punchline": "Shamelessly copying puns from the Bugle podcast;",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "621": {
        "id": "7fjh6k",
        "premise": "A driver gets pulled over by a policeman for speeding",
        "punchline": "The policeman approaches the drivers door. \"Is there a problem, Officer?\" The policeman says, \"Sir, you were speeding. Can I see your license please?\" The driver responds, \"I'd give it to you but I don't have one.\" \"You don't have one?\" The man responds, \"I lost it four times for drink driving.\" The policeman is shocked. \"I see. Can I see your vehicle registration papers please?\" \"I'm sorry, I can't do that.\" The policeman says, \"Why not?\" \"I stole this car.\" The officer says, \"Stole it?\" The man says, \"Yes, and I killed the owner.\" At this point the officer is getting irate. \"You what?\" \"She's in the trunk if you want to see.\" The Officer looks at the man and slowly backs away to his car and calls for back up. Within minutes, five police cars show up, surrounding the car. A senior officer slowly approaches the car, clasping his half-drawn gun. The senior officer says, \"Sir, could you step out of your vehicle please!\" The man steps out of his vehicle. \"Is there a problem, sir?\" \"One of my officers told me that you have stolen this car and murdered the owner.\" \"Murdered the owner?\" The officer responds, \"Yes, could you please open the trunk of your car please?\" The man opens the trunk, revealing nothing but an empty trunk. The officer says, \"Is this your car sir?\" The man says, \"Yes\" and hands over the registration papers. The officer, understandably, is quite stunned. \"One of my officers claims that you do not have a driving licence.\" The man digs in his pocket revealing a wallet and hands it to the officer. The officer opens the wallet and examines the licence. He looks quite puzzled. \"Thank you, sir. One of my officers told me you didn't have a licence, stole this car, and murdered the owner.\" The man replies, \"I bet you the lying bastard told you I was speeding, too!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "622": {
        "id": "7fjduv",
        "premise": "A man wakes up after a night with a hooker and his crotch is on fire",
        "punchline": "He keeps itching and itching and looks at the hooker and says, \"Bitch! You gave me crabs.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "623": {
        "id": "7fj8fz",
        "premise": "\"I before E except after C.\"",
        "punchline": "It's simple science.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "624": {
        "id": "7fp25z",
        "premise": "I always look for the ideal spot to plug in appliances to calm myself whenever I get angry.",
        "punchline": "It turned out to be a perfect outlet.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "625": {
        "id": "7fp1x2",
        "premise": "What do you call a Duck in the wrong neighborhood?",
        "punchline": "Quacker",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "626": {
        "id": "7fp1vp",
        "premise": "I had to break up with my Taiwanese girlfriend",
        "punchline": "You see, I'm a very mellow person.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "627": {
        "id": "7fll34",
        "premise": "The Emo Bodybuilder",
        "punchline": "The Emo bodybuilder is very dangerous, you never know what he means when he says he’s cutting",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "628": {
        "id": "7fscf0",
        "premise": "Fighting on reddit is like......",
        "punchline": "The special olympics.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "629": {
        "id": "7fowbs",
        "premise": "What did the boombox want to be when he grew up?",
        "punchline": "A public speaker.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "630": {
        "id": "7flvfd",
        "premise": "A Redditor walked into r/jokes",
        "punchline": "And then immediately walked out as soon as he saw the profile picture",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "631": {
        "id": "7fosmc",
        "premise": "I think I finally figured out what to get Trump for Christmas!",
        "punchline": "A nice watch, because he's always asking for the TIME!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "632": {
        "id": "7fqcd1",
        "premise": "Which continent's existence do flat-earthers deny?",
        "punchline": "Australia.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "633": {
        "id": "7fmnq3",
        "premise": "- Mary, do you know what Bechdel Test is?",
        "punchline": "-Jane, I have no idea.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "634": {
        "id": "7fm0k3",
        "premise": "The farmer had three daughters..",
        "punchline": "They were sixteen, seventeen and eighteen. One day he was out front of the farmhouse when a car pulled up the driveway and a young man approached the house. \"who are you?\" The old farmer asked him. \"hello Sir, I'm Eddie, here to pick up Betty, we're going out for Spaghetti\" \"oh\" the Farmer replied, a little concerned that he knew nothing of this young lad. Then another car pulls in the driveway, and another young man starts his way to the front door. \"And who are you?\" asked the farmer. \"Uh, Sir my names Joe, I'm here to see Flo, we're going out to a show\" \"oh, I see!\" replied the farmer, fuming mad as his second daughter left with her date. A third car pulled into the driveway driven by a young man and the farmer grabbed his shotgun and ran out to confront him. \"Right! Who the hell are you??\" he screamed. \"oh! Easy there sir!.. uh.. my name's Chuck....\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "635": {
        "id": "7fhyzi",
        "premise": "what did the grape say when it was stepped on?",
        "punchline": "nothing. It just let out a little wine.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "636": {
        "id": "7fn7ly",
        "premise": "What's the most manliest forest on earth?",
        "punchline": "A mangrove",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "637": {
        "id": "7fgofz",
        "premise": "What's the difference between a Redditor and a Lawyer?",
        "punchline": "One has to factually back up everything they say or face scrutiny from their peers...the other pulls in a 6-figure income.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "638": {
        "id": "7fokch",
        "premise": "What did the sour cream say after a long day of work?",
        "punchline": "\"Another day, another dollop\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "639": {
        "id": "7fbrqv",
        "premise": "An American sailor walks up to a urinal and starts peeing...",
        "punchline": "... A few seconds later, a fellow Irish sailor goes to the urinal next to him and starts peeing. The American's eyes start to wander, and he can't help but look down at the Irish man's penis and notice a \"W\" and \"Y\" tattooed down there. \"I'm really sorry that I looked over,\" says the American, \"but i have to ask. Why do you have a 'WY' tatooed on your penis?\" \"You got me,\" responds the Irish sailor. \"Me girl back home is named Wendy, and the tattoo says 'Wendy' when fully erect.\" The American nods and goes on his way.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "640": {
        "id": "7fn484",
        "premise": "An economist and a normal person are walking down the street together.",
        "punchline": "The normal person says “Hey, look, there’s a $20 bill on the sidewalk!” The economist replies by saying “That’s impossible- if it were really a $20 bill, it would have been picked up by now.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "641": {
        "id": "7fkcgm",
        "premise": "What do my wife and an automatic toilet flusher have in common?",
        "punchline": "They both start jumping to conclusions before I even have a chance to sit my ass down.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "642": {
        "id": "7fq1ve",
        "premise": "My neighbor was putting red and green Christmas lights on top of his house...",
        "punchline": "then red and blue ones showed up in the driveway!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "643": {
        "id": "7fm59i",
        "premise": "Have you heard about the corrupt elevator company?",
        "punchline": "It goes all the way to the top.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "644": {
        "id": "7fj5js",
        "premise": "I’m paradoxical and contradictory,",
        "punchline": "I hate redundancy and repetition.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "645": {
        "id": "7fmh9x",
        "premise": "Any guy who plays heavy metal at work…",
        "punchline": "Is office rocker...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "646": {
        "id": "7fn1dp",
        "premise": "The first day of Richard Dawkins as a librarian",
        "punchline": "He walks to a senior librarian: \"Excuse me, I am new here, could you help me solve one problem? I have Bible, Quran and Torah, but I am not sure which book belongs to the sci-fi section, which to the fantasy section and which one to the horror section.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "647": {
        "id": "7fn0y7",
        "premise": "A Chinese man is visiting the USA on business and goes to a bank to exchange some money.",
        "punchline": "He gives the teller 400 yuan, receives $60 USD and goes on about his day.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "648": {
        "id": "7fjjzd",
        "premise": "A UN delegation was flying across the Atlantic...",
        "punchline": "A Brit, a Frenchman, an American, and a Mexican are told by the pilot that they are too heavy and may crash.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "649": {
        "id": "7fob8r",
        "premise": "What's the name of that round thing they throw at the olympics?",
        "punchline": "Discuss.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "650": {
        "id": "7fl4nw",
        "premise": "What do a gynaecologist and a pizza delivery boy have in common?",
        "punchline": "They both can smell it, but can’t eat it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "651": {
        "id": "7foa0w",
        "premise": "My teacher says all birds repeat after you",
        "punchline": "Apparrotly..",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "652": {
        "id": "7fmd6y",
        "premise": "I used to be addicted to swimming...",
        "punchline": "...but I’m very proud to say, I’ve been dry for six years.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "653": {
        "id": "7fmc6t",
        "premise": "Two eggs are sitting in the bus",
        "punchline": "When one says to the other: “Don’t be so hard, others will notice”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "654": {
        "id": "7fmw2k",
        "premise": "What did Bill Clinton tell Monica Lewinsky after getting inpeached?",
        "punchline": "Bitch, I told you to lick my erection. Not wreck my election",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "655": {
        "id": "7fkie3",
        "premise": "A lady goes to a therapist to talk about her failing relationship.",
        "punchline": "Lady: Doctor! My husband has been pushing me around and constantly talking behind my back when we are around!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "656": {
        "id": "7fkuh9",
        "premise": "A buddy told me that he had started watching his weight...",
        "punchline": "And I can see he's really done a good job getting it out there where he can see it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "657": {
        "id": "7fmba7",
        "premise": "What did the lesbian frog say to the other lesbian frog?",
        "punchline": "Hey! We do taste like chicken.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "658": {
        "id": "7faxpq",
        "premise": "My friend told me this joke a while ago, and I thought that it was pretty good:",
        "punchline": "A man goes to a restaurant and sits down to eat.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "659": {
        "id": "7fdoxm",
        "premise": "What is the only \"B\" word you should call girls?",
        "punchline": "Beautiful. Bitches love it when you call them that.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "660": {
        "id": "7fmaak",
        "premise": "A Japanese girl",
        "punchline": "A Japanese girl married a Spanish man & went to Spain.. She can't speak Spanish.. Each time she wants to buy chicken legs, she would lift her skirt & show her thighs to enable the seller understand her... This went on for sometime.. One day she wanted to buy banana.. So She took her husband to the shop.. Because her husband can speak Spanish!!!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "661": {
        "id": "7fo17v",
        "premise": "What do you call a country singer who loves rope?",
        "punchline": "Shania Twine",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "662": {
        "id": "7fm81b",
        "premise": "Robert Mugabe admits to playing World of Warcraft",
        "punchline": "You are not in this Presidential group. Please leave office or you will be teleported to the nearest graveyard in 59..58...57",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "663": {
        "id": "7fi53n",
        "premise": "A man died in an accident when working at the brewery.",
        "punchline": "When the police arrived at his home to inform his wife, she asked how it happened. \"Well, madam, I'm sorry to say he fell into one of the beer cauldrons and drowned,\" said the officer. In tears, the wife asked the officer, \"Please, at least tell me it was a quick death\". \"Unfortunately not,\" the officer explains, \"witnesses say he climbed out at least twice to go to the bathroom\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "664": {
        "id": "7fk8g0",
        "premise": "Abcdefghijklmntofsuprise!",
        "punchline": "I️ know it’s dumb but I️ thought of that all by myself and it made me chuckle.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "665": {
        "id": "7fl0f7",
        "premise": "My First Condom",
        "punchline": "“I recall my first time with a condom, I was 16 or so. I went in to buy a packet of condoms at the pharmacy. There was this beautiful woman assistant behind the counter, and she could see that I was new at it. She handed me the package and asked if I knew how to wear one. I honestly answered, ‘No, this is my first time.’",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "666": {
        "id": "7fnt8p",
        "premise": "Shocking news!",
        "punchline": "I'm an electrician",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "667": {
        "id": "7fdar5",
        "premise": "A barber got arrested..",
        "punchline": "A barber got arrested in my area for dealing drugs and I’m totally shook. I’ve been his customer for years and never knew he was a barber.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "668": {
        "id": "7fmjj6",
        "premise": "What happened after the blonde ran to meet her long lost twin sister?",
        "punchline": "She got seven years of bad luck for breaking her nose on the mirror.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "669": {
        "id": "7fk9ge",
        "premise": "A classic Soviet joke",
        "punchline": "(Setting: 1980 Olympics)",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "670": {
        "id": "7fg0ne",
        "premise": "Why did little Timmy drop his ice cream?",
        "punchline": "He was hit by a bus.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "671": {
        "id": "7flong",
        "premise": "If I told you I have a small penis...",
        "punchline": "It would be a little phallusy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "672": {
        "id": "7fkfav",
        "premise": "The Hardware Store",
        "punchline": "A woman goes into a hardware store and tells the the proprietor that she would like to buy a hinge. The proprietor asks her if she would like a screw to go along with the hinge. The woman responds: “No thank you but I’ll blow you for that toaster in the corner.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "673": {
        "id": "7filbw",
        "premise": "My Grandad told me this one (the guy is a legend)",
        "punchline": "A girl is sat in the hairdresser's, eating some cake.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "674": {
        "id": "7faic4",
        "premise": "Everyone knows Albert Einstein was a genius...",
        "punchline": "but his brother, Frank, was a real monster.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "675": {
        "id": "7fkiby",
        "premise": "The Pharmacy",
        "punchline": "Two spinster sisters own a pharmacy. One night when they are in the back room busily filling prescriptions a man approaches the cash register area dressed in a trench coat. Unknown to the sisters he took too many Viagras and has had an erection for the last 6 hours. As one of the sisters approaches the cash register she asks the man how she can help him. The man opens his trench coat. He is nude, extremely well endowed and standing at full attention. He points down at his manhood and says: “What can you give me for this?” Flustered and blushing she tells the man that she has to confer with her sister in the back room. Ten minutes later she returns to the cash register and tells the man: “Well, I have talked it over with my sister and we are willing to give you $10,000 and a third interest in the pharmacy.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "676": {
        "id": "7fni2f",
        "premise": "What is Woody Harrelson's favorite part of building a computer?",
        "punchline": "The rampart.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "677": {
        "id": "7fiya0",
        "premise": "I'm reading a crime novel about a dwarf psychic on the run from the police",
        "punchline": "It's called: Small Medium at Large",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "678": {
        "id": "7fgp6w",
        "premise": "What do you call a pie that’s full of horseshit?",
        "punchline": "Ajit Pai",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "679": {
        "id": "7fhc7n",
        "premise": "If I could rearrange the alphabet, I'd put U and I together",
        "punchline": "And then move the rest of them to match the layout of a QWERTY keyboard too.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "680": {
        "id": "7fqadc",
        "premise": "Why do bikers like to signal people behind them where they are going using their hands?",
        "punchline": "I mean if they are in front of my car whatever signal they use they end up 10 feet up in the air anyway",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "681": {
        "id": "7fi8av",
        "premise": "What did the green grape say to the purple grape?",
        "punchline": "Breathe, idiot! BREATHE!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "682": {
        "id": "7fkrvj",
        "premise": "Today, I found out there are places that sell fake scallops made out of white fish...",
        "punchline": "there are a lot of cod artists out there.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "683": {
        "id": "7fle9o",
        "premise": "Mumbutu",
        "punchline": "Two anthropologists, having just finished their doctorates, find themselves studying indigenous tribes in Africa. Out on their first mission, they are trekking through some mountains when they realise that they are surrounded by a tribe of unknown origin.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "684": {
        "id": "7fhbx2",
        "premise": "If you're a fan of piss...",
        "punchline": "then urine luck",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "685": {
        "id": "7fg5mn",
        "premise": "At the clothing store where I work, I make it a point of pride to give customers my unvarnished opinion.",
        "punchline": "One day, when a man emerged from the fitting room, I took one look at him and shook my head.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "686": {
        "id": "7fn5s7",
        "premise": "I always wanted to call my dog “Dipshit”",
        "punchline": "So whenever I’m in public with it I can shout, “ SIT DOWN AND ROLL, DIPSHIT”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "687": {
        "id": "7fidma",
        "premise": "I have a fetish for Amish women.",
        "punchline": "Best part about it?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "688": {
        "id": "7fkvr6",
        "premise": "What do iPhones use for battery?",
        "punchline": "Apple juice",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "689": {
        "id": "7fhrss",
        "premise": "I just burned 2,000 calories.",
        "punchline": "That's the last time I'll leave the brownies in the oven while I nap.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "690": {
        "id": "7fllkb",
        "premise": "Shoutout to sidewalks.",
        "punchline": "For keeping me off the streets.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "691": {
        "id": "7fii0u",
        "premise": "A man walks into his regular watering hole....",
        "punchline": "depressed he orders a double whiskey. The bartender asks him “What’s the bad news?”. The guy says “Well my wife says she no longer enjoys sex so she’s cutting me off, we can only do it once a month”. Bartender: “Ooohhh cheer up that’s nothing, she’s cut most of the guys in here completely off”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "692": {
        "id": "7fmy9x",
        "premise": "The only way I’d EVER support getting rid of Net-Neutrality is...",
        "punchline": "...is if Donald Trump’s ISP stops his Tweets.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "693": {
        "id": "7fl2q6",
        "premise": "I'm really good in bed.",
        "punchline": "I almost never fall out.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "694": {
        "id": "7fjn1f",
        "premise": "I've been thinking of selling my theremin",
        "punchline": "I haven't touched it in years",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "695": {
        "id": "7fe0ob",
        "premise": "Chad's wife decided to surprise him on his birthday",
        "punchline": "and to show him that she's a cool wife, she took him to a strip club.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "696": {
        "id": "7fkbdz",
        "premise": "How many Diablo 2 players does it take to change a light bulb?",
        "punchline": "Two.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "697": {
        "id": "7f8kn7",
        "premise": "An atheist, a crossfitter, and a vegan are all sitting at a bar...",
        "punchline": "and I only know this because they won't shut the fuck up about it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "698": {
        "id": "7fftj0",
        "premise": "A man attacks a woman wearing a fur coat..",
        "punchline": "..and shouts at her angrily - \"Do you have any idea how many minks had to die for you to wear that fur??\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "699": {
        "id": "7fkomm",
        "premise": "Today I decided to go on a 100 day #NoFap.",
        "punchline": "It was a stroke of genius.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "700": {
        "id": "7fje8p",
        "premise": "I think I want a job cleaning mirrors...",
        "punchline": "I can just see myself doing it!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "701": {
        "id": "7fmg8e",
        "premise": "What did one lesbian vampire say to the other?",
        "punchline": "See you next month.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "702": {
        "id": "7feh3g",
        "premise": "The knights around the lake",
        "punchline": "So there's this far-off place that consists of a perfectly triangular lake surrounded by land, with three kingdoms on the three sides of the lake. The first kingdom is rich and powerful, filled with wealthy prosperous people. The second kingdom is more humble, but has its fair share of wealth and power, too. The third kingdom is struggling and poor, and barely has an army.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "703": {
        "id": "7fnh6e",
        "premise": "Religious jokes on Reddit are low-hanging fruit. . .",
        "punchline": ". . .kind of like the one Adam and Eve ate.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "704": {
        "id": "7fixpr",
        "premise": "An Irishman is walking along the beach one day...",
        "punchline": "...and he sees a bottle laying in the sand. He picks it up and starts to brush it off when out pops a genie.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "705": {
        "id": "7fjpap",
        "premise": "Submitting this while I'm in a car...",
        "punchline": "Don't worry... I'm in the passenger seat, which makes it harder to drive but fools the COPS.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "706": {
        "id": "7fkwl1",
        "premise": "They say I'm addicted to brake fluid",
        "punchline": "But I can stop any time I want!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "707": {
        "id": "7fga1r",
        "premise": "So a piece of string goes into a bar...",
        "punchline": "The bartender says, \"we don't serve your kind here.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "708": {
        "id": "7fhckl",
        "premise": "What is Forrest Gump's password?",
        "punchline": "1forrest1",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "709": {
        "id": "7fi2m3",
        "premise": "Alvin and the booming voice",
        "punchline": "Alvin is working in his store when he hears a booming voice from above that says \"Alvin. Sell your business!\", Alvin, believing it to be just in his head ignores it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "710": {
        "id": "7ffvub",
        "premise": "Quite the scare!",
        "punchline": "While in a taxi heading for the International airport, I leaned over to ask the driver a question and gently tapped him on the shoulder to get his attention.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "711": {
        "id": "7fib0h",
        "premise": "My wife gives me sound advice",
        "punchline": "99% sound 1% advice",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "712": {
        "id": "7fgiui",
        "premise": "What did the bra say to the hat?",
        "punchline": "You go on ahead, I’ll give these two a lift.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "713": {
        "id": "7f9ewn",
        "premise": "Bubba dies in a fire and his body is pretty badly burned.",
        "punchline": "The morgue sends for his two best friends, Daryl and Gomer, to identify the body.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "714": {
        "id": "7fiu3u",
        "premise": "EVOLUTION VS. CREATIONISM",
        "punchline": "A little girl asked her mother, \"How did the human race appear?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "715": {
        "id": "7fjwpi",
        "premise": "Mosquitoes",
        "punchline": "Mommy mosquito: How was your first day of flying?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "716": {
        "id": "7fc4zs",
        "premise": "What is it called when Batman skips church?",
        "punchline": "Christian Bale",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "717": {
        "id": "7fji1a",
        "premise": "With your current balance, which Apple products you could buy?",
        "punchline": "Apple Juice",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "718": {
        "id": "7fgs20",
        "premise": "How are Scandinavians made",
        "punchline": "They are bjorn",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "719": {
        "id": "7flqp8",
        "premise": "Pirate party",
        "punchline": "One eyed ducks are having a private party. A duck comes by and asks: \" How come this is a private party?\" One eyed duck says: \" because it's a pirate party\".",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "720": {
        "id": "7fiyf3",
        "premise": "GOP Lemonade Stand",
        "punchline": "A Republican senator has set up a lemonade stand selling lemonade for a dollar to raise money for his campaign and remind his constituents of “the good old days”. It’s a big success, as many parents and grandparents take their children and grandchildren to show them how they used to make money back in the day. Everything goes fine until someone tries to pay with four quarters instead of a dollar bill. The senator responds “Sorry I don’t accept change”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "721": {
        "id": "7fjwrx",
        "premise": "What's a redneck's favorite thanksgiving treat?",
        "punchline": "The pump-kin pie!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "722": {
        "id": "7fcd2t",
        "premise": "At a welcome seminar at a senior assisted living facility...",
        "punchline": "...the manager addressed all the new seniors pointing out some of the rules: \"The female sleeping quarters will be of limits for all males, and likewise the male dormitory to the females.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "723": {
        "id": "7fkjed",
        "premise": "So the other day I was looking for my car keys",
        "punchline": "(bear with me) and I found them in the fridge.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "724": {
        "id": "7fbgnj",
        "premise": "“If you woke up and found a used condom in your ass would you tell anyone?”",
        "punchline": "“No”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "725": {
        "id": "7fid5l",
        "premise": "What did the bald man say",
        "punchline": "when he got a comb for his birthday?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "726": {
        "id": "7fj43g",
        "premise": "What did the dog say to the ceiling",
        "punchline": "roof",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "727": {
        "id": "7f7jsm",
        "premise": "I asked to switch seats on a plane because I was sat next to a screaming baby",
        "punchline": "Apparently that's not allowed if the baby is yours",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "728": {
        "id": "7f63to",
        "premise": "I don't know what the big deal is about Black Friday.",
        "punchline": "All Fridays matter.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "729": {
        "id": "7foepk",
        "premise": "What's a priest's favourite meat?",
        "punchline": "Nun.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "730": {
        "id": "7fjhdt",
        "premise": "why is the place between a woman's vagina and her breasts called a waist?",
        "punchline": "because you could fit another 2 pairs of boobs there.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "731": {
        "id": "7ffo2p",
        "premise": "What do gingers and North Koreans have in common?",
        "punchline": "They've go no Seoul.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "732": {
        "id": "7ffvon",
        "premise": "It is amazing that a Bitcoin is worth $8600",
        "punchline": "Imagine how much a full coin would cost!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "733": {
        "id": "7fjcxr",
        "premise": "Whats a Mexicans favorite sport?",
        "punchline": "Cross Country",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "734": {
        "id": "7fjbrr",
        "premise": "Jerry!",
        "punchline": "She looks ah him very embarrassed Slowly she opens her mouth. “...sweetie...take off my shoes” “Ok now take off my top” “Take the skirt off” She looks impatient, she can no longer hold “And the bra” “And my underwear” “And stop using my stuff!”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "735": {
        "id": "7fiqvu",
        "premise": "Have you heard of the new cannibal hipster restaurant?",
        "punchline": "It's called farmers to table.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "736": {
        "id": "7feqt0",
        "premise": "The mom from ToyStory has her own set of Toys.",
        "punchline": "Their names are also Woody and Buzz.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "737": {
        "id": "7fl7bm",
        "premise": "What is your Mama's favorite sandwich restaurant ?",
        "punchline": "Hoegies",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "738": {
        "id": "7fi6y3",
        "premise": "My friends were concerned that my old car may break down during our road trip throughout Canada.",
        "punchline": "I told them not to worry. I have Triple Eh.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "739": {
        "id": "7feg87",
        "premise": "Nice guys always finish last.",
        "punchline": "Which makes us really good in bed. Come on ladies..give us a try.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "740": {
        "id": "7fdrby",
        "premise": "1,000 Men Were Recently Surveyed About Women",
        "punchline": "10% of the men surveyed liked women with thin legs.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "741": {
        "id": "7fl5o1",
        "premise": "What did one grizzly bear said to the other, ravaging through a campground and finding some wine bottles?",
        "punchline": "always remember that the red wine goes well with a hunter, and white - with a fisherman",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "742": {
        "id": "7fl5lz",
        "premise": "What do you call a guy who's known for baked goods and also taking away illegally parked vehicles?",
        "punchline": "The Pillsbury TOW Boy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "743": {
        "id": "7feg3y",
        "premise": "My favourite part of the Bible, Psalm:",
        "punchline": "body once told me the world was gonna roll me.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "744": {
        "id": "7fi33t",
        "premise": "I like my coffee like I like my slaves",
        "punchline": "Free",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "745": {
        "id": "7fanur",
        "premise": "Three boys are playing marines outside...",
        "punchline": "A man walks up to them and asks what they’re up to. The first boy doing air squats says “I’m rock climbing.” The second boy running in place says “I’m on tour right now running through the desert.” The third boy doing push-ups says “I’m friends with these two and while they’re on tour l’m fucking their wives.”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "746": {
        "id": "7figo5",
        "premise": "I always clap along to Pharrell Williams' song \"Happy\"",
        "punchline": "Because just like a room without a roof, I feel utterly and completely useless",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "747": {
        "id": "7flvzj",
        "premise": "What do you call a 1mL drop of semen?",
        "punchline": "a peanut",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "748": {
        "id": "7ffusm",
        "premise": "Tonight I dreamt of a beautiful walk on a sandy beach.",
        "punchline": "At least that explains the footprints I found in the cat litter box this morning...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "749": {
        "id": "7fhtbv",
        "premise": "We all have that one vegan friend...",
        "punchline": "I said to mine, \"Do you have to mention vegetables every single time you open your mouth?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "750": {
        "id": "7fiq19",
        "premise": "After 20 Years I Found Out That I'm Actually Straight",
        "punchline": "Dr. Scoliosis said that I should brace myself before he delivered the good news",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "751": {
        "id": "7fcrgn",
        "premise": "Retarded",
        "punchline": "Me: I just put my laundry in the fridge. Sometimes I think I am retarded.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "752": {
        "id": "7fh5z6",
        "premise": "What starts with a fuck and ends with a you?",
        "punchline": "Pregnancy",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "753": {
        "id": "7fjevm",
        "premise": "How do you catch a unique rabbit?",
        "punchline": "U-nique up on it!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "754": {
        "id": "7fmjlx",
        "premise": "Me To Police",
        "punchline": "Me:35 People are following me!!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "755": {
        "id": "7fje5j",
        "premise": "What cheese do you use to hide a horse?",
        "punchline": "Mascarpone",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "756": {
        "id": "7fjdxc",
        "premise": "How many gravitational physicists does it take to change a lightbulb?",
        "punchline": "Two.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "757": {
        "id": "7fkm9o",
        "premise": "You know, if women weren’t good for sex...",
        "punchline": "... They’d probably be called men.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "758": {
        "id": "7fjcsn",
        "premise": "What does a perverted frog say?",
        "punchline": "Rub it, rub it",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "759": {
        "id": "7fbiqr",
        "premise": "What do you call a mustache soaked in urine?",
        "punchline": "A pistachio.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "760": {
        "id": "7fhy38",
        "premise": "Who sells pies from inside of another pie?",
        "punchline": "Simple Simon, Meta-Pieman",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "761": {
        "id": "7fklj0",
        "premise": "There's no such thing as an accident...",
        "punchline": "There's no such thing as an accident...",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "762": {
        "id": "7fd1s5",
        "premise": "Old Marine goes to a party",
        "punchline": "A crusty old Marine found himself at a Winter Ball where there was no shortage of hot ladies in attendance.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "763": {
        "id": "7fbq7v",
        "premise": "A man decides to buy his family a pet",
        "punchline": "So he goes downtown to a new pet store that's advertising exotic animals. Walking around the store the man sees a frog on sale for $1,500 and asks the cashier \"why is this frog so expensive?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "764": {
        "id": "7fgk7c",
        "premise": "What's the difference between men and pigs?",
        "punchline": "Pigs don't turn into men when they drink.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "765": {
        "id": "7fhqn0",
        "premise": "Did anyone else get charged for their dessert at Thanksgiving??",
        "punchline": "It's my fault really. I shouldn't have had a slice of the Ajit Pai.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "766": {
        "id": "7fkex1",
        "premise": "You know how at real shows you're told to put away your phone?",
        "punchline": "My comedy is so bad, you're told to record that shit",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "767": {
        "id": "7fghhx",
        "premise": "It was a rough day when the shelf collapsed at the gun shop..",
        "punchline": "The stocks plummeted..",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "768": {
        "id": "7fi94v",
        "premise": "What do you call it when a Mexican gets into a fight with a child molester?",
        "punchline": "Alien vs Predator!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "769": {
        "id": "7fj1sx",
        "premise": "What happens when two potheads fall in love?",
        "punchline": "A weeding.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "770": {
        "id": "7fj0f9",
        "premise": "Organising a charity event for people that are unable to orgasm.",
        "punchline": "Let me know if you can't cum.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "771": {
        "id": "7fkb8j",
        "premise": "Why was little Timmy never the same again?",
        "punchline": "He went to Jared's.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "772": {
        "id": "7fbv6i",
        "premise": "Dating a French Horn player",
        "punchline": "A girl went out on a date with a trumpet player, and when she came back her roommate asked, \"Well, how was it? Did his embouchure make him a great kisser?\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "773": {
        "id": "7flunj",
        "premise": "Genie Blonde Joke",
        "punchline": "A redhead, a brunette, and a blonde are stranded on an island and stumble onto a magic lamp. They rub the lamp and a genie pops out and grants them three wishes, one wish each. The redhead says \"I wish I was back home with my family\". and POOF! she was gone. The brunette says \"I wish I was back home with my family too.\" and POOF! she was gone. The blonde thought for a while and said \"Geeze, it sure is lonely here, I wish them two were here with me again.\" and POOF!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "774": {
        "id": "7fhef3",
        "premise": "The 'b' is subtle isn't actually silent.",
        "punchline": "It's just subtle",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "775": {
        "id": "7f9zu7",
        "premise": "One evening an old farmer went down to the pond...",
        "punchline": "One evening an old farmer went to go down to the pond, as he hasn't been there in a while, he grabbed a five gallon bucket and some fruit. As he neared the pond, he heard some voices shouting and laughing with glee. As he came closer he saw it was a bunch of young women skinny dipping in his pond. He made the women aware of his presence and they all went to the deep end. One of the women shouted at him \"we're not coming out until you leave!\" The old man frowned, \"I didn't come down here to watch you ladies swim naked or get out of the pond naked\". Holding the bucket up he said \"I'm here to feed the alligator.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "776": {
        "id": "7fk3po",
        "premise": "Black Friday sales are great!",
        "punchline": "I got a Tupac of B.I.G. Eminems for 50 cent.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "777": {
        "id": "7fey80",
        "premise": "Golf and Dentures",
        "punchline": "A couple of senior guys were golfing when one mentioned that he was going to a dentist for a new set of dentures the next morning.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "778": {
        "id": "7f89x9",
        "premise": "WIFE: - \"If I knew you were so poor, I would never have married you.\"",
        "punchline": "HUSBAND: - \"But I warned you! I said you are everything I have!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "779": {
        "id": "7fipqt",
        "premise": "Two soldiers are using a public bathroom",
        "punchline": "The first one finishes and goes to wash his hands The second one finishes and walks out the door around the same time as the first The first soldier says “in the army they teach us to wash our hands” The second soldiers responds “in the Air Force they teach us not piss on our hands”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "780": {
        "id": "7fgt25",
        "premise": "I was playing tennis with Roy Moore this morning... The score was love-15.",
        "punchline": "AWKWARD!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "781": {
        "id": "7fip9w",
        "premise": "A Roman, a Gaul and a Vandal are all sitting at the bar in a tavern…",
        "punchline": "Feeling friendly after a few cups of vino, the Roman stands up and says, “Ad Gloriam Romae, I shall share Rome’s glory and buy the next round of drinks!” The three happily clink mugs and drink together on the Roman’s coin. Draining his wine, feeling pleasantly fuzzy, the Gaul stands and says, “Honoring Vercingetorix, I shall share my hunt with my new friends!” He pulls a brace of pheasants from his bag and they quickly pluck, roast and dine on the fat fowl. With a burp, face shiny with grease, the Vandal climbs onto the table and says, “For all the tribes, I shall return the generous gifts that you have given me!” He pulls down his pants, pisses in the Roman’s face, turns and explosively defecates all over the Gaul, then leaps off the table and runs laughing out the door.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "782": {
        "id": "7fhu79",
        "premise": "Having a child makes you a parent.",
        "punchline": "Having two make you a referee.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "783": {
        "id": "7fgrdk",
        "premise": "Did y'all hear about...",
        "punchline": "Did y'all hear about the guys that broke into the police headquarters last week?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "784": {
        "id": "7fint6",
        "premise": "On his 80th birthday, Handsome Harry answers the door to a scantily-clad, buxom babe who cheerfully announces, \"Happy birthday, Harry! I'm here to give you super sex!\"",
        "punchline": "Harry, taken aback, calms himself, looks her up and down before carefully responding,",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "785": {
        "id": "7fdins",
        "premise": "A guy walks into a bar, sees a gorgeous woman sitting there, and he says to her...",
        "punchline": "\"Baby, you're so sexy, I'm gonna twist your nipples 'til they're raw.\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "786": {
        "id": "7fbplz",
        "premise": "My sister bet me a hundred dollars I couldn't build a car out of spaghetti.",
        "punchline": "You shoulda seen the look on her face when I drove pasta",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "787": {
        "id": "7fjzxl",
        "premise": "How do you know Mario isn’t in the plumbing union.",
        "punchline": "If he was every hour they would make you pause it for twenty minutes.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "788": {
        "id": "7fgbtp",
        "premise": "How many South Americans does it take to screw in a light bulb?",
        "punchline": "A Brazilian.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "789": {
        "id": "7fjybj",
        "premise": "What do you call a piano with of all its keys?",
        "punchline": "A key chain!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "790": {
        "id": "7fjwrk",
        "premise": "What's the difference between Simba and OJ Simpson?",
        "punchline": "One's an African lion and the other is a lyin African (allegedly)",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "791": {
        "id": "7fhmng",
        "premise": "What time does Sean Connery show up at Wimbledon?",
        "punchline": "Tennish",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "792": {
        "id": "7feks5",
        "premise": "A lot of people cry when they cut onions..",
        "punchline": "The trick is not to form an emotional bond.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "793": {
        "id": "7fmucr",
        "premise": "A muslim was having an affair with a 15 year old girl who lied about her age, when he learned the truth he broke it off and over the next week the guilt set in and he confessed to his wife. She screamed at him,",
        "punchline": "\"How could you cheat on me like that with an older woman?!?!?!\"",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "794": {
        "id": "7fjscn",
        "premise": "\"You're the only person I talk to who doesn't call me crazy\"",
        "punchline": "\"Of course you're not crazy\" barked Dudley, then proceeded to lick his balls.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "795": {
        "id": "7fid2r",
        "premise": "What kind of pleasure does a monk have?",
        "punchline": "Nun.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "796": {
        "id": "7fkydq",
        "premise": "Want me to tell a race joke?",
        "punchline": "Too late, I already beat you to it.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "797": {
        "id": "7fibsv",
        "premise": "Have you seen that movie about constipation?",
        "punchline": "It probably hasn't come out yet.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "798": {
        "id": "7fdklv",
        "premise": "I started dating a Welsh man...",
        "punchline": "I asked him how many sexual partners he had before me, but when he started counting he fell asleep",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "799": {
        "id": "7fiak4",
        "premise": "Apparently I need to listen more in church.",
        "punchline": "Turns out the preacher wasn’t talking about Jim Beam when he asked if anyone had been drunk on the Holy Spirit.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "800": {
        "id": "7fjnzj",
        "premise": "In Humanistic Physics, there's a term for the nicest possible path a person can take.",
        "punchline": "The Mean-Free Path.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "801": {
        "id": "7fjlop",
        "premise": "What’s it called when you get a sunburn from looking at your iPhone screen for too long?",
        "punchline": "That’s the new iPhone tan.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "802": {
        "id": "7flghh",
        "premise": "Why did my washing machine stop pumping out water?",
        "punchline": "Why did my washing machine stop pumping out water?",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "803": {
        "id": "7fi7o9",
        "premise": "What did the Klansman give kids on Halloween?",
        "punchline": "Racist Peanut Butter Cups",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "804": {
        "id": "7few94",
        "premise": "Never lie to a smart woman",
        "punchline": "Man on phone: \"Honey I have been asked to go golfing in China with my boss for a week. This is a good opportunity for me to get the promotion. So could you please pack enough clothes for a week, and my Golf bag. We are leaving from office & I will swing by the house to pick my things. Oh, Please pack my new blue silk pyjamas!”",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "805": {
        "id": "7fgplz",
        "premise": "What did the cop say to the cat going over the speed limit?",
        "punchline": "That's a fine, pussy.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "806": {
        "id": "7f8zyd",
        "premise": "Juan comes up to the Mexican border on his bicycle.",
        "punchline": "He’s got two large bags over his shoulders.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "807": {
        "id": "7fle0a",
        "premise": "Three Blondes Each Get a Wish",
        "punchline": "There are three blondes trapped on a deserted island. One finds a genie lamp, and all three rub it. The genie pops out and offers to give each blonde a wish.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "808": {
        "id": "7fjgvm",
        "premise": "What do you call a woman with one leg?",
        "punchline": "Peggy",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "809": {
        "id": "7fjgts",
        "premise": "What do you call a strong British person?",
        "punchline": "Union Jacked.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "810": {
        "id": "7fgkes",
        "premise": "Jesus can walk on water",
        "punchline": "Babies are 72% water. I can walk on babies",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "811": {
        "id": "7fjeb5",
        "premise": "What cheese do you use to get a bear out of a tree?",
        "punchline": "Camembert",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "812": {
        "id": "7fhzv7",
        "premise": "What did the butcher pull as he tied his ham?",
        "punchline": "His hamstring",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "813": {
        "id": "7fjdgp",
        "premise": "How many divorced men does it take to change a lightbulb?",
        "punchline": "None they never get the house.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "814": {
        "id": "7f6dw8",
        "premise": "One night a little girl walks in on her parents having sex.",
        "punchline": "The mother is going up and down on the father and when she sees her daughter looking at them she immediately stops.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "815": {
        "id": "7fhynt",
        "premise": "What did the fisherman say to the card magician?",
        "punchline": "Pick a cod, any cod!",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    },
    "816": {
        "id": "7fjchh",
        "premise": "Did you hear about the guy who drowned in a bowl of Muesli?",
        "punchline": "He was pulled under by a currant.",
        "subreddit": "https://www.reddit.com/r/Jokes/"
    }
}