{
    "1": {
        "category": "Political Jokes",
        "id": "post-1944",
        "premise": "Tasered",
        "punchline": "Got tasered picking up my friend from the airport today. Apparently security don’t like it when you shout ‘hi-Jack’. "
    },
    "2": {
        "category": "Political Jokes",
        "id": "post-7096",
        "premise": "E. T.",
        "punchline": "What’s the difference between a refugee and E.T? E.T. learnt English and wanted to go home!"
    },
    "3": {
        "category": "Political Jokes",
        "id": "post-5534",
        "premise": "If Woman",
        "punchline": "If women ruled the world there would be no wars. Instead, there would just a bunch of angry countries not talking to each other."
    },
    "4": {
        "category": "Political Jokes",
        "id": "post-6751",
        "premise": "Police Academy",
        "punchline": "Feeling excited today. Just graduated from the police academy and also read in my horoscope that I’m gonna be meeting a tall dark stranger. Looking forward to trying out my new taser. "
    },
    "5": {
        "category": "Political Jokes",
        "id": "post-1003",
        "premise": "Obama Shooting",
        "punchline": "It’s a real shame that Barrack Obama recently had to give a speech stood behind bullet proof glass. Just because he’s black doesn’t mean he’s gonna shoot anybody."
    },
    "6": {
        "category": "Political Jokes",
        "id": "post-1438",
        "premise": "Coldest Winter",
        "punchline": "This year has seen the coldest winter since records began for countries in the northern hemisphere. It’s been so cold that numerous politicians have actually been seen with their hands in their own pockets. "
    },
    "7": {
        "category": "Political Jokes",
        "id": "post-8474",
        "premise": "Saudi Prince",
        "punchline": "A Saudi prince recently requested that naked statues be covered up while visiting Rome. Apparently his 9 year old wife found them offensive. "
    },
    "8": {
        "category": "Political Jokes",
        "id": "post-7301",
        "premise": "Flying Pig",
        "punchline": "Q. What’s the difference between a flying pig and a politician? \nA. The letter F. "
    },
    "9": {
        "category": "Political Jokes",
        "id": "post-2709",
        "premise": "Health Service",
        "punchline": "The health service in this country is a disgrace. My doctor told me to run 3 miles a day for a month. I’m now completely lost and 90 miles away from home."
    },
    "10": {
        "category": "Political Jokes",
        "id": "post-3675",
        "premise": "Congress",
        "punchline": "Did you know that a group of baboons is called a congress… Well that explain it all now doesn’t it"
    },
    "11": {
        "category": "Political Jokes",
        "id": "post-184",
        "premise": "Chernobyl Disaster",
        "punchline": "Twenty-six years after the Chernobyl disaster, and am I the only one that’s disappointed? Still no superheroes. "
    },
    "12": {
        "category": "Political Jokes",
        "id": "post-9061",
        "premise": "Computer Game",
        "punchline": "Q. What was Adolf Hilter’s favorite computer game? \nA. Mein Kraft "
    },
    "13": {
        "category": "Political Jokes",
        "id": "post-7191",
        "premise": "Conflicts",
        "punchline": "My psychiatrist recently told me I should stop avoiding conflicts so I’ve just booked a holiday to Syria. "
    },
    "14": {
        "category": "Political Jokes",
        "id": "post-3890",
        "premise": "Angry Birds",
        "punchline": "The government has recently been heavily criticized for spying on people who are playing on Angry Birds. In their defense people who hate pigs have been involved in a lot of terrorist incidents in recent years. "
    },
    "15": {
        "category": "Political Jokes",
        "id": "post-3277",
        "premise": "Careers Guidance",
        "punchline": "Getting career advice from someone who works as a careers guidance counselor is like getting fashion advice from a homeless person."
    },
    "16": {
        "category": "Political Jokes",
        "id": "post-2798",
        "premise": "Greatest President",
        "punchline": "Q. Why is President Clinton the greatest president of all time? \nA. Because he was always HARD at work. "
    },
    "17": {
        "category": "Political Jokes",
        "id": "post-9784",
        "premise": "Food Banks",
        "punchline": "It looks like food banks are just as corrupt as normal banks. I deposited a pack of biscuits at my food bank last week and when I went to collect them today they told me they had gone."
    },
    "18": {
        "category": "Political Jokes",
        "id": "post-669",
        "premise": "Political Acting",
        "punchline": "What’s the difference between an actor and a politician? An actor has better script writers with more believable story-lines."
    },
    "19": {
        "category": "Political Jokes",
        "id": "post-8862",
        "premise": "America Presidential Slogan",
        "punchline": "Ban pre-shredded cheese…. Make America grate again!!"
    },
    "20": {
        "category": "Political Jokes",
        "id": "post-3404",
        "premise": "Drug Dealers",
        "punchline": "Why do people always assume drug dealers are dangerous people who carry guns? Fedex drivers are perfectly respectable people and they deliver drugs all the time. "
    },
    "21": {
        "category": "Political Jokes",
        "id": "post-5829",
        "premise": "Racist Attacker",
        "punchline": "Read in the newspaper today that the police are looking for a racist attacker. I called them up to ask how much money they were offering but apparently it wasn’t a job advertisement. "
    },
    "22": {
        "category": "Political Jokes",
        "id": "post-1238",
        "premise": "Police",
        "punchline": "The police say they burn all the weed they confiscate. That would explain the doughnuts."
    },
    "23": {
        "category": "Political Jokes",
        "id": "post-1879",
        "premise": "School Results",
        "punchline": "Schools have come under pressure recently as large numbers of students have been getting bad exam results. On the plus side pregnancy test results are at an all-time high. "
    },
    "24": {
        "category": "Political Jokes",
        "id": "post-3373",
        "premise": "Danger To Society",
        "punchline": "Why is it that people who own guns are considered a danger to society but it’s perfectly acceptable for someone to own a meat clever and a human-sized freezer?"
    },
    "25": {
        "category": "Political Jokes",
        "id": "post-1879",
        "premise": "School Results",
        "punchline": "Schools have come under pressure recently as large numbers of students have been getting bad exam results. On the plus side pregnancy test results are at an all-time high. "
    },
    "26": {
        "category": "Political Jokes",
        "id": "post-2787",
        "premise": "Royal Baby",
        "punchline": "Thousands of people were crying tears of joy today as the Royal Baby was brought home. Hopefully the extra tissue sales will be enough to keep tissue manufacturers from going bankrupt after David Cameron’s recent ban on adult websites in the UK. "
    },
    "27": {
        "category": "Political Jokes",
        "id": "post-1156",
        "premise": "Methane Emissions",
        "punchline": "Heard on the radio today that global warming is being caused by methane emissions from cows. Does this mean scientists are finally admiting global warming is bullsh*t? "
    },
    "28": {
        "category": "Political Jokes",
        "id": "post-10532",
        "premise": "Library",
        "punchline": "Heard on the news this morning that Donald Trump’s library caught fire last night. Apparently over 2,000 coloring books were destroyed."
    },
    "29": {
        "category": "Political Jokes",
        "id": "post-7926",
        "premise": "Airport Security",
        "punchline": "Top 5 worst things to say to airport security.  1. This pat-down is really turning me on. \n2. I have a sword in my pants. \n3. Would you like to buy some cocaine? I can give you a special deal. \n4. Why don’t you get a real job you fat f*ck? \n5. Can you hurry up please? My bomb is due to explode in about 30 minutes! "
    },
    "30": {
        "category": "Political Jokes",
        "id": "post-6425",
        "premise": "iPhone",
        "punchline": "Think there’s a problem with my iPhone. The battery dies quicker than a black guy in the back of a police van. "
    },
    "31": {
        "category": "Political Jokes",
        "id": "post-3363",
        "premise": "Change",
        "punchline": "Barrack Obama won the election on a platform of “change”. \nI say “what change?”, what’s so new about a black guy who can’t pay his bills and has massive debt problems?"
    },
    "32": {
        "category": "Political Jokes",
        "id": "post-8151",
        "premise": "Funny Place",
        "punchline": "The world is a funny place. We used to have Empires run by Emperors, then Kingdoms run by Kings, now we have Countries…"
    },
    "33": {
        "category": "Political Jokes",
        "id": "post-3625",
        "premise": "Israeli Prime Minister",
        "punchline": "Q. Who is the most tech-savvy Israeli Prime Minister? \nA. Netandyahoo"
    },
    "34": {
        "category": "Political Jokes",
        "id": "post-3056",
        "premise": "Bradley Manning",
        "punchline": "It’s great that dangerous criminals like Bradley Manning are now safely behind bars. I was just about to go on a shooting spree at my local park and would hate it if someone filmed me and gave it to the media."
    },
    "35": {
        "category": "Political Jokes",
        "id": "post-9461",
        "premise": "Misunderstood Man",
        "punchline": "Hitler: I said glass of juice, not gas the Jews. General: Apologies mein fuhrer."
    },
    "36": {
        "category": "Political Jokes",
        "id": "post-6134",
        "premise": "Cheap Holiday",
        "punchline": "Just had an email about a cheap holiday in Syria. Don’t think I’ll BEHEADING to the Middle East any time soon."
    },
    "37": {
        "category": "Political Jokes",
        "id": "post-2108",
        "premise": "Nigerian King",
        "punchline": "Just got an email from a Nigerian king asking for my bank details to send me $1 million. They must think I’m stupid, after going to the trouble of kidnapping his daughter and holding her in my basement I need at least $10 million."
    },
    "38": {
        "category": "Political Jokes",
        "id": "post-900",
        "premise": "Greek Advent Calendar",
        "punchline": "Got myself a Greek advent calendar today. Behind every door there’s a note saying “IOU chocolate”. "
    },
    "39": {
        "category": "Political Jokes",
        "id": "post-10165",
        "premise": "No Wars",
        "punchline": "If women ruled the world there would be no wars.  Wars require strategy and logic. "
    },
    "40": {
        "category": "Political Jokes",
        "id": "post-5897",
        "premise": "Kim Film",
        "punchline": "The North Korean leader Kim Jong Un recently announced he’s gonna be giving out a prize for the best film that’s made about him. The prize is 15 years."
    },
    "41": {
        "category": "Political Jokes",
        "id": "post-1182",
        "premise": "Lawyers",
        "punchline": "What happens when you give viagra to lawyers?  They grow taller. "
    },
    "42": {
        "category": "Political Jokes",
        "id": "post-9671",
        "premise": "Olympic High Jump",
        "punchline": "2020 Olympic high jump results: \nGold – Mexico \nSilver – Mexico \nBronze – Mexico"
    },
    "43": {
        "category": "Political Jokes",
        "id": "post-2251",
        "premise": "Occupier",
        "punchline": "Got a letter today through the post that was addressed to ‘The Occupier’ which was strange because there are no Israelis living here."
    },
    "44": {
        "category": "Political Jokes",
        "id": "post-1821",
        "premise": "Kim Jong-Un",
        "punchline": "Don’t know why everyone suddenly thinks North Korea’s leader Kim Jong-Un is crazy. It was obvious after he made that song ‘Gangnam Style’ that something wasn’t quite right with him."
    },
    "45": {
        "category": "Political Jokes",
        "id": "post-10163",
        "premise": "Money",
        "punchline": "They say money is the root of all evil which is why I never give any money to Africa. They have enough problems already."
    },
    "46": {
        "category": "Political Jokes",
        "id": "post-3577",
        "premise": "Payday Loan",
        "punchline": "The UK government has recently referred to payday loan companies as “idiotic” for trying to target children and get them into debt. I agree, everyone knows the best way to get a child into debt is to offer them a student loan."
    },
    "47": {
        "category": "Political Jokes",
        "id": "post-3639",
        "premise": "Mandela Funeral",
        "punchline": "Went to the Mandela funeral yesterday and it was a really emotional experience, I cried for hours. Didn’t think being surrounded by black people would scare me so much. "
    },
    "48": {
        "category": "Political Jokes",
        "id": "post-3382",
        "premise": "Strike",
        "punchline": "There was a strike today at work! After waiting a long time finally someone turned up who actually knows how to play ten-pin bowling!"
    },
    "49": {
        "category": "Political Jokes",
        "id": "post-1668",
        "premise": "brutal war",
        "punchline": "Why do most people find wars unnecessary and brutal? Because most people don‘t have shares in arms companies."
    },
    "50": {
        "category": "Political Jokes",
        "id": "post-2395",
        "premise": "Sperminator 2",
        "punchline": "A black man was spying on me last night while I was watching Sperminator 2 on my pc. I now really regret voting for him in the 2012 elections."
    },
    "51": {
        "category": "Political Jokes",
        "id": "post-10043",
        "premise": "German Mustache Man",
        "punchline": "Q. How did Hitler master-bate? \nA. Führerously "
    },
    "52": {
        "category": "Political Jokes",
        "id": "post-2635",
        "premise": "Independence Day",
        "punchline": "Earlier today Prince Philip sent a message to the President wishing him a happy Independence Day. His message said “You did a great job destroying the alien mothership and humanity is forever grateful.” "
    },
    "53": {
        "category": "Political Jokes",
        "id": "post-6160",
        "premise": "Feminists",
        "punchline": "Feminists are always wanting to be equal to men? Why not try to be better than men? This shows a lack of ambition which is why men are better. "
    },
    "54": {
        "category": "Political Jokes",
        "id": "post-2515",
        "premise": "Mortgage Deal",
        "punchline": "Government has announced new plans to help first-time buyers which is great. They have as much right as anyone to have a house repossessed."
    },
    "55": {
        "category": "Political Jokes",
        "id": "post-5827",
        "premise": "Bad Response",
        "punchline": "Just been arrested at the airport. Apparently “How many do you need?” is a bad response to the question “Do you have any firearms?”"
    },
    "56": {
        "category": "Political Jokes",
        "id": "post-935",
        "premise": "Queen Prank Call",
        "punchline": "Pizza Hut has made an official complaint to Buckingham Palace for waisting staff time. Apparantly the Queen and her friend Maya Buttreeks ordered twenty ‘Hot 12″ Mexicans’ but refused to pay on delivery!"
    },
    "57": {
        "category": "Political Jokes",
        "id": "post-2906",
        "premise": "Punishment",
        "punchline": "If good things come to those who wait then is being put into prison really a punishment? "
    },
    "58": {
        "category": "Political Jokes",
        "id": "post-6440",
        "premise": "Airport Security",
        "punchline": "Fed up of airport security. Just got stopped for carrying a bottle of water but a guy with a long beard and Turban went through straight away."
    },
    "59": {
        "category": "Political Jokes",
        "id": "post-4112",
        "premise": "Houses",
        "punchline": "I used to make a lot of money in houses but then the police tracked me down and confiscated my printing press. "
    },
    "60": {
        "category": "Political Jokes",
        "id": "post-2306",
        "premise": "Muslim Women",
        "punchline": "If the KKK think white people are so great why do they dress like Muslim Women?"
    },
    "61": {
        "category": "Political Jokes",
        "id": "post-2964",
        "premise": "Missing Flight",
        "punchline": "After being arrested and interrogated today I’ve now discovered that shouting “bomb” at the top of your voice is a bad way to keep yourself amused while waiting at an airport. "
    },
    "62": {
        "category": "Political Jokes",
        "id": "post-3236",
        "premise": "Car Loan",
        "punchline": "Went to the bank today to get a loan for my car. I’ve now got enough money to fill up the tank."
    },
    "63": {
        "category": "Political Jokes",
        "id": "post-1507",
        "premise": "Rock Concert",
        "punchline": "The Prime Minister has recently announced a new initiative to boost our economy. Apparently the Ethiopians are going to be organizing a rock concert for us. "
    },
    "64": {
        "category": "Political Jokes",
        "id": "post-10150",
        "premise": "Chinese",
        "punchline": "The following conversation took place in the palace of the supreme leader of North Korea.  Kim Jong Un: Nuke the Chinese. \nAdviser: No problem your excellency, missiles will be launched in 3 minutes. \nKim Jong Un: I was talking about microwaving some food you idiot."
    },
    "65": {
        "category": "Political Jokes",
        "id": "post-3351",
        "premise": "Cheap Umbrella",
        "punchline": "Just bought a really cheap umbrella that has just fell to bits. I wish kids in 3rd world would take more pride in their work."
    },
    "66": {
        "category": "Political Jokes",
        "id": "post-2785",
        "premise": "Chinese",
        "punchline": "Can’t believe how many things are made by the Chinese these days. Even babies come from the vachina. "
    },
    "67": {
        "category": "Political Jokes",
        "id": "post-2548",
        "premise": "Whistle-blowers",
        "punchline": "Barrack Obama has recently agreed to help the Vatican target whistle-blowers. Any altar \nboys reporting child abuse will now face indefinite detention."
    },
    "68": {
        "category": "Political Jokes",
        "id": "post-648",
        "premise": "X-factor Swimming",
        "punchline": "Just seen Simon Cowell drowning in my local swimming pool so I saved him ……….. as my profile picture on facebook. "
    },
    "69": {
        "category": "Political Jokes",
        "id": "post-880",
        "premise": "Economic Stimulus",
        "punchline": "If increased spending is good for the economy does that mean we can now finally start using monopoly money as legal currency? "
    },
    "70": {
        "category": "Political Jokes",
        "id": "post-531",
        "premise": "Bank Deposit",
        "punchline": "I got thrown out of Barclays Bank today. I was trying to deposit £300,000 in cash but apparantly monopoly money is not a “real currency”!"
    },
    "71": {
        "category": "Political Jokes",
        "id": "post-2785",
        "premise": "Chinese",
        "punchline": "Can’t believe how many things are made by the Chinese these days. Even babies come from the vachina. "
    },
    "72": {
        "category": "Political Jokes",
        "id": "post-957",
        "premise": "Immigrant Rat",
        "punchline": "What’s the diferrence between a rat and an immigrant? Rats find it easier to get jobs in politics or to become lawyers. "
    },
    "73": {
        "category": "Political Jokes",
        "id": "post-3482",
        "premise": "Poppies",
        "punchline": "I heard on the radio today that a warlord in Afghanistan has purchased over 3 million poppies. It’s great to see Islamic military leaders showing their respect to the British Armed Forces."
    },
    "74": {
        "category": "Political Jokes",
        "id": "post-9936",
        "premise": "Feminist",
        "punchline": "How do you confuse a feminist? \nTell her she can’t make you a sandwich."
    },
    "75": {
        "category": "Political Jokes",
        "id": "post-86",
        "premise": "Obama Lies",
        "punchline": "Q. How can you tell if Obama is lying? \nA. His teleprompter is glowing."
    },
    "76": {
        "category": "Political Jokes",
        "id": "post-806",
        "premise": "Hamas Israeli Joke",
        "punchline": "I was going to make a joke about Hamas but it Israeli inappropriate. "
    },
    "77": {
        "category": "Political Jokes",
        "id": "post-3571",
        "premise": "Unemployed Foreigners",
        "punchline": "Just seen a load of unemployed foreigners hanging around in the streets begging for food. The sooner these Canadian Geese fly off back to where they came from the better."
    },
    "78": {
        "category": "Political Jokes",
        "id": "post-200",
        "premise": "Homeless Person Tea",
        "punchline": "No matter how much you give a homeless person for tea… you never get that tea."
    },
    "79": {
        "category": "Political Jokes",
        "id": "post-880",
        "premise": "Economic Stimulus",
        "punchline": "If increased spending is good for the economy does that mean we can now finally start using monopoly money as legal currency? "
    },
    "80": {
        "category": "Political Jokes",
        "id": "post-1534",
        "premise": "UK Credit Rating",
        "punchline": "It’s a disgrace that the UK has recently lost its AAA credit rating. Just because our main export is Walkers Crisps and half the population is on unemployment benefits doesn’t mean we have a weak economy. "
    },
    "81": {
        "category": "Political Jokes",
        "id": "post-4231",
        "premise": "Bolt Controller",
        "punchline": "Q. What do Usain Bolt and a Malaysian air-traffic controller have in common? \nA. They both sweat a lot during work. "
    },
    "82": {
        "category": "Political Jokes",
        "id": "post-152",
        "premise": "Obama Bar",
        "punchline": "An illegal alien, a Muslim and a communist go into a bar. The bartender asks, “What can I get for you President Obama?” "
    },
    "83": {
        "category": "Political Jokes",
        "id": "post-1029",
        "premise": "Scouse Batman",
        "punchline": "Why are scousers similar to batman? Because Robin helps them to survive."
    },
    "84": {
        "category": "Political Jokes",
        "id": "post-9282",
        "premise": "Donald Trump",
        "punchline": "Donald Trump has just released new details about his plan to send illegals back to Mexico. He’s gonna deport them Juan by Juan."
    },
    "85": {
        "category": "Political Jokes",
        "id": "post-5564",
        "premise": "Dangerous World",
        "punchline": "Can’t believe what a dangerous place the world has become recently. Just the other day I went into the toilets of a McDonalds and headbutted someone. "
    },
    "86": {
        "category": "Political Jokes",
        "id": "post-8696",
        "premise": "EU Full",
        "punchline": "Q. Why is the EU full? \nA. They just lost 1 GB."
    },
    "87": {
        "category": "Political Jokes",
        "id": "post-7725",
        "premise": "Colonel Sanders",
        "punchline": "Just heard on the radio that apparently Colonel Sanders got the idea for KFC during WWI when he was raiding a German chicken farm using a flame thrower. "
    },
    "88": {
        "category": "Political Jokes",
        "id": "post-9928",
        "premise": "Double Standards",
        "punchline": "How come when a white person runs someone over it’s called a ‘traffic incident’ but when a Muslim does it they call it a ‘terrorist incident’?"
    },
    "89": {
        "category": "Political Jokes",
        "id": "post-5378",
        "premise": "Bombing",
        "punchline": "A lot of people criticize the American government’s policy of bombing foreign countries to make them more peaceful but on the plus side it’s a great way for Americans to learn geography. "
    },
    "90": {
        "category": "Political Jokes",
        "id": "post-6733",
        "premise": "Greek Government",
        "punchline": "The Greek government has just reported that production of humus and taramasalata is down 50% since the start of the month. Looks like it’s going to be a double dip recession."
    },
    "91": {
        "category": "Political Jokes",
        "id": "post-4624",
        "premise": "Always Say No",
        "punchline": "When it comes to drugs I always say “no”. People keep asking me but I just don’t have any to spare, my house is too small for large scale production."
    },
    "92": {
        "category": "Political Jokes",
        "id": "post-1303",
        "premise": "Prince Harry",
        "punchline": "Prince Harry has heroically volunteered to destroy a cannabis field in Afghanistan. The mission will last over 2 weeks and Harry has requested additional food supplies to be made available. "
    },
    "93": {
        "category": "Political Jokes",
        "id": "post-534",
        "premise": "Brown and sticky",
        "punchline": "What’s brown and sticky? Barack Obama after a wank."
    },
    "94": {
        "category": "Political Jokes",
        "id": "post-7459",
        "premise": "Global Warming",
        "punchline": "I can’t believe all this global warming bullsh*t. The c*nts are always telling people to turn their lights off to save energy and help the planet. Last night I followed their advice, turned my lights off and ended up killing a pedestrian."
    },
    "95": {
        "category": "Political Jokes",
        "id": "post-8744",
        "premise": "Airline Passengers",
        "punchline": "According to a recent survey young kids are apparently the most annoying airline passengers.  I would have thought it might be terrorists."
    },
    "96": {
        "category": "Political Jokes",
        "id": "post-1735",
        "premise": "News Lies",
        "punchline": "The news is full of lies… Just went to the bank to get my hair cut and security escorted me from the premises!"
    },
    "97": {
        "category": "Political Jokes",
        "id": "post-9333",
        "premise": "Hillary Clinton",
        "punchline": "The following conversation took place between Hillary Clinton and Satan.  Hillary: I thought you said I was gonna win the election!! \nSatan: I thought you said you had a soul."
    },
    "98": {
        "category": "Political Jokes",
        "id": "post-5982",
        "premise": "Gun Control",
        "punchline": "Im a great believer in gun control. That’s why I always smoke a couple of cigarettes before I go out shooting because it helps keeps my hands steady."
    },
    "99": {
        "category": "Political Jokes",
        "id": "post-9273",
        "premise": "Election Night",
        "punchline": "Just been watching the news and it’s f*ckin terrifying. Election night has now officially become more scary than Halloween. "
    },
    "100": {
        "category": "Political Jokes",
        "id": "post-7140",
        "premise": "Terrible Day",
        "punchline": "I’ll never forgot 9/11, it was a terrible day but sometimes beautiful surpises can bloom from tragic seeds. For example, my house actually climbed 2 places in the list of world’s tallest buildings."
    },
    "101": {
        "category": "Political Jokes",
        "id": "post-9044",
        "premise": "Weapons Of Mass Destruction",
        "punchline": "Shocking information has just been discovered that North Korea is developing weapons of mass destruction and we need to invade them. …. Oh wait, false alarm, they don’t have any oil."
    },
    "102": {
        "category": "Political Jokes",
        "id": "post-6416",
        "premise": "New Baby",
        "punchline": "Apparently Kate and William have decided to give their new baby the humorous name of ‘Webecca’ so when she grows up people will think she has a speech impediment. "
    },
    "103": {
        "category": "Political Jokes",
        "id": "post-4621",
        "premise": "End Poverty",
        "punchline": "Every year charities spend millions trying to end poverty and nothing ever changes. Maybe it’s time to accept the facts. If you live in the middle of a desert and the nearest supermarket is hundreds of miles away MOVE SOMEWHERE ELSE!! "
    },
    "104": {
        "category": "Political Jokes",
        "id": "post-10093",
        "premise": "Hypocrite",
        "punchline": "My cousin is such a hypocrite. He said he was against the death penalty but last week he killed himself. "
    },
    "105": {
        "category": "Political Jokes",
        "id": "post-8720",
        "premise": "Shower",
        "punchline": "I’ve decided I’m never going to jack off in the shower ever again.  Just been informed by the police that I’ve now been given a lifetime ban from the Auschwitz Museum."
    },
    "106": {
        "category": "Political Jokes",
        "id": "post-1251",
        "premise": "stripper",
        "punchline": "Saw a female police officer stripping last night at a club.  I had no idea the recession had hit the police force this hard! "
    },
    "107": {
        "category": "Political Jokes",
        "id": "post-7845",
        "premise": "School Curriculum",
        "punchline": "The following conversation took place in a government meeting regarding the school curriculum.  Adviser: So what are we gonna teach the kids? \nPolitician: I’ve decided to go with Pythagoras’s theorem. \nAdviser: But what about car repairs, applying for loans, buying a house, starting a business or doing taxes? \nPolitician: No!! Finding the length of a triangle is more important."
    },
    "108": {
        "category": "Political Jokes",
        "id": "post-6716",
        "premise": "Islamic Terrorist",
        "punchline": "Did you hear about the Islamic terrorist who was arrested in Liverpool the other day? His name was Ayaluf Roh-Bin Kaahs. "
    },
    "109": {
        "category": "Political Jokes",
        "id": "post-6716",
        "premise": "Islamic Terrorist",
        "punchline": "Did you hear about the Islamic terrorist who was arrested in Liverpool the other day? His name was Ayaluf Roh-Bin Kaahs. "
    },
    "110": {
        "category": "Political Jokes",
        "id": "post-6767",
        "premise": "Holidays Online",
        "punchline": "When booking holidays online this summer remember that when it comes to hotels star ratings mean nothing. I went to this terrible hotel last year that apparently had the biggest collection of stars in the world, it was called Auschwitz."
    },
    "111": {
        "category": "Political Jokes",
        "id": "post-7374",
        "premise": "Abortion",
        "punchline": "If Catholics are really against abortion then why do they hate gay people? Gay people never have abortions. "
    },
    "112": {
        "category": "Political Jokes",
        "id": "post-7227",
        "premise": "Cigarette",
        "punchline": "Just been given a fine by the police. I normally love having a cigarette after sex but apparently its illegal now to smoke with a 16 year old in the car."
    },
    "113": {
        "category": "Political Jokes",
        "id": "post-8751",
        "premise": "Election",
        "punchline": "If Hilary wins the election I wonder if she’ll keep the same desk that Monica used to go under."
    },
    "114": {
        "category": "Political Jokes",
        "id": "post-1488",
        "premise": "UK School",
        "punchline": "I is very proud dat I went 2 school in da UK. I fink out of all 17 countries in da world UK is da best."
    },
    "115": {
        "category": "Political Jokes",
        "id": "post-649",
        "premise": "Obama Road Crossing?",
        "punchline": "Why did Barack Obama cross the road? So he could dish out stolen tax money to his welfare queens."
    },
    "116": {
        "category": "Political Jokes",
        "id": "post-8655",
        "premise": "Elections",
        "punchline": "Q. What’s the worst thing about elections?  A. There’s always some cunt who wins. "
    },
    "117": {
        "category": "Political Jokes",
        "id": "post-9994",
        "premise": "Cow",
        "punchline": "Whats the difference between a cow and 9/11? Americans can’t milk a cow for 16 years."
    },
    "118": {
        "category": "Political Jokes",
        "id": "post-7496",
        "premise": "Respek",
        "punchline": "Cant belive how bad things have become in the world recently. People have no respek anymore. Even in the dictionary the word respek has been taken out."
    },
    "119": {
        "category": "Political Jokes",
        "id": "post-8742",
        "premise": "Difference",
        "punchline": "Q. What’s the difference between a gorilla and a black person? \nA. Police don’t shoot gorillas. "
    },
    "120": {
        "category": "Political Jokes",
        "id": "post-8780",
        "premise": "Terrorists",
        "punchline": "My little girl told me today she doesn’t want to leave the house because she’s scared of terrorists. I told her it’s not the terrorists you should be scared of, it’s the highly destructive shockwaves produced by rapidly expanding explosive material."
    },
    "121": {
        "category": "Political Jokes",
        "id": "post-9642",
        "premise": "New Presidential Oath",
        "punchline": "I do bigly swear that I will grab the office of president of the United States by the pussy, screw you brown people!!"
    },
    "122": {
        "category": "Political Jokes",
        "id": "post-4958",
        "premise": "Rolf Harris",
        "punchline": "What’s the difference between Rolf Harris and an Israeli soldier? \nWhen Rolf f*cks children he always takes them to McDonald’s first."
    },
    "123": {
        "category": "Political Jokes",
        "id": "post-4700",
        "premise": "World Cup Winner",
        "punchline": "After receiving a $5 billion donation from the Brazilian government Fifa have just announced that they would like to congratulate Brazil on winning the 2014 World Cup 3-1 against Argentina on 13th July 2014."
    },
    "124": {
        "category": "Political Jokes",
        "id": "post-6000",
        "premise": "Sexy Politics",
        "punchline": "Can’t believe how sexy politics has become since Barack Obama took office. When he was on the TV the other day I think I must have jerked off about 3 times. "
    },
    "125": {
        "category": "Political Jokes",
        "id": "post-7409",
        "premise": "Bar",
        "punchline": "A Muslim walks into a bar. Lots of people get killed. "
    }
}