{
    "1": {
        "category": "Sports Jokes",
        "id": "post-2631",
        "premise": "Lion",
        "punchline": "A lion would never cheat on his wife but a Tiger Wood. "
    },
    "2": {
        "category": "Sports Jokes",
        "id": "post-8860",
        "premise": "Gym",
        "punchline": "My first day back at the gym today went well. I did 20 minutes of cardio, 10 minutes on the defibrillator and then 3 days in the hospital. "
    },
    "3": {
        "category": "Sports Jokes",
        "id": "post-2634",
        "premise": "Usain Bolt",
        "punchline": "Why does Usain Bolt suffer from relationship problems?  Because he always comes first. "
    },
    "4": {
        "category": "Sports Jokes",
        "id": "post-4784",
        "premise": "Amazon Attack",
        "punchline": "A tribe in the Amazon rain forest is thought to be responsible for a viscous cannibalistic attack on a group of World Cup supporters yesterday while they were hiking. Police have issued a statement warning people to be on the look out for a man with goofy teeth, short black hair and wearing a Uruguay football shirt."
    },
    "5": {
        "category": "Sports Jokes",
        "id": "post-7345",
        "premise": "Marathon",
        "punchline": "There’s nothing more entertaining than going to watch a marathon live. My favorite part is the reaction of the runner’s face when I give him a cup of vodka."
    },
    "6": {
        "category": "Sports Jokes",
        "id": "post-4846",
        "premise": "Lewis Hamilton",
        "punchline": "Lewis Hamilton recently won the British Grand Prix. Last time a black guy drove that fast he was being shot at. "
    },
    "7": {
        "category": "Sports Jokes",
        "id": "post-399",
        "premise": "England Team Visit Orphanage",
        "punchline": "The England team visited an orphanage today in Poland. ‘It was amazing to put a smile on the faces of a group of people who constantly struggle and have little hope’ said Jan Zamoyski, aged 6"
    },
    "8": {
        "category": "Sports Jokes",
        "id": "post-343",
        "premise": "Pool Table Balls",
        "punchline": "How do you make a pool table laugh? \nTickle it’s balls. "
    },
    "9": {
        "category": "Sports Jokes",
        "id": "post-1077",
        "premise": "Martial Arts sickness",
        "punchline": "What sickness does a martial artist get? Kung flu. "
    },
    "10": {
        "category": "Sports Jokes",
        "id": "post-1206",
        "premise": "Tesco Burgers",
        "punchline": "Tesco Value Burgers – Low in fat high in Shergar. What do you put on your burgers? A fiver each way. "
    },
    "11": {
        "category": "Sports Jokes",
        "id": "post-437",
        "premise": "London 2012 Olympics Debt Joke",
        "punchline": "Total UK National Debt …. £1.3 trillion. \nTotal number of people in the UK unemployed …. 6.3 million \nCost of hosting London 2012 per UK taxpayer …. £550 Watching Mr Bean play the Piano …. Priceless"
    },
    "12": {
        "category": "Sports Jokes",
        "id": "post-7051",
        "premise": "Keeper",
        "punchline": "The first time I met my wife, I knew she was a keeper. She was wearing massive gloves."
    },
    "13": {
        "category": "Sports Jokes",
        "id": "post-420",
        "premise": "John Terry Donation",
        "punchline": "In a bid to promote his image and ease race relations John Terry has kindly donated 100 trumpets to an African orphanage in Nigeria. Apparently he was quoted as saying “Blacks are naturally talented at music and with their big lips they should be great at trumpet playing”. "
    },
    "14": {
        "category": "Sports Jokes",
        "id": "post-4824",
        "premise": "World Cup",
        "punchline": "3 similarities between the World Cup and having sex. 1. People take their shirts off and hug each other quite a lot. \n2. Brazilians always look good. \n3. You often see a lot of dribbling in the box. "
    },
    "15": {
        "category": "Sports Jokes",
        "id": "post-5649",
        "premise": "Ladies Man Chat-Up Line",
        "punchline": "Hey babe, I’m a real ladies man. I’ve been down more holes than Tiger Woods. "
    },
    "16": {
        "category": "Sports Jokes",
        "id": "post-5960",
        "premise": "Mental Patient",
        "punchline": "The following conversation took place between a mental patient and a doctor.  Patient: Doctor please help me. I keep thinking I’m John McEnroe! \nDoctor: You can’t be serious!! "
    },
    "17": {
        "category": "Sports Jokes",
        "id": "post-374",
        "premise": "Wayne Rooney Hair",
        "punchline": "Why did the ‘hare’ cross the road? To avoid being surgically attached to Wayne Rooney’s scalp."
    },
    "18": {
        "category": "Sports Jokes",
        "id": "post-4231",
        "premise": "Bolt Controller",
        "punchline": "Q. What do Usain Bolt and a Malaysian air-traffic controller have in common? \nA. They both sweat a lot during work. "
    },
    "19": {
        "category": "Sports Jokes",
        "id": "post-1517",
        "premise": "Oscar Pistorious",
        "punchline": "Oscar Pistorius may be guilty but to be fair girls spend f*cking ages in the bathroom!"
    },
    "20": {
        "category": "Sports Jokes",
        "id": "post-74",
        "premise": "Tennis Witches",
        "punchline": "Did you hear the latest story about some major tennis players being involved in witchcraft?? Goran, even he’s a witch."
    },
    "21": {
        "category": "Sports Jokes",
        "id": "post-1542",
        "premise": "Oscar Pistorious Bail",
        "punchline": "Since his release on bail Oscar Pistorious has decided to spend the weekend clay pigeon shooting to relax. So far he’s accidentally killed 2 elephants and shot a Jeep that was on safari. "
    },
    "22": {
        "category": "Sports Jokes",
        "id": "post-330",
        "premise": "Manchester United Beep",
        "punchline": "What’s red and beeps? The Manchester United open-top bus reversing back in the garage."
    },
    "23": {
        "category": "Sports Jokes",
        "id": "post-2647",
        "premise": "Table Tennis",
        "punchline": "I got injured playing table tennis yesterday. It’s great having the extra surface area but \nthe added weight can really hurt your back."
    },
    "24": {
        "category": "Sports Jokes",
        "id": "post-3103",
        "premise": "Golf",
        "punchline": "Played golf earlier today after taking LSD, it was crazy!! "
    },
    "25": {
        "category": "Sports Jokes",
        "id": "post-3103",
        "premise": "Golf",
        "punchline": "Played golf earlier today after taking LSD, it was crazy!! "
    },
    "26": {
        "category": "Sports Jokes",
        "id": "post-4308",
        "premise": "David Moyes",
        "punchline": "David Moyes recently appeared at a charity event where he said “AIDS was a terrible disease”. That’s rich coming from him, at least AIDS managed to get into Europe."
    },
    "27": {
        "category": "Sports Jokes",
        "id": "post-461",
        "premise": "Brown Speed",
        "punchline": "Q. What’s brown, 12 inches long, and can do the 100 metres in under 10 seconds? A. Usain Bolt’s dick."
    },
    "28": {
        "category": "Sports Jokes",
        "id": "post-30",
        "premise": "Man United",
        "punchline": "How many man united fans does it take to pave up a driveway? Depends how thin you slice them."
    },
    "29": {
        "category": "Sports Jokes",
        "id": "post-369",
        "premise": "Racist Football Chant",
        "punchline": "Apparently racist chanting was heard at the England training ground earlier today. The FA have threatened to remove John Terry from the squad if he does it again."
    },
    "30": {
        "category": "Sports Jokes",
        "id": "post-8609",
        "premise": "Betting",
        "punchline": "Just made a small fortune betting on the Euro 2016 football championships.  Unfortunately I spent a big fortune placing my bets. "
    },
    "31": {
        "category": "Sports Jokes",
        "id": "post-4700",
        "premise": "World Cup Winner",
        "punchline": "After receiving a $5 billion donation from the Brazilian government Fifa have just announced that they would like to congratulate Brazil on winning the 2014 World Cup 3-1 against Argentina on 13th July 2014."
    },
    "32": {
        "category": "Sports Jokes",
        "id": "post-4863",
        "premise": "Germans",
        "punchline": "After watching TV last night I can’t believe how ruthless and efficient the Germans were. Schindler’s list is a great film. "
    }
}